[
    {
        "username": "jaydilks",
        "timestamp": "2023-06-21T19:03:26Z",
        "content": "$DNA One Day Chart. Meaningless to most but it might be telling you something if you zoom out. Bullish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": -0.2382,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.99554044008255
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-06-21T13:47:04Z",
        "content": "$DNA Added a smidge at $1.79. Bullish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9935441017150879
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-06-21T12:49:59Z",
        "content": "$SCHD Current top holdings per Schwab. About 40% of the portfolio. Bullish",
        "sentiment": {
            "TextBlob": 0.25,
            "NLTK": 0.2023,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9968026876449585
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-06-21T11:14:53Z",
        "content": "$ARKG $TDOC is likely one of the most divisive holdings ARKG has ever owned for disappointment. That being said: Has anyone noticed it’s Market Cap size is only $4 Billion? I’m going to call it right now that TDOC will be acquired in 2023 for at least a 100% Premium to today’s price. It’s immediately accretive if Amazon,CVS, The Department of Defense or any Healthcare System bought it today. Veterans Affairs should buy it NOW. Bullish",
        "sentiment": {
            "TextBlob": -0.019047619047619046,
            "NLTK": -0.4215,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9990708827972412
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-06-20T22:44:06Z",
        "content": "$ARKG $EXAS up big after hours. It’s the #1 holding at 11.54%. ark-funds.com/wp-content/up... Bullish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9982845187187195
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-06-20T16:17:44Z",
        "content": "$DNA is a Materials company. If you are looking for a Cup and Handle, it sure looks like a Full Cup ready to breakout. Here is $XLB as the liquid AND the bottom of the Handle. \n\nSometimes you see the SECTOR fill the top of the cup for confirmation before a breakout. \n\nMaterials are Cyclical and that’s what typically rallies after Tech Fizzles a bit. Bullish",
        "sentiment": {
            "TextBlob": 0.27666666666666667,
            "NLTK": 0.7964,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9986299276351929
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-06-20T14:01:16Z",
        "content": "$DNA $1.86 is a price many people were waiting for on a dip for a Pivot Point of support, then Higher. Bullish",
        "sentiment": {
            "TextBlob": 0.375,
            "NLTK": 0.4019,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9989843964576721
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-06-19T13:23:40Z",
        "content": "$DNA Agriculture is more important to a Nation than any expense with the exception of National Defense. So let me ask you this: Syngenta Seeds will IPO in Shanghai to raise $6 Billion but the company will be valued at $60 Billion. On April 17th when this partnership was announced, how much was paid as equity in Syngenta Seeds Equity and how much was promised for additional buildout with Ginkgo Bioworks in the form as Cash ?\n\nprnewswire.com/news-release... Bullish",
        "sentiment": {
            "TextBlob": 0.325,
            "NLTK": 0.8358,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9967309236526489
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-06-17T12:12:40Z",
        "content": "$ARKG $$ARKK $DNA J.C. Parents is really an incredible Technical Analyst. I believe this view is something people need to embrace.",
        "sentiment": {
            "TextBlob": 0.45,
            "NLTK": 0.3182,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.999329686164856
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-06-17T12:00:37Z",
        "content": "$DNA If you really want to drink some strong Coffee out of a Cup, you take $12.50 as the top of the cup, yesterday was really the beginning of leaving the bottom, you go to $12.50 in 2 years then $22 in 2026. Again, lots of interpretation. All my examples could form into this one. The eye is in the beholder. If I told you interest rates would be between 0% and 2% in 2025, this might seem easier to imagine. That could certainly happen. Bullish",
        "sentiment": {
            "TextBlob": 0.3095238095238095,
            "NLTK": 0.9168,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.7656437158584595
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-06-17T11:51:00Z",
        "content": "$DNA Another point of view, that’s easier for me to embrace is we just exited the bottom of the cup and the top is $3.75. That would last until the Fall, handle until Christmas, $7-$9 on July 4th 2024.",
        "sentiment": {
            "TextBlob": 0.25,
            "NLTK": 0.7096,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9897704124450684
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-06-17T11:37:41Z",
        "content": "$DNA A lot of people are talking about DNA is forming a classic “Cup and Handle Pattern” and that’s pretty obvious to see in my humble opinion. The top of one side of the cup was January 14th at $1.95 and the other side of the cup was this week at $1.95, you get a 10% dip to “maybe” $1.75-$1.85 BUT you might go sideways from here for a week and then off to the races UP. Anyone can do a Google search for what’s a Cup and Handle pattern. Most agree the Cup goes 50% Deep and then 50% back up to fill the cup. That would mean the bottom was $1.12, 150% higher is $2.24 just to fill the cup, sideways for a week or so then WAAAAY UP. Yesterday could have been the bottom of the handle based on a $2.24 top of the side of the cup. This is where Technical Analysis loses me because it’s like interpreting a Jackson Pollock Painting. The handle has enormous interpretation. It’s like target shooting in Fog. Good luck with your optics. You need some luck to hit the bullseye.",
        "sentiment": {
            "TextBlob": 0.12057291666666665,
            "NLTK": 0.9744,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9986425042152405
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-06-16T13:22:18Z",
        "content": "$ARKG is managed and trades very differently than other ARK ETFs. It’s the reason it’s the only ARK ETF I own right now. It’s what $ARKW was in 2015 before ARKW became a rocket ship higher. Instead of Bitcoin, Chinese Stocks and Tesla, ARKG is loaded with the new economy that will be dominated by combining Biology with Technology.\n\nIt’s a big idea. Bullish",
        "sentiment": {
            "TextBlob": 0.12745310245310243,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9753809571266174
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-06-16T11:30:13Z",
        "content": "$DNA Since May 19th, Ginkgo Bioworks has outperformed $QQQ by 36%. What is really odd, and I don’t even remember this is Ginkgo outperformed QQQ last year from June until November too. ginkgo is the Blue line from last year in that timeframe until just before Thanksgiving. DNA is a broken stock since it de-SPACd BUT it showed signs of strength last year for a very long stretch of time relative to QQQ and now seemingly about to do the same. Bullish",
        "sentiment": {
            "TextBlob": -0.07018518518518518,
            "NLTK": 0.3514,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9979483485221863
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-06-15T21:11:00Z",
        "content": "$SCHD Leaders of SCHD today.",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9906315803527832
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-06-15T21:09:09Z",
        "content": "$SPGP A lot of positive moves today.",
        "sentiment": {
            "TextBlob": 0.22727272727272727,
            "NLTK": 0.5574,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9996809959411621
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-06-15T21:05:56Z",
        "content": "$ARKG Big moves today in ARKG. $VERV $SDGR",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.7356217503547668
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-06-15T20:04:46Z",
        "content": "$DNA Awesome.",
        "sentiment": {
            "TextBlob": 1.0,
            "NLTK": 0.6249,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9997254014015198
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-06-15T17:45:23Z",
        "content": "$DNA Not a massive volume day is often a sign of overhead supply of shares to sell are exhausted. We shall see. $1.91 is the 200 Day Moving Average. $1.93 is the Pivot Point HIGHER. \n\nResistance is becoming SUPPORT. \n\nSort of Textbook action over the last month or so. To the Penny. Bullish",
        "sentiment": {
            "TextBlob": 0.03571428571428571,
            "NLTK": 0.4824,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9974685907363892
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-06-15T13:05:24Z",
        "content": "$DNA There’s someone on here who is shorting this who also shorted $NVDA in May. Consider the Source. This person is reasonable down 60-100% on TWO investments in about a month. It’s a classic example of how you can be wiped out rapidly by gambling on a SHORT. It happens fast. Bullish",
        "sentiment": {
            "TextBlob": 0.08222222222222222,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.992766261100769
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-06-15T11:50:55Z",
        "content": "$TSLA When you zoom out, it doesn’t look so Toppy. We likely have a few weeks of consolidation. I might even add shares on any further weakness. Anyone likely has a couple of weeks to add, they announce quarterly sales before July 4th and then it moves up again. The next couple of weeks could be sloppy but I wouldn’t get too cute on timing things. Bullish",
        "sentiment": {
            "TextBlob": -0.01666666666666667,
            "NLTK": 0.5719,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.8585655689239502
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-06-15T11:35:37Z",
        "content": "$DNA is certainly not Berkshire Hathaway. Really they should not be mentioned together.\n\nI will give Jason Kelly some credit for 4 very Berkshire like qualities.\n1. Two quarters ago he quoted Warren Buffet about the kind of party investors are invited to. A Dinner Party or a Rave. I’ve attached his thought.\n2. Berkshire always has their shareholder meeting on a Saturday. Ginkgo is having their meeting Friday after the market closes. I personally like this to have the entire weekend to digest it. This is highly unusual. \n3. Jason Kelly hates debt. They have $1.2 Billion in Cash which is extraordinarily unusual in Biotech. \n4. They hired a new Chief Accounting Officer that started May 15th. Steven Coen came from Charles River Labs and is maybe the best acquisition they’ve made. I like this a lot as I believe they want Earnings Calls to be moved up on the Calendar. It’s a Superpower Tesla has always had to be early on Financial Results. It removes doubt so people can look forward.",
        "sentiment": {
            "TextBlob": 0.21076839826839824,
            "NLTK": 0.933,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9972155094146729
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-06-14T18:11:01Z",
        "content": "$DNA Ginkgo does not need to borrow money. With $1.2 Billion in the bank, they make MORE in interest from their cash. They have a Moat. Bullish",
        "sentiment": {
            "TextBlob": 0.5,
            "NLTK": 0.6091,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9829227924346924
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-06-14T18:07:46Z",
        "content": "$ARKG Adding just a little bit here. Bullish",
        "sentiment": {
            "TextBlob": -0.1875,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9977346658706665
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-06-14T13:40:25Z",
        "content": "$DNA The part in here that’s really interesting is SPORTS RECOVERY as the most near term value. Making something that tastes great and really works is something easy to attract Athlete Venture Capital Money so they can eventually be acquired by $KO or $PEP . It’s owned by Ginkgo Bioworks. prnewswire.com/news-release... Bullish",
        "sentiment": {
            "TextBlob": 0.4222222222222222,
            "NLTK": 0.9344,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9969180822372437
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-06-13T13:40:20Z",
        "content": "$DNA This 10 cent pocket between $1.90-$2 has some work to do. I wouldn’t be disappointed if it took the rest of the week to work off from overhead supply of shares. It will get there. Bullish",
        "sentiment": {
            "TextBlob": -0.75,
            "NLTK": -0.2263,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9912365674972534
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-06-13T11:20:40Z",
        "content": "$DNA If you missed the presentation last night I’ll sort of critique the delivery by style.\n\nJason Kelly is off the charts “Genius” for intellectual capacity. From a Synthetic Biology point of view, he’s the very best communicator in the space. Elon Musk would desire to have his communication style for speed and being able to simplify things. I also believe Jason Kelly struggles to contain himself by communicating at a lower intelligence level for layman to understand. It’s like Michael Jordan in his Prime playing against High School Competition. The thought of scoring 100 points is not exciting to him doing this.\n\nAnna , I don’t get that feeling. She’s a great communicator for sure. She comes at it from an Offensive Coordinator in Football angle. The head coach sort of asks her to score 42 points and she’s explaining the most efficient way to score those points.\n\nJason uses Biology as the starting point.\nAnna is using the Foundry (the buildings with machines) as a starting point.",
        "sentiment": {
            "TextBlob": 0.3281818181818182,
            "NLTK": 0.9465,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.8806757926940918
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-06-13T11:08:34Z",
        "content": "@tryhardernow Here is $SPGP vs. $SPY over a decade plus. It beats it by about 100%. Bullish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9635395407676697
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-06-13T11:05:22Z",
        "content": "@tryhardernow My favorite ETF to sort of hold forever is $SPGP. It’s a GARP (Growth at a REASONABLE Price) ETF. It only holds 75 of the the S&P 500 stocks and eliminates the Junk. $META is the #1 holding in that ETF. It’s not just Cathie Wood who sees it as the most reasonable pick for Growth. I have a personal bias that I really dislike Mark Zuckerberg. Invesco eliminates my Bias and overcomes it. Maybe META is a blind spot for both of us. invesco.com/us/financial-pr... Bullish",
        "sentiment": {
            "TextBlob": 0.13749999999999998,
            "NLTK": -0.2006,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.994269609451294
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-06-13T10:57:56Z",
        "content": "$ARKG Not a lot of people invest in ARKG because of the size of the companies. Most just assume they are all very small and speculative. Most people agree that the next leg of growth in the stock market will go from Mega Cap companies to smaller companies as the rally broadens out. That’s healthy for a market. Here’s a breakdown of how big the companies are in ARKG.\n22% Large, 0% Mega Cap, 34% Mid Cap, 30% Small Cap, 14% Microcap Bullish",
        "sentiment": {
            "TextBlob": 0.11392857142857142,
            "NLTK": 0.829,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.7465990781784058
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-06-13T00:19:06Z",
        "content": "$DNA Great presentation. Honestly, no complaints. Bullish",
        "sentiment": {
            "TextBlob": 0.25,
            "NLTK": 0.4939,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9650769233703613
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-06-12T20:59:25Z",
        "content": "$DNA Some News. agfundernews.com/%F0%9F%8E%... Bullish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9995126724243164
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-06-12T20:36:04Z",
        "content": "@tryhardernow Ginkgo is a Materials Company. $XLB is only up 2.16% in 2023. Bullish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.997620165348053
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-06-12T20:27:38Z",
        "content": "$DNA is beating the S&P 500 in 2023 and it’s hitting a 52 week High. I’m now knocking on wood.\n\n$1.96 to the $2 level has a lot of resistance but only a few days of resistance (POTENTIALLY). There is a really big air pocket HIGHER past that. Today was a great start but expect a few days of a fight. \n\nIt’s worth fighting for in the long run. \n\nAnna Marie Wagner speaks soon. She is tremendous and underrated as an Operator in this space. Tough, Smart, has understated Charisma. Bullish",
        "sentiment": {
            "TextBlob": 0.06919501133786848,
            "NLTK": 0.4854,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9870211482048035
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-06-12T20:04:11Z",
        "content": "$DNA Does anyone have a link for Ginkgo’s talk at 4:40 at Goldman Sachs ?  Dummy me requested access after “Bankers Hours”. Bullish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9995286464691162
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-06-12T20:02:10Z",
        "content": "$DNA 37 Million Shares is WAAAAY above the 50 Day Average. Today was a ……Stand Up Triple, in baseball terms. Bullish",
        "sentiment": {
            "TextBlob": -0.075,
            "NLTK": 0.296,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9406262040138245
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-06-12T19:07:41Z",
        "content": "@Samalex I’m not seeing that. I would put $TWST at the top of the list but it would have to be merged, not acquired. Twist is valued at about $1 Billion. Bullish",
        "sentiment": {
            "TextBlob": 0.5,
            "NLTK": 0.6428,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9986521601676941
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-06-12T13:54:17Z",
        "content": "$ARKG This is the type of leadership we want to see. It leans into Edgy.  Solid leaders, not just 1 outlier. Bullish",
        "sentiment": {
            "TextBlob": -0.15,
            "NLTK": 0.2263,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9979604482650757
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-06-12T11:31:01Z",
        "content": "$ARKG This has been quite a grind for ARKG to move out of a trading range. ARKG is up 18% in 2023 but it sort of doesn’t feel like it. $NTLA , the # 8 holding, is doing what a lot of ARKG holdings are doing………punching through their 200 day moving average. It has been feeling like a Beach Ball being held below the water for MONTHS. It might be ready to rise, maybe even violently.\n\nLots of Macro Variables creating an immense Wall of Worry. Let’s see if that crumbles. Bullish",
        "sentiment": {
            "TextBlob": -0.1875,
            "NLTK": 0.5023,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9977743029594421
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-06-11T20:13:16Z",
        "content": "$DNA If you don’t want to own Ginkgo Bioworks directly, there’s 4 ETFs that have Ginkgo as top 15 holdings.\n$ARKG $IDNA $MRND $WDNA",
        "sentiment": {
            "TextBlob": 0.39999999999999997,
            "NLTK": 0.2732,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.679753303527832
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-06-10T17:45:51Z",
        "content": "$DNA Did anyone notice Ginkgo Bioworks WARRANTS were trading up 28.64% to close Friday ?\n\nI’m sort of shocked this didn’t get any attention. \n\nI sort of forget that I own them. $DNAWS Bullish",
        "sentiment": {
            "TextBlob": -0.04999999999999999,
            "NLTK": -0.584,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.999377965927124
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-06-10T12:29:51Z",
        "content": "$SPGP Since 2011, $SPGP has beaten the S&P 500 $SPY $VOO by almost 100%. There are pockets of underperformance and 2023 at this moment, is one of the biggest extremes. That’s a buy signal for SPGP that has a very low PE Ratio, Lower Price to Book and Lower Average Market Cap vs the S&P 500 plus Apple is larger than the bottom 200 companies in the S&P 500.",
        "sentiment": {
            "TextBlob": -0.049999999999999996,
            "NLTK": -0.8221,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.996002733707428
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-06-10T11:40:17Z",
        "content": "$DNA In 2023, DNA is up 9.79%. The S&P 500 is up 12.41% and hit a 52 week high.\n\nStarting on Monday, would you rather own the S&P 500 or Ginkgo Bioworks for the winner of a new race to finish the year? \n\nRight now, Apple is larger than the bottom 200 companies combined in the S&P 500.",
        "sentiment": {
            "TextBlob": 0.197012987012987,
            "NLTK": 0.5859,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9810165762901306
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-06-09T19:02:25Z",
        "content": "$DNA Next week, the 200 day goes under $1.90. Let’s take that OUT.",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9987305998802185
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-06-09T10:28:24Z",
        "content": "$DNA Kind of “Text Book” action the last few days. Big run and then it sort of stalls while it works through some stuff. People take some short sighted gains or just move onto something else then back to work moving up. I’m not sure if that happens today but it will eventually. Good News helps too. Jay Powell speaks next week. Those resistance points above will be chipped away and then there is room above. Shockingly similar to $TSLA earlier this year. Way different companies, similar rebound ahead. Bullish",
        "sentiment": {
            "TextBlob": 0.059375,
            "NLTK": 0.752,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9903338551521301
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-06-09T01:16:39Z",
        "content": "$ARKG For Friday, you might want to keep an eye on #6 holding $CRSP and #21 $VRTX . #8 $NTLA might get a boost too on positive news. Sickle Cell. Bullish",
        "sentiment": {
            "TextBlob": 0.22727272727272727,
            "NLTK": 0.765,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.99021977186203
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-06-08T20:07:59Z",
        "content": "$DNA $AMRS was up 24% today. Be happy for them. There is no connection between Ginkgo and Amyris any longer but they are in the Synthetic Biology Space. You want Amyris to survive and thrive ! Their products are excellent. Bullish",
        "sentiment": {
            "TextBlob": 1.0,
            "NLTK": 0.8197,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9956235289573669
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-06-08T19:40:11Z",
        "content": "$DNA 200 trading days ago, DNA was $3.74. It was the highest price between June and October. \nOver the next month, it dropped to $2.41.\nToday the 200 Day Moving average is $1.94. \nStarting tomorrow it starts feeding the algorithm DOPE that brings soothing comfort. \n\nI am genuinely a Fundamental investor but really for the next 9 months, that drip of DOPE keeps the Algorithm’s feeling good. \n\nBad news is removed in the rearview mirror daily. Bullish",
        "sentiment": {
            "TextBlob": 0.05000000000000001,
            "NLTK": 0.3071,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9887099862098694
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-06-08T16:47:16Z",
        "content": "$DNA Eric Schmidt, former Google CEO and current Biology+Technology enthusiast , just promoted this book on Twitter. the-coming-wave.com/ Bullish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.6486,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.6517407894134521
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-06-08T12:50:03Z",
        "content": "$DNA Expanding on BTIG : It was SPECIFICALLY to Fund the $83 Million to buy the Bayer Crop Sciences Facility in California. If Ginkgo were to rapidly become a $20 stock, my educated guess is it will be from this. Agriculture is fairly easy to model revenue. Analysts have an easy time doing this without coming up with Biotech type valuations for Cancer Cures. Give me a new variant of Corn that requires ZERO fertilizer and grows in poor soil and you have a blockbuster that prints cash for the other cool stuff.\n\nWe aren’t there………YET. bayer.com/media/en-us/bayer... Bullish",
        "sentiment": {
            "TextBlob": 0.1380050505050505,
            "NLTK": 0.5423,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9983439445495605
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-06-08T12:43:04Z",
        "content": "By the way, BTIG in April issued its price target as $3. Maybe that’s where they dump their shares. nobody knows. The SPAC sponsor and the Chief Technology Officer of Palantir is far more provocative. Palantir is up 129% in 2023 and he bought stock in Ginkgo Bioworks because he thought it would be better as an investment. \n\n$PLTR and $DNA working together is inevitable. It’s highly probable at a minimum. Bullish",
        "sentiment": {
            "TextBlob": 0.252,
            "NLTK": 0.3612,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9940741658210754
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-06-08T12:38:15Z",
        "content": "$DNA On November 16th, BTIG bought $100 Million plugs and option of another $15 Million of Ginkgo Bioworks at $2.44. The Cynical side of me thought that maybe they bought the shares only to short it down to $1.12 and then slowly Bought the position back and are now long.\n\nNice Trade.\n\nThe person who sponsored the SPAC, Harry Sloan, didn’t touch the stock as a buy until last month when he bought $448,000 of shares at $1.44 on May 22nd.\n\nShyam Shankar is on the Board of Directors at Ginkgo. He’s also the  Chief Technology officer at $PLTR. He bought $512,000 of DNA shares on May 22nd. \n\nNobody can predict the price of DNA, including myself for the next week, month, year or Decade.\n\nYou have 3 Inside Information people, including a 4th, the CFO of Ginkgo, buying last week.\n\nYour Data points for price discovery are $1.12 (low) , $1.44 Harry Sloan, $1.44 Shyam Shankar and $2.44 BTIG. It seems to me that if you pick any of those prices, it’s fair value today. Bullish",
        "sentiment": {
            "TextBlob": 0.014957264957264947,
            "NLTK": 0.8591,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.994638979434967
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-06-07T16:54:25Z",
        "content": "$ARKG has a great setup to hit a 52 week high, rather quickly. The technicals are pointing to a breakout after just a SMIDGE of resistance.",
        "sentiment": {
            "TextBlob": 0.43111111111111117,
            "NLTK": 0.6249,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.998308539390564
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-06-07T16:38:52Z",
        "content": "$DNA There is a big Air Pocket between $1.92 and $2.50. It likely takes a few days to eat through this supply of shares between here and $1.91. After that, you might get a WHOOSH, Higher.",
        "sentiment": {
            "TextBlob": 0.012499999999999997,
            "NLTK": 0.296,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9970222115516663
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-06-07T12:33:13Z",
        "content": "$ARKG This might be the sneakiest “RollinG Bull Market” I’ve ever seen in ARKG. It’s like watching the Tour de France with new leaders of teams going to the front. If you look closely to most holdings, they are breaking out, HIGHER.",
        "sentiment": {
            "TextBlob": 0.29545454545454547,
            "NLTK": 0.3612,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9464586973190308
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-06-06T20:44:38Z",
        "content": "$DNA Technicals are great. 200 Day moving average is $1.95. That’s a big deal that I didn’t expect to flirt with for a couple of weeks. A Golden Cross ?",
        "sentiment": {
            "TextBlob": 0.19,
            "NLTK": 0.6249,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9995375871658325
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-06-06T13:33:38Z",
        "content": "$ARKG I’m going to predict that ARKG gets inflows of Funds today from holders of $ARKW $ARKF and $ARKK that want less exposure to the flows of Crypto. I could be wrong. Average volume is 1.68 Million shares over the last 10 days. Bullish",
        "sentiment": {
            "TextBlob": -0.20416666666666666,
            "NLTK": -0.1531,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9991169571876526
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-06-06T11:05:08Z",
        "content": "$DNA Here are the investors in AgBiome. I like seeing Bayer. Bullish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.3612,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9963003396987915
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-06-05T19:53:19Z",
        "content": "$DNA People will figure out that the $SYBX news was good today but this news from last August that uses the same platform is potentially a really, really big deal that nags hundreds of millions of people on the planet. I’m sure everyone has a buddy that get Gout after drinking beer. prnewswire.com/news-release... Bullish",
        "sentiment": {
            "TextBlob": 0.24,
            "NLTK": 0.3071,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.567969024181366
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-06-05T14:06:04Z",
        "content": "$ARKG The worst stocks are percolating in ARKG. Tide is turning. Bullish",
        "sentiment": {
            "TextBlob": -1.0,
            "NLTK": -0.6249,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9997379183769226
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-06-05T11:18:25Z",
        "content": "$DNA June 12th , 4:40 PM at Goldman Sachs for a Fireside chat then Friday June 16th (a FRIDAY) at 4 PM for a the Shareholder Meeting. I just highly doubt they do Goldman with Bad News and I doubt a Friday at 4 PM is bad News either with people in the room and bars down the street. \n\nThe Goldman announcement is almost laughable after their downgrade. Almost PURPOSEFUL. Bullish",
        "sentiment": {
            "TextBlob": -0.37911111111111107,
            "NLTK": -0.9132,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9975014328956604
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-06-03T20:58:55Z",
        "content": "$DNA Scroll to the last one. theinsidersfund.com/2023/05... Bullish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9979693293571472
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-06-02T20:38:03Z",
        "content": "$DNA I’d follow this person because he knows what he’s talking about. Maybe with more followers he will share more Analysis Bullish",
        "sentiment": {
            "TextBlob": 0.5,
            "NLTK": 0.296,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9974547028541565
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-06-02T20:02:01Z",
        "content": "$DNA Don’t throw tomatoes at me but that was a FANTASTIC…..HEAVY rebound with over 32 Million Shares. Uptrend intact with everything but the 200 Day. Bullish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.6124,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.998755693435669
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-06-02T19:53:08Z",
        "content": "$SPGP Leaders of SPGP today. I’ve gotta be honest, I had to look and see what $CE was as a business. Bullish",
        "sentiment": {
            "TextBlob": 0.6,
            "NLTK": 0.5106,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9967994689941406
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-06-02T19:48:51Z",
        "content": "$SCHD The leaders of SCHD today make it look like some kind of wild Biotech Fund. Bullish",
        "sentiment": {
            "TextBlob": 0.35,
            "NLTK": 0.3612,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.997188150882721
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-06-02T18:05:16Z",
        "content": "$DNA Getting to $1.61 in the next few days is the most important. That 200 day is dropping fast. I think we take that target out in June. 200 Day might be $1.89 by next Friday. That’s a massive positive when it happens. Bullish",
        "sentiment": {
            "TextBlob": 0.1409090909090909,
            "NLTK": 0.6901,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9879792928695679
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-06-02T13:38:23Z",
        "content": "$DNA is the ONLY holding in $ARKG to be red. It will be bought. Bullish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9979119896888733
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-06-02T11:17:41Z",
        "content": "$DNA $LULU Lululemon shares surge after reporting sales growth, raising full-year guidance cnbc.com/2023/06/01/lululem... Bullish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.5859,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.941739022731781
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-06-02T11:16:37Z",
        "content": "$DNA In the $LULU earnings call, Geno (Genomatica) was cited. Ginkgo Bioworks owns part of Geno and collaborated with them on all of their Plant Based Materials that are becoming ubiquitous across the platform of products. I have asked Ginkgo to explain the deep relationship with Geno a couple of weeks from now at Investor Day in Boston.",
        "sentiment": {
            "TextBlob": 0.225,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9567295908927917
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-06-01T21:41:01Z",
        "content": "@tryhardernow Closing the gap with Tesla is the easiest part in the next year. 5 years from now, $90 Billion is a very real possibility for $DNA. $120 Billion will take 7-10 years in my humble opinion. Maybe the $90 Billion takes 7.  I have no idea but I will be attached for the ride. Bullish",
        "sentiment": {
            "TextBlob": 0.02,
            "NLTK": 0.0772,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9714424014091492
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-06-01T19:53:01Z",
        "content": "$DNA will catch up and continue to trade in symmetry to Tesla. It’s a great pair trade. Tesla likely goes up 5 X in 5 years, DNA goes up 40 X. Bullish",
        "sentiment": {
            "TextBlob": 0.4,
            "NLTK": 0.6249,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9541667103767395
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-06-01T19:50:47Z",
        "content": "$DNA One year chart of $TSLA and Ginkgo Bioworks. \n\nGinkgo is Tesla a decade ago with a similar CEO that plays better in the sandbox with other kids. I’m a shareholder in both.\n\nDNA has $1.2 Billion in Cash, almost no debt. Bullish",
        "sentiment": {
            "TextBlob": 0.125,
            "NLTK": 0.1953,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9868415594100952
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-06-01T19:47:23Z",
        "content": "$DNA The CUP is now FULL. The handle might be Tiny. \n\nIt’s a very good setup that even Bears can get Constructive. It’s a classic pattern. Bullish",
        "sentiment": {
            "TextBlob": 0.35666666666666663,
            "NLTK": 0.4927,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9966402053833008
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-06-01T18:31:22Z",
        "content": "$ARKG $NVDA is the 13th holding in $ARKG. Bullish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9977962970733643
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-06-01T14:19:30Z",
        "content": "$SCHD Maybe this big ship is turning. Banks and Industrials leading for the first time in months.",
        "sentiment": {
            "TextBlob": 0.125,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.925144374370575
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-06-01T14:16:41Z",
        "content": "$SPGP I believe this thing is starting a big move up. It’s failed several times. $META has been a beast this year but now the others get going too. Leaders right now. Bullish",
        "sentiment": {
            "TextBlob": -0.04285714285714286,
            "NLTK": -0.2846,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9991469383239746
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-06-01T13:42:19Z",
        "content": "$ARKG At some point, this just launches upward. It’s reaching a BOIL.",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.2023,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9811974167823792
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-06-01T13:37:16Z",
        "content": "$DNA I seem to remember a certain CEO that just spent some time there. koreajoongangdaily.joins.co... Bullish",
        "sentiment": {
            "TextBlob": 0.057142857142857134,
            "NLTK": 0.2732,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9986226558685303
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-06-01T13:07:28Z",
        "content": "$DNA nature.com/articles/d41586-... Bullish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9970530271530151
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-06-01T10:14:40Z",
        "content": "$DNA I’m not sure if anyone has noticed this but there’s been about 5 days where DNA has appeared to not trade for the first 1-2 minutes of the session. The price is sort of locked…..fixed. It then goes onto trade without any noticeable massive volume and the day finishes down by A LOT. Just like yesterday. \n\nThe next day and the week that follows, is up by a large amount. Someone smarter than me has a theory that I’m not really sophisticated enough to quantify and qualify. \n\nOver the last few months I’ve posted the patterns that follow from about 10:30-close. Very scripted and controlled. \n\nMaybe it’s nothing. There was one ramp of 60% in a week. Again, I’m not predicting anything and clearly could be wrong. Bullish",
        "sentiment": {
            "TextBlob": -0.04548229548229548,
            "NLTK": 0.2401,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9994944334030151
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-31T19:31:28Z",
        "content": "$ARKG leaders today.",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.6493399143218994
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-31T17:04:58Z",
        "content": "$DNA I have a full position but the technicals suggest, anything under $1.59 is a buy.",
        "sentiment": {
            "TextBlob": 0.35,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9945980310440063
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-31T14:18:41Z",
        "content": "$DNA certain people post here in emotional terms. They have become buying points over the last 90 days. Very good points. Bullish",
        "sentiment": {
            "TextBlob": 0.2810714285714285,
            "NLTK": 0.7089,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9985748529434204
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-30T20:26:11Z",
        "content": "$BUD I bought a 15 pack of Bud Light at a Sheetz in Pennsylvania at Lunch. I had to wait in a line, walk around the store then around a Parking Lot. Not one comment.\n\nI’m not a shareholder but maybe my Market Research provides some sort of bottom.\n\nI’m 53 and I believe it’s the first case of Bud Light I’ve ever bought in my life. I just put my hand on the stove to see if it was still hot. It’s not.\n\nPeople are moving on. Great Value for the case and maybe the stock.",
        "sentiment": {
            "TextBlob": 0.42000000000000004,
            "NLTK": 0.9331,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9908590912818909
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-30T20:05:42Z",
        "content": "$DNA A lot of positives from a Technical Perspective. That 200 day “might” be at $1.93 by Friday. It’s a moving target. THAT would be miraculous vs. a few weeks ago. Bullish",
        "sentiment": {
            "TextBlob": -0.1,
            "NLTK": 0.5267,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9911357164382935
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-30T19:50:06Z",
        "content": "$BRK.B It’s getting out of a ditch today. The moving average is telling us where it’s going next. UP.",
        "sentiment": {
            "TextBlob": -0.075,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9899981617927551
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-30T14:41:22Z",
        "content": "@CCR1975 It’s the 11th holding in $ARKG. They bought Nvidia in 2014 at $4. Did you ? Bullish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9964595437049866
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-30T11:20:07Z",
        "content": "$DNA Since May 3rd when DNA hit $1.12, many people have claimed, LOUDLY, to be shorting this stock. They have lost 36% since then. \n\nThe more they squander, turning an easy victory into a loss, they will get more and more bold with bombastic claims. \n\nThe smartest money had a stop/loss when 20% was squandered. You lose your job at more than 20% loss on a short. If you really examine the other things they hated, those have run higher too. \n\nWhen you produce videos with stake information from 2 years ago, you are desperate. \n\nSeveral people claimed to “Double Down” on a short in early May. Very few people can Short Stocks effectively. It can have catastrophic consequences, Financially. Bullish",
        "sentiment": {
            "TextBlob": 0.1031712962962963,
            "NLTK": -0.6534,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9993672966957092
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-29T15:09:17Z",
        "content": "$TDOC maybe a reason to own this. twitter.com/dilksjay/status... Bullish",
        "sentiment": {
            "TextBlob": 0.6,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9983515739440918
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-29T13:28:58Z",
        "content": "$DNA Ginkgo Bioworks has their Investor Day June 16th in Boston. It would be incredibly bad optics if the Founders were selling shares going into it answering questions about it. They can’t answer questions about it. I doubt they want it as a distraction. It will take an entire week of zero sales to know it’s over. I believe there is a lot of money on the sidelines waiting for this to take place and are willing to miss the first 40% move UP. Bullish",
        "sentiment": {
            "TextBlob": -0.04999999999999996,
            "NLTK": -0.7902,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9996209144592285
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-28T15:39:21Z",
        "content": "@Ac31189 I’m not so sure. That’s about a $200 Billion Market Cap. $REGN is $80 Billion. That’s my goal. That puts it at $41.04 I’d take that as a Grand Slam. Bullish",
        "sentiment": {
            "TextBlob": 0.5,
            "NLTK": -0.2671,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9985299110412598
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-28T13:04:36Z",
        "content": "$DNA Still under appreciated to the Market. fiercebiotech.com/biotech/b... Bullish",
        "sentiment": {
            "TextBlob": 0.2,
            "NLTK": 0.5106,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9779722690582275
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-27T19:48:00Z",
        "content": "@justoverhere What I thought would be an announcement before July is a Drop In Fuel they have been working on that is better than Ethanol for engines. Particularly small engines. I’ve kind of been hoping that someone like $TOT (French Energy Giant) would partner up because they have so many foreign aviation fuel advantages.  prnewswire.com/news-release... Bullish",
        "sentiment": {
            "TextBlob": 0.17500000000000002,
            "NLTK": 0.8658,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9961310625076294
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-27T00:13:08Z",
        "content": "$BRK.B Leaders of Berkshire today.",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.8885059952735901
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-26T23:27:08Z",
        "content": "$ARKG Unusual After-hours action.",
        "sentiment": {
            "TextBlob": 0.15000000000000002,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9861922860145569
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-26T21:04:06Z",
        "content": "$SPGP About $1 higher and this breaks out  much HIGHER.",
        "sentiment": {
            "TextBlob": 0.25,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.8799533247947693
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-26T21:02:16Z",
        "content": "$SCHD Great Technical Setup heading into next week. This slow moving ship might turn into a bit of a Speed Boat. 200 Day Moving Average might get taken out quickly.",
        "sentiment": {
            "TextBlob": 0.11388888888888889,
            "NLTK": 0.6249,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9990383386611938
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-26T20:29:32Z",
        "content": "$DNA It’s up 28% this month and we had a great week. $1.95 is the next big goal to cross the 200 Day Moving Average. Ten days from now it’s about $1.85. Bullish",
        "sentiment": {
            "TextBlob": 0.10833333333333334,
            "NLTK": 0.6249,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9466642737388611
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-26T16:18:21Z",
        "content": "@TrendTracker01 What % of your portfolio is $NVDA ?",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9964061379432678
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-26T10:54:16Z",
        "content": "@Dubds $ARKK is absolutely a way to play that. 100%. Bullish",
        "sentiment": {
            "TextBlob": 0.2,
            "NLTK": 0.3947,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.928409218788147
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-26T10:39:50Z",
        "content": "$SPGP and $SCHD might be better ways to play the next leg up instead of $DIA . Bar Charts had an important Tweet yesterday that $QQQ is outperforming $DIA by the greatest margin since 1971. This isn’t a knock on QQQ but maybe a knock on the top 5 holdings being “over their skis”. Leadership likely switches from QQQ to other stuff. My Tweet shows a 5 year chart on how $SPGP and $SCHD trade in Sympathy with The Dow Jones Index but BETTER. twitter.com/dilksjay/status... Bullish",
        "sentiment": {
            "TextBlob": 0.346875,
            "NLTK": 0.9437,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9979669451713562
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-25T20:23:56Z",
        "content": "$DNA Above $1.47 is great. Tomorrow that 200 Day moving average starts to rapidly fall under $2.\n\nThe next Hurdle gets lower by the day. That’s great.",
        "sentiment": {
            "TextBlob": 0.29000000000000004,
            "NLTK": 0.7906,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.5659855604171753
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-25T14:34:12Z",
        "content": "$DNA Everything is going to be just fine. Bullish",
        "sentiment": {
            "TextBlob": 0.4166666666666667,
            "NLTK": 0.2023,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9800986051559448
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-25T14:16:31Z",
        "content": "$ARKG My hunch is ARKG is selling Nvidia to buy these laggards. Bullish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9994121789932251
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-25T13:41:27Z",
        "content": "$SPGP Maybe today this ETF gets out of the ditch for 2023.",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9980913996696472
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-25T13:33:42Z",
        "content": "$ARKG My hunch is this is a pocket where ARKG is selling Nvidia, then they deploy it in other holdings. Pause…….Pocket UP UP UP. \n\nCould be wrong.",
        "sentiment": {
            "TextBlob": -0.3125,
            "NLTK": -0.4767,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9941376447677612
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-25T13:10:28Z",
        "content": "$DNA Centrient is a pretty massive company based in The Netherlands. Global presence. centrient.com/about-us Bullish",
        "sentiment": {
            "TextBlob": 0.08333333333333333,
            "NLTK": 0.4939,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.6609150767326355
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-25T13:06:52Z",
        "content": "$DNA What Jeff posted might get a snooze from most people. If you read it carefully, this is an area of MAJOR National Security. I’m married to a Physician and I can’t tell you how many times in the last few years there have been massive shortages of all of these drugs or contamination of Antibiotics from China.\n\nI had my Statin changed 3 times because of Carcinogenic contamination.  Yikes !!!\n\nThere’s a major opportunity to improve Statins and it’s a drug that some Physicians think that almost everyone should be on them particularly obese younger people. \n\nI have flawed genetics to control Cholesterol but Statins make me better than normal. \n\nI’d maybe put a footnote by this story. could be big, not now but in the future. Bullish",
        "sentiment": {
            "TextBlob": 0.08697916666666666,
            "NLTK": 0.8491,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9794894456863403
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-25T12:39:19Z",
        "content": "$SCHD The Fed Funds Rate is projected to be 4.1% in June 2024. Basically the same as SCHD Yield. I believe SCHD will perform better than Treasury Notes because the companies will improve. SCHD goes up by 10-25% between now and then and you get about a 3.5% SCHD Dividend if you get a rise in SCHD by 10-25%. \n\n25% would be a big move for SCHD but not unprecedented. \n\nI hood SCHD instead of Bonds for this reason. Bullish",
        "sentiment": {
            "TextBlob": 0.05,
            "NLTK": 0.5106,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9975826740264893
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-25T10:49:21Z",
        "content": "@Taurus_Balzoff @UncleDookie It’s up 66% in 2023. Up is great. You are missing my point. When ARK bought $EXAS 700% LOWER, people hated it. Now it’s the #1 holding because it rose higher. Bullish",
        "sentiment": {
            "TextBlob": 0.11000000000000001,
            "NLTK": -0.6408,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9974441528320312
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-25T10:02:03Z",
        "content": "$DNA I posted this on ARKG. They bought Nvidia on Sept. 26, 2022 for $122 per share. As of this moment, it’s $384. It was so obvious to ARK to buy in a massive way. Honestly, if it was me and I held it in a tax deferred account, I’d book the 300%+ gain today and buy Ginkgo along with a handful of others with more immediate upside today. If ARK Does NOT sell Nvidia today on this pop, they have more restraint than I have. \n\nThat’s $76 Million they have to decide on what to do today. Bullish",
        "sentiment": {
            "TextBlob": 0.32,
            "NLTK": 0.8225,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9952925443649292
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-25T09:55:59Z",
        "content": "$ARKG bought $NVDA on September 26th, 2022 as a new position at $122 per share in a massive buy. Premarket, it’s $382. 8 months, 300% +. It’s why you own an Active Fund. Bullish",
        "sentiment": {
            "TextBlob": 0.15075757575757576,
            "NLTK": 0.5994,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9969237446784973
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-24T21:31:45Z",
        "content": "$ARKG Holy Smokes …..After-hours. $NVDA. Top 10 holding for ARKG  as of now. Bullish",
        "sentiment": {
            "TextBlob": 0.5,
            "NLTK": 0.2023,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9991559982299805
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-24T20:25:49Z",
        "content": "$ARKG $NVDA might become a top 10 holding of ARKG tomorrow. Today is was #15. \n\nCathie Wood does not get a lot of credit for adding this when everyone hated it. \n\nThis includes in 2014-2017. Bullish",
        "sentiment": {
            "TextBlob": -0.2,
            "NLTK": -0.2023,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9977341890335083
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-24T20:18:12Z",
        "content": "$ARKG Quite a Horse Race coming from the back of the pack of the top 11 holdings. They will be moving on up in weight today. $ADPT $ACCD $DNA. \n\nARKG is looking better each day with its top 10. Bullish",
        "sentiment": {
            "TextBlob": 0.375,
            "NLTK": 0.6705,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9547319412231445
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-24T17:58:18Z",
        "content": "$DNA The technicals are great at the moment. The one last thing that creates panic buying is the 200 day moving average of $2.02. That is dropping at a rate of about 1-2 cents per day. In about two weeks, it drops to about $1.75. That’s ….The Golden Cross. \n\nWayne Gretzky always skated to where the puck is going.",
        "sentiment": {
            "TextBlob": 0.19,
            "NLTK": 0.4404,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.919851541519165
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-24T17:28:26Z",
        "content": "$DNA On May 3rd, there were plenty of people claiming to short this stock. They have now lost 41% in that time.\n\nThat was 3 weeks ago. Bullish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": -0.3182,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9994581341743469
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-24T10:31:18Z",
        "content": "$ARKG The top 10 for ARKG, with their weight and upside potential, reminds me of some kind of All-Star Team of athletes as ROOKIES like Ken Griffey Jr., Michael Jordan, Kobe Bryant, Tom Brady, Lawrence Taylor, Wayne Gretzky, Tiger Woods, Jack Nicklaus.  I’m not really sure who is Babe Ruth yet.",
        "sentiment": {
            "TextBlob": 0.21250000000000002,
            "NLTK": 0.2781,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.991021454334259
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-23T20:22:09Z",
        "content": "$DNA Technical Analysis is healing rapidly. Staying above $1.47 is great on a bad market day. Bullish",
        "sentiment": {
            "TextBlob": 0.02500000000000005,
            "NLTK": 0.1531,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.5700766444206238
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-23T20:18:58Z",
        "content": "$DNA Looks like the headline that tanked the Market is that China has a massive wave of Covid variant XBB. $MRNA and $PFE surged. This “should be” wind in the sails for Ginkgo Bioworks who does Covid monitoring with wastewater and Flight Sewage plus human testing. \n\nwionews.com/videos/china-pr... Bullish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.3612,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9938633441925049
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-23T20:05:57Z",
        "content": "$ARKG Leaders today in a down market. $MASS $RXRX $IOVA Bullish",
        "sentiment": {
            "TextBlob": -0.15555555555555559,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9993919134140015
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-23T20:03:55Z",
        "content": "$DNA The Market was down 1-1.25% today. Relative strength no matter how people want to view it. Bullish",
        "sentiment": {
            "TextBlob": -0.07777777777777779,
            "NLTK": 0.34,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9987209439277649
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-23T17:29:11Z",
        "content": "$DNA Kind of healthy seeing new faces that come in, book a 5-10% quick profit, leave and come back. To some, it might appear as unhealthy, dumb, shortsighted, etc…. but you need to create a sense of there are  trades to be scalped. It’s not my thing to do but it’s very Tesla Like. A lot of people do it 3-4 times and then they just stick around for a lot longer that REALLY builds base. I hope people saw/heard Jason Kelly’s comments about Carbon Capture. It’s a massive business. Bullish",
        "sentiment": {
            "TextBlob": 0.03588154269972448,
            "NLTK": 0.898,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.8838374018669128
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-23T11:28:12Z",
        "content": "$SCHD Why I own $BRK.B and SCHD equally. SCHD is a SCREAMING BUY !!! twitter.com/dilksjay/status... Bullish",
        "sentiment": {
            "TextBlob": 0.3,
            "NLTK": -0.638,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9960054755210876
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-23T00:57:55Z",
        "content": "$DNA I’m not sure people understand how bad Forever Chemicals are. $DNA has a solution. $MMM theverge.com/2022/12/20/235... Bullish",
        "sentiment": {
            "TextBlob": -0.4749999999999999,
            "NLTK": -0.4874,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9994661211967468
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-22T21:15:34Z",
        "content": "$ARKG Final leaders today.",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.8720477819442749
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-22T21:06:29Z",
        "content": "$DNA A LOT of positive things have taken place in the past two weeks on  Technical Analysis.",
        "sentiment": {
            "TextBlob": -0.007575757575757579,
            "NLTK": 0.5574,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9369547963142395
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-22T18:50:32Z",
        "content": "$DNA it’s a big deal. youtube.com/watch?v=K72DeHn... Bullish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9961191415786743
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-22T17:38:10Z",
        "content": "$ARKG A close above $32.17 is a major trend reversal and over the 200 day average.",
        "sentiment": {
            "TextBlob": -0.029166666666666664,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9960663914680481
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-22T17:28:50Z",
        "content": "$ARKG Leaders of ARKG today. All the leaders have Artificial Intelligence as a REAL catalyst. Bullish",
        "sentiment": {
            "TextBlob": -0.19999999999999998,
            "NLTK": 0.4767,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9946361184120178
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-22T13:36:10Z",
        "content": "$DNA Another headline. This is a personal favorite that could be huge. $MMM should deploy this for Forever Chemical lawsuits. allonnia.com/news-content/a... Bullish",
        "sentiment": {
            "TextBlob": 0.30000000000000004,
            "NLTK": 0.5719,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9899590611457825
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-22T13:21:18Z",
        "content": "$DNA Jason Kelly commented on this headline. Both are customers of Ginkgo and are combining efforts. ayanabio.com/launch220523 Bullish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9888661503791809
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-22T11:20:18Z",
        "content": "$DNA Both Insider Buys were at $1.28. Harry Sloan was the sponsor of the SPAC and helped determine the amount of shares it “should” be worth. Whatever your opinion of the $10 Price, maybe $1.28 is far more important a a FLOOR price. A bargain. \n\nI’d maybe circle last week’s buy at $1.28 as a real Mile Marker of measurement. Bullish",
        "sentiment": {
            "TextBlob": 0.25,
            "NLTK": 0.7178,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9952625036239624
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-20T14:21:09Z",
        "content": "$DNA usaid.gov/news-information/... Bullish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9978166818618774
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-20T12:19:59Z",
        "content": "$NVDA sure is getting closer to the top 10 in $ARKG. Highly unusual because it’s a Biotech ETF but I believe it’s far more relevant to harnessing Biology than it is to play video games or mine Bitcoin. ARKG is the only Biotech ETF that has it so highly held. ARKG is likely the biggest sleeping Giant of all the ARK ETFs. Bullish",
        "sentiment": {
            "TextBlob": 0.23600000000000004,
            "NLTK": 0.631,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9606788158416748
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-19T21:49:17Z",
        "content": "$ARKG Biggest winners today.",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.4767,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9920652508735657
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-19T18:23:46Z",
        "content": "$DNA It’s going to look so obvious. “How did I miss it”…….. forbes.com/sites/johncumber... Bullish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": -0.1531,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9996769428253174
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-19T13:35:09Z",
        "content": "$DNA",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.6158950924873352
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-19T13:34:30Z",
        "content": "$DNA For the Synthetic Biology Conference next week, here are the companies presenting for Biosecurity. Interesting $RTX is there along with Schmidt and $TWST",
        "sentiment": {
            "TextBlob": 0.25,
            "NLTK": 0.4019,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9843016266822815
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-19T13:10:32Z",
        "content": "$ARKG Nice article about $SDGR $DNA and $RXRX . Schrödinger is #3, Ginkgo Bioworks is #9 and Recursion is #30 in ARKG. fool.com/investing/2023/05/... Bullish",
        "sentiment": {
            "TextBlob": 0.6,
            "NLTK": 0.4215,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9977547526359558
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-19T10:05:08Z",
        "content": "$DNA I borrowed this from @JWilfrem on Twitter. $PLTR has a seat on Ginkgo Biowrk’s Board………ahem. Bullish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9968481659889221
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-19T00:42:48Z",
        "content": "$ARKG Leaders today",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.6317829489707947
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-18T22:17:06Z",
        "content": "$DNA Ummmmm…..Great Find !",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.999022364616394
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-18T15:30:29Z",
        "content": "$DNA $1.12 was the low. $1.34 is 20% above the low. Anything above that, you lose your job for not covering a short, particularly when you have had since March 7th to do it. Bullish",
        "sentiment": {
            "TextBlob": 0.027777777777777776,
            "NLTK": -0.7096,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.998892605304718
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-17T20:53:03Z",
        "content": "Ooooppps. Meant for $ARKG. Bullish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9968942403793335
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-17T20:36:36Z",
        "content": "$DNA Closing above $30.44 is likely the start of a bigger mover HIGHER. $32.28 is not that far away for a Golden Cross.",
        "sentiment": {
            "TextBlob": 0.09285714285714285,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.985508143901825
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-17T20:31:16Z",
        "content": "$DNA Biobot retweeted this. They have a Collaboration with Ginkgo Bioworks for wastewater. I honestly have no idea if this is related to Ginkgo or Biobot. Could be nothing or something. Just reporting the news. cidrap.umn.edu/mpox/wastewa... Bullish",
        "sentiment": {
            "TextBlob": 0.3,
            "NLTK": 0.2023,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9989816546440125
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-17T20:19:04Z",
        "content": "$DNA It was a good day. 6% swing from low point to end the day. $1.20 low to $1.27 finish. The Bears will keep talking anything positive DOWN. We are at the 50 day moving average. It will take some work to cross the 100 day at $1.48. The Fibonacci Fanboys start to arrive 7 cents above todays close as that’s a very interesting area to start a position.  Technically speaking, DNA has improved a lot in the last 30 days. This chart is what almost all Technical Analysis Geeks agree upon for opinions. It’s exited Jail and is at least interesting to enter. 2 cents higher and it’s a Trend Reversal. Everyone has likely noticed new faces on the board lately because of improvements. Above $1.36 likely gets a lot of attention. Bullish",
        "sentiment": {
            "TextBlob": 0.06943241943241943,
            "NLTK": 0.9412,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.813844621181488
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-17T19:01:28Z",
        "content": "$NVDA I believe people are starting to realize the greatest uses of Artificial Intelligence are going to be in combining Biology+Technology. NVIDIA will have a major roll in the success. It’s close to being a top 10 holding in a Genomics Fund $ARKG . ark-funds.com/wp-content/up... Bullish",
        "sentiment": {
            "TextBlob": 0.21041666666666667,
            "NLTK": 0.9153,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9989558458328247
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-17T13:23:45Z",
        "content": "$SCHD The estimated Dividend to be paid on June 27th is 60 cents per share. Could be a tad higher. Bullish",
        "sentiment": {
            "TextBlob": 0.25,
            "NLTK": 0.296,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9993842840194702
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-17T11:28:09Z",
        "content": "$SPGP This sure looks like a flashpoint. Market sentiment is awful. “Should” get a bounce this week. Bullish",
        "sentiment": {
            "TextBlob": -0.25,
            "NLTK": 0.2023,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9996053576469421
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-16T19:36:52Z",
        "content": "$SPGP Here’s the top holdings of SPGP.",
        "sentiment": {
            "TextBlob": 0.5,
            "NLTK": 0.2023,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.8570067286491394
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-16T19:34:52Z",
        "content": "$SPGP Leaders today. I sometimes forget $GOOG is in here.",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": -0.2263,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9899511933326721
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-16T15:55:18Z",
        "content": "$DNA I think we would all like to see an awful open, finish green. That starts to cement a turnaround. Not there………..yet. Kind of feels like it wants to do it. Bullish",
        "sentiment": {
            "TextBlob": -0.07999999999999999,
            "NLTK": 0.25,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9978399276733398
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-16T12:19:47Z",
        "content": "$DNA David Tepper started a position in $ARKK so he has a vested interest in the wellbeing of $DNA. Those that are shorting ARKK or $DNA are shorting David Tepper. He’s a great Pittsburgh Guy and an investing Legend. He has more common sense than any investor I’ve observed in a Real World environment to make gains NOW.",
        "sentiment": {
            "TextBlob": 0.3,
            "NLTK": 0.885,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9885759949684143
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-16T12:12:58Z",
        "content": "$ARKK David Tepper started a position in ARKK. Bullish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9923940896987915
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-16T11:46:43Z",
        "content": "$DNA $ARKG has added 2 million more shares of Ginkgo Bioworks over the last few days because of positive inflows.",
        "sentiment": {
            "TextBlob": 0.1318181818181818,
            "NLTK": 0.7264,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9988497495651245
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-16T11:38:45Z",
        "content": "$SPGP This has one of the oddest technical setup that could breakout soon. The 50 and 200 day averages are almost identical. We just need a couple of positive days in a row to setup a big move.",
        "sentiment": {
            "TextBlob": 0.07575757575757576,
            "NLTK": 0.5574,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9758824110031128
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-16T11:33:31Z",
        "content": "$ARKK I didn’t realize how close ARKK was to breaking out by punching through the 200 day moving average. It might be close to Showtime.",
        "sentiment": {
            "TextBlob": -0.15,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9404709935188293
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-16T11:25:41Z",
        "content": "$ARKG A lot of Technical positives were triggered yesterday. The 200 day moving average is now very achievable to punch through. If that’s achieved in the next 5 days, this is a coiled spring. A lot of resistance but it’s crumbling rapidly. Bullish",
        "sentiment": {
            "TextBlob": 0.012500000000000004,
            "NLTK": 0.4582,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.985253632068634
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-16T11:03:50Z",
        "content": "$TSLA 6 PM on CNBC, David Faber interviews Elon Musk. Other than the IPO, to my knowledge, this is the first time he has sat down and given an interview. I doubt Elon comes empty handed. There’s something likely newsworthy and positive tonight. Bullish",
        "sentiment": {
            "TextBlob": 0.016119528619528613,
            "NLTK": 0.0772,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.6280187964439392
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-16T00:38:46Z",
        "content": "$DNA Brazil is the World’s top Chicken Exporter. I wouldn’t be surprised to see a USDA Contract with Concentric By Ginkgo for testing of all imports. reuters.com/business/health... Bullish",
        "sentiment": {
            "TextBlob": 9.25185853854297e-18,
            "NLTK": 0.4019,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9839300513267517
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-15T23:59:14Z",
        "content": "@McLovin13 $LULU was their top buy last quarter. There’s a common theme developing. Bullish",
        "sentiment": {
            "TextBlob": 0.06666666666666667,
            "NLTK": 0.2023,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9900305271148682
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-15T22:28:20Z",
        "content": "@Jewkee I take it that you are an $XWEL shareholder. This is really interesting but I thought what would really drive the core competencies of XWEl is messages and (potentially) manicures. The report says they are installing Clockwork Ai Robots. 10 minute manicures for $10. I bet the government gives away the manicure/pedicure in return for an anonymous sample to test for SARS, MERS, Covid-19,etc…likeclockwork.com/",
        "sentiment": {
            "TextBlob": 0.2333333333333333,
            "NLTK": 0.2492,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9968801736831665
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-15T22:16:34Z",
        "content": "$DNA If you read closely, there is a Department of Defense contract flying out of Seattle AND stationed overseas. This is a very GREY area that the SEC allows for purposeful lack of clarity for National Defense. $XWEL is not owned by Ginkgo Bioworks but it’s the delivery method DNA (Ginkgo) uses. I’m not even posting this for some kind of wild upside for DNA but DOD contracts are sticky. 1 contract leads to 2, then 3……..\n\nGinkgo gets a free pass on the lack of clarity with the DOD. Bullish",
        "sentiment": {
            "TextBlob": 0.187,
            "NLTK": 0.8107,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.999550998210907
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-15T20:20:02Z",
        "content": "$ARKG Today is the perfect model for what you want the winners to look like in ARKG because these winners are just not owned by many people and they won’t be until all of them run another 200-300%. Nice day and the best of the ARK complex. A lot of Biology+Technology winners. I like it. It will be one of the great trends of the next decade. Bullish",
        "sentiment": {
            "TextBlob": 0.5142857142857143,
            "NLTK": 0.9825,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9995123147964478
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-15T14:04:08Z",
        "content": "$TSLA David Faber of CNBC has a sit down interview with Musk tomorrow. It’s likely to be positive with substance. Bullish",
        "sentiment": {
            "TextBlob": 0.023905723905723892,
            "NLTK": 0.5574,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.7116416096687317
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-15T13:55:42Z",
        "content": "$DNA This was from almost one year ago. globalaginvesting.com/rober... Bullish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9979346990585327
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-15T10:26:51Z",
        "content": "$DNA as a stock, it’s Robert Downey Jr. in 1999. Really great actor with potential but a drug addict. Nobody would hire him. Then he got Sober. Maybe DNA is about to leave the rehab facility too. Bullish",
        "sentiment": {
            "TextBlob": 0.3,
            "NLTK": 0.3392,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9988881945610046
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-15T10:20:51Z",
        "content": "$DNA The prices the Bears can’t have DNA close to keep their story intact. The 50 Day is the most important this week. That 100 day is closer than I thought if someone would randomly ask me without looking it up. Bullish",
        "sentiment": {
            "TextBlob": 0.13333333333333333,
            "NLTK": 0.4391,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9166439771652222
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-14T22:17:21Z",
        "content": "$DNA forbes.com/sites/johncumber... Bullish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9946427345275879
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-13T11:33:24Z",
        "content": "For $SRPT theres only 93 Million shares on a $120 stock that was halted on the news Friday. This should be interesting for Serepta , Monday. The stock was halted on news after the market closed. This is a bit of a blind spot for me on precisely what this means for $DNA . Obviously it opens up that entire catalog area of Therapeutics for legitimacy but I don’t even want to speculate what the Royalties AND a one time milestone payment looks like. If anyone knows, please let me know. Bullish",
        "sentiment": {
            "TextBlob": 0.042857142857142864,
            "NLTK": 0.8047,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9990057349205017
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-13T11:23:49Z",
        "content": "$SRPT $DNA Read the terms of the agreement that StrideBio made with Serepta . Ginkgo bought StrideBio. This is good for both because Ginkgo has improved purity of manufacturing which was a stumbling block for SRPT . investorrelations.sarepta.c... Bullish",
        "sentiment": {
            "TextBlob": 0.7,
            "NLTK": 0.743,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9969757795333862
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-13T11:04:39Z",
        "content": "$DNA Here is a reminder of what’s now in play for Ginkgo. I’m not even sure what this precisely means with Ginkgo Bioworks relationship with $SRPT but here’s an article that gives some foundation. 80% of the article doesn’t involve Serepta but they are now joined at the hip for the manufacturing of the Therapeutic but more importantly, version 2.0 that they will/are developing. Nice catch by @justoverhere . fiercebiotech.com/biotech/g... Bullish",
        "sentiment": {
            "TextBlob": 0.48,
            "NLTK": 0.8078,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9845671057701111
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-12T19:27:05Z",
        "content": "$DNA I kind of think some Bears are going to look back at this month like watching a Football player spiking the ball at the 5 yard line instead of making it to the end zone and just handing the ball to the Referee. \n\nYou know, sort of like you have been there before.  \n\nBeware of the “I told you so” guy that prematurely celebrates. It’s on full display this week in particular. \n\nHave a great weekend. Bullish",
        "sentiment": {
            "TextBlob": 0.38333333333333336,
            "NLTK": 0.9153,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9356247186660767
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-12T18:22:22Z",
        "content": "$DNA Today’s action. Look at that $1.23.",
        "sentiment": {
            "TextBlob": 0.1,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9703910946846008
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-12T17:43:09Z",
        "content": "$ARKG Starting to see a little GREEN.",
        "sentiment": {
            "TextBlob": -0.12916666666666668,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9819897413253784
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-12T14:45:06Z",
        "content": "$DNA selling just became exhausted. Bullish",
        "sentiment": {
            "TextBlob": -0.4,
            "NLTK": -0.3612,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9997864365577698
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-12T11:22:13Z",
        "content": "$DNA $ARKG The Death Cross just happened in the 10 Year Treasury Yield. This is typically VERY BULLISH for stocks in general. The smaller the company in Market Cap, the more beneficial it is. We are no longer in a Rising Rate Environment. They are falling. ARKG is loaded with smaller companies that have a higher likelihood of a need to access Capital. Of all the ARK ETFs, ARKG likely has the most room to run. The Bears in all of the ARKG holdings have one less monster to reference that’s hiding under the bed. It’s been a great card to play for the last two years. Biotech has really been hurt more than any other sector. Biotech is at generational lows because of rising rates. A headwind becomes a tailwind. Bullish",
        "sentiment": {
            "TextBlob": 0.18055555555555555,
            "NLTK": -0.4377,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9993937015533447
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-12T00:19:34Z",
        "content": "$DNA If anyone has access to Raymond James Research by Rafael Sarugaser PhD, MASc out of Vancouver Canada, it’s very good. Really digestible and knows exactly what to look at for real growth. It takes a “Sum of the Parts” approach. I’m not sure if this is only for Canadian Clients but I believe International has access too. Bullish",
        "sentiment": {
            "TextBlob": 0.1871428571428571,
            "NLTK": 0.3433,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9994650483131409
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-11T21:35:37Z",
        "content": "$DNA Holy Cow. I have a lot of people Muted but not blocked. Someone sent me a list of downright awful stuff people said about me yesterday including some dire predictions for today. It was a great day considering yesterday’s situation and a really weak and nervous market. 33 Million shares traded, essentially, “Buying the Dip” is tough to deny. \n\nThe Bears have a problem !\n\nTheir solution will likely become as Bombastic as it is desperate. It’s been in a range for 3 months and is on the top end of an exit. \n\nI honestly think some retail folks have themselves in a bad short they need to fix. The first rule of being stuck in a hole is to………..stop digging.\n\nI used a Mike Tyson reference yesterday. Mike Tyson got knocked out today.",
        "sentiment": {
            "TextBlob": -0.08803418803418801,
            "NLTK": -0.9372,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9996125102043152
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-11T10:35:18Z",
        "content": "$DNA The RSUs that were granted in 2021 were booked as a loss last quarter as a ONE TIME charge at $13.59. Jason Kelly has sold 3% of his shares and the other Founders .6%. That’s a massive ONE TIME a charge they booked last night. Also notable, they get 52% profit margins on Biosecurity. Less Biosecurity for sure because Covid-19 is in the rearview mirror but pretending 52% margins won’t be booked for whatever problems arise in the future, is being a bit dishonest with reality. The guidance they gave for Biosecurity is for “Peacetime” conditions. Just monitoring wastewater is a nice business in peaceful times at 52% margins. Keeping on the data for a night, I’m not sure it’s as bad looking forward as many are loudly suggesting. The RSUs are important. Largely in the rearview mirror.",
        "sentiment": {
            "TextBlob": 0.08956582633053223,
            "NLTK": 0.2317,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9838032722473145
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-10T21:51:17Z",
        "content": "$DNA 100% Honest opinion. It wasn’t great for the Bulls. It was a Revenue BEAT which doesn’t help the Bears. There’s nothing new that’s Bearish. $1.2 Billion on hand is an incredible asset to have and Bears are disappointed it’s not less. \n\nFor the Bears, it’s like Mike Tyson not getting a knockout on a weaker opponent. If you are a Bull, it’s not being knocked out by Mike Tyson but losing in a Decision by the Judges.\n\nGinkgo Bioworks lives to fight another day. \n\nThe $1.2 Billion is just a really big problem for the Bear Thesis because they only burned $100 Billion and Cap Ex is going down. They have a 3 year runway of zero improvements. \n\nI still maintain the biggest threat is that Ginkgo gets a serious buyout offer at any point. \n\nLikely opens down and gets bought up to finish stronger. Kind of like today but more exaggerated. \n\nBetter days ahead. Bullish",
        "sentiment": {
            "TextBlob": 0.1390782828282828,
            "NLTK": 0.287,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9952695965766907
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-10T20:20:24Z",
        "content": "$DNA Added at $1.24. Bullish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9957833290100098
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-10T20:07:33Z",
        "content": "$DNA Revenue Beat by $10 Mill+ , Earnings per share miss by 2 cents. The Cash and Cash equivalents is very interesting and may need to have some explanation on a growing Private Equity Column. Not a bad thing. Bullish",
        "sentiment": {
            "TextBlob": 0.3333333333333333,
            "NLTK": 0.7988,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9843803644180298
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-10T19:18:11Z",
        "content": "$DNA If I’m the CEO, I’m likely not in Quatar on the same day as earnings with a Miss to report. That’s me reading the Tea Leaves. Bullish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": -0.1531,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9989317059516907
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-10T10:23:17Z",
        "content": "$DNA I don’t think most people understand the value of Ginkgo’s Geno investment. This likely becomes newsworthy. It’s staring at you in plain sight !  You might get some more info soon on it. genomatica.com/ Bullish",
        "sentiment": {
            "TextBlob": 0.1830357142857143,
            "NLTK": 0.4003,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9716743230819702
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-09T20:33:09Z",
        "content": "Should be a great day for $ARKG Wednesday as $EXAS is # 1 at 10.28% weight. Bullish",
        "sentiment": {
            "TextBlob": 0.8,
            "NLTK": 0.6249,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.99154132604599
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-09T11:20:19Z",
        "content": "$DNA A quick look at the news release is Dyes are one of the most Carcinogenic substances. I remember living in the Delaware/Maryland area, it’s a massive cluster of Bladder Cancers from Dyes. Uses of Cobalt for Dyes is awful. I’m not an expert but Paints/Dyes are needed in everything………Including FOOD/Beverages. Likely becomes newsworthy in 12-18 months. Bullish",
        "sentiment": {
            "TextBlob": -0.03333333333333335,
            "NLTK": -0.25,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9968838095664978
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-09T00:49:39Z",
        "content": "$DNA May 23-25 in Oakland is the SynBioBeta Conference. Here is the Floor layout. Ginkgo is right across from $PG . The fact that Procter & Gamble is there, to me, is quite interesting. During the Ferment Conference , it was mentioned that Ginkgo had been working with Enzymes to improve what I thought sounded like Tide. I could be 100% wrong on this and likely am. I do find it odd that P&G is right across from Ginkgo. Likely a coincidence. I’m not even marking this post as bullish because it’s a wildly speculative idea although it would make a lot of sense to reduce pollution in waterways that create Algae Blooms. Similar to Agriculture Runoff.",
        "sentiment": {
            "TextBlob": 0.056084656084656084,
            "NLTK": 0.6697,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.8256349563598633
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-08T23:47:27Z",
        "content": "$SPGP Today is one heck of a flat leaderboard.",
        "sentiment": {
            "TextBlob": -0.025,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9987793564796448
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-08T23:44:20Z",
        "content": "$ARKG Leaders today.",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.6493399143218994
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-08T12:06:24Z",
        "content": "$DNA Not necessarily important today but DNA is becoming incredibly diversified Globally. Their future success could come equally from Japan, Europe and The USA sprinkled with other regions. India is missing unless I’m overlooking something. India is untapped by almost all companies because of property/IP rules. Bullish",
        "sentiment": {
            "TextBlob": 0.125,
            "NLTK": 0.4504,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9360483884811401
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-08T11:07:05Z",
        "content": "$DNA There is a $GOOG connection on this news. Add in Eric Schmidt being active in this space. It’s interesting.",
        "sentiment": {
            "TextBlob": 0.18333333333333335,
            "NLTK": 0.6597,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.99907386302948
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-06T13:07:50Z",
        "content": "$BRK.B Massive Beat. Lots to love ! Berkshire operating earnings pop 12%, cash hoard tops $130 billion cnbc.com/2023/05/06/berkshi... Bullish",
        "sentiment": {
            "TextBlob": 0.3125,
            "NLTK": 0.8313,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.985392153263092
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-06T11:38:06Z",
        "content": "$TSLA $DNA Random thought about Tesla and Ginkgo Bioworks. Both have very similar CEOs. Jason Kelly likely beats Musk by just a smidge by having a more diverse Engineering background. Musk, today, has better command of explaining Real World projects they are working on because Batteries, Cars and Rockets are something people can comprehend. Jason Kelly has an immense barrier of entry to capture people’s attention and excitement because very few people get excited for Biology displacing Petroleum by brewing and Fermenting things to displace drilling for them. Expanding Yields of the things that make medicine, yoga pants,spices, food, etc……just seem so far out there, people don’t get it ……….YET. Both stocks have had a bad 365 days but Tesla has been a champ in 2023 for a rebound. Something changed on Feb 2 to get Ginkgo out of this gravitational pull for direction but the last few days showed that it may want to join Tesla again. Both are likely great winners moving forward.",
        "sentiment": {
            "TextBlob": 0.054333333333333345,
            "NLTK": 0.9659,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9755582809448242
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-05T20:34:06Z",
        "content": "$DNA It’s impossible to be disappointed when a stock that you actually own goes up 4.1%. The stock market, in a good year, goes up 9%. The week ended well and most people’s portfolios got a nice rise today. Enjoy the weekend. Bullish",
        "sentiment": {
            "TextBlob": 0.1976190476190476,
            "NLTK": 0.7845,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9982509016990662
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-05T14:05:04Z",
        "content": "$ARKG I best there’s a 2% swing higher. When they make huge moves out of stocks, there’s an hour lag for NAV to adjust. Bullish",
        "sentiment": {
            "TextBlob": 0.55,
            "NLTK": 0.6249,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9983078241348267
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-05T14:03:30Z",
        "content": "@JustDaFacts My guess is they are exiting two of these laggards. My hunch is they are buying $TWST . Here’s the worst performers. Bullish",
        "sentiment": {
            "TextBlob": -1.0,
            "NLTK": -0.6249,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9998179078102112
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-05T13:45:58Z",
        "content": "$ARKG This might be a hiccup of a down move, then big UP. This has all the hallmarks of they are exiting 2-3 positions massively to buy something else.",
        "sentiment": {
            "TextBlob": -0.051851851851851864,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9989026784896851
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-05T12:18:10Z",
        "content": "@biomoon I agree with you. Today their Market Cap will be a little over $600 Million. Treat it as a merger. One thing that’s seldom discussed is that all these Class A Shares being sold by Founders, “Might Be” being bought back by Ginkgo and never on the open market. These shares in the Treasury “Could Be” used for a Merger and not Aquisition. With Zymergen, shareholders got .91 shares of Ginkgo for every 1 share of Zymergen. It’s tax efficient and $TWST shareholders may even see more value with a new ticker, DNA. A fresh start. Bullish",
        "sentiment": {
            "TextBlob": 0.12481060606060605,
            "NLTK": 0.9617,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.8712685704231262
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-05T11:52:40Z",
        "content": "$SPGP Today should start a comeback, higher. Here’s pre-market.",
        "sentiment": {
            "TextBlob": 0.25,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.8192796111106873
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-05T11:17:13Z",
        "content": "$DNA He negotiated a great deal. $400,000 Pay and $1.5 Mill in RESTRICTED Stock Units at the average price for 30 days ending June 1. Seemingly no need to sell as he (likely) has stock from Charles River Labs that he is free to exit, unrestricted. He’s 57 so he likely views this as a 5 year job and is siting on an excellent exit package. Bullish",
        "sentiment": {
            "TextBlob": 0.3416666666666666,
            "NLTK": 0.7325,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.7889489531517029
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-05T11:11:30Z",
        "content": "$DNA So Marie Fallon , a seller of stock, steps down and we hire someone from a great company, $CRL with 30 years of experience. I like it ! My hope is that they will speed up the Earnings Dates to be more inline with what Tesla does. 19-25 days after the Quarter Ends. It’s one of the Superpowers of Tesla that few appreciate. Bullish",
        "sentiment": {
            "TextBlob": 0.28611111111111115,
            "NLTK": 0.9098,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.999272882938385
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-04T18:55:07Z",
        "content": "$SPGP is sitting in this really weird spot right now. It’s technicals are not a SCREAMING Buy but about 20% of the SPGP portfolio is down like a Beach Ball held under water. A lot of the worst performers today have been the worst for a month or longer.",
        "sentiment": {
            "TextBlob": -0.473968253968254,
            "NLTK": -0.8652,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9997125267982483
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-04T18:31:21Z",
        "content": "$DNA twitter.com/dilksjay/status... Bullish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9983147382736206
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-04T17:20:38Z",
        "content": "$SCHD This morning was a heck of an opportunity here. Well done ! Bullish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.636,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9928834438323975
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-04T17:00:26Z",
        "content": "$ARKG Josh Brown on CNBC bought the #3 holding in ARKG, $SDGR .",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9702885150909424
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-04T16:01:12Z",
        "content": "$BRK.B Here is why Berkshire is struggling today. I bet they are active buyers.",
        "sentiment": {
            "TextBlob": -0.13333333333333333,
            "NLTK": -0.0258,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9856070280075073
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-04T15:46:14Z",
        "content": "Sorry…….this was meant for $ARKG not DNA. Bullish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9996956586837769
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-04T15:45:03Z",
        "content": "$DNA I typically post the best performers but today I will highlight the worst as this is where the buys will likely be. I’ve looked at $QSI 100 times as something that interests me. I have this feeling I’ll regret NOT buying it here. Oh man am I interested. Watching. Terrible market day, ARKG holding stronger. Bullish",
        "sentiment": {
            "TextBlob": -0.15277777777777776,
            "NLTK": 0.15,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9777075052261353
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-04T15:20:56Z",
        "content": "@kxpx It’s not a perfect system of selection and timing but it’s better than most. This might be flawed logic but I own sort of a 1/2 position in SCHD and $BRK.B . Ad them together and it’s my top holding. Whenever SCHD trades worse than Berkshire, I buy SCHD and Vice Versa. Here’s their latest price action. A 25% spread at the moment on a 5 year chart SCREAMS to BUY.",
        "sentiment": {
            "TextBlob": 0.1444444444444445,
            "NLTK": -0.6122,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.8716036081314087
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-04T14:57:39Z",
        "content": "$SCHD $69.08 is the 30% RSI that has typically been a great place to add for the Longterm HOLD. Lots of Technical Analysis but it’s one of the most widely used Buy Points. Bullish",
        "sentiment": {
            "TextBlob": 0.20666666666666664,
            "NLTK": 0.3716,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9928505420684814
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-04T12:23:49Z",
        "content": "@DonkeyKongX You are really stretching my example to come up with “Constantly Losing”. My point was to LOCK IN GAINS if SHORT. In April of 2021 I had several 300%+ gains that became 280% Gains with Stop Losses. I get your point though with the SPAC. One thing I compare Ginkgo to is the ETF $IPO . This is loaded with former SPAC offerings. It’s more Apples to Apples. I believe DNA is at a minimum, 37% overdone to the downside. Bullish",
        "sentiment": {
            "TextBlob": 0.11666666666666665,
            "NLTK": 0.2577,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9932668209075928
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-04T11:16:18Z",
        "content": "$DNA In April of 2021 I was sitting on ridiculous gains in the Stock Market from Growth ETFs. Looking back, there were about 2 to 3 months where the gains started to just settle down and go sideways. If you are honestly shorting this, is there a point that is becoming obvious that the gains are slowing down?  Also looking back, there were a few days of losses that happened rapidly that wiped out months of gains. The first 10% drop hurts the most because it has the largest amount of total cash. You wake up one morning, the premarket move is so great against you, it’s too late to see something so obvious. “Pigs get slaughtered” is a another way of saying “Don’t be greedy”. There’s a point where you can’t use Founders Selling because it’s been one week since they have sold, then two weeks, then they say it’s over on the Earnings Call. The biggest negatives turn into positives. Pigs tend to get slaughtered. Be careful if you are SHORT. Bullish",
        "sentiment": {
            "TextBlob": 0.07973856209150326,
            "NLTK": 0.933,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9992475509643555
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-04T11:01:38Z",
        "content": "$BRK.B is the #1 holding in the Banking ETF $XLF at 12.54%. Just buy Berkshire instead. Here’s the chart since 1999.",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9965863227844238
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-03T19:31:08Z",
        "content": "$ARKG Leaders at the moment in ARKG.",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9861881136894226
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-03T19:09:49Z",
        "content": "@SwingTradeToronto @Taurus_Balzoff . $ARKG in particular has added over 2 Million shares this week. If there are inflows of money to the Funds they buy without publishing. It’s how all ETFs work. Last week ended with about 45 Million Shares and now it’s over 47 Million shares. I would imagine ARKG is having inflows today on above average volume. \nJust because they don’t publish the buys, doesn’t mean they are idle. 3% weight has proven to be a floor to add in addition to inflows.",
        "sentiment": {
            "TextBlob": -0.059166666666666666,
            "NLTK": 0.6808,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9373778104782104
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-03T14:42:28Z",
        "content": "$DNA",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.6158950924873352
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-02T23:38:37Z",
        "content": "$DNA https://www.fool.com/investing/2023/05/01/despite-falling-92-cathie-wood-buy-growth-stock/ Bullish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.998021125793457
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-02T19:14:59Z",
        "content": "$SCHD Leaders today. It’s a bit thin. Bullish",
        "sentiment": {
            "TextBlob": -0.4,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9997853636741638
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-02T18:22:59Z",
        "content": "$DNA Someone I respect a lot that’s been following this said months ago that when he thought Jay Powell was getting near done, he’d buy a ton of it the day before he speaks, after 2:30 PM. Today is that day. I have to admit I’m a bit jealous of his timing and patience. You might see him appear in the near future as he’s been dormant for a while. Looks like maybe $1.14 will be his buy. He’s kind of a 1 and done type buyer with maybe two smaller buys on weakness the next day. He’s one of the good ones. Bullish",
        "sentiment": {
            "TextBlob": 0.1875,
            "NLTK": 0.5423,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9573583006858826
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-02T16:50:42Z",
        "content": "$ARKG A bunch of holdings are trying to turn GREEN.",
        "sentiment": {
            "TextBlob": -0.2,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9936060905456543
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-02T15:19:26Z",
        "content": "@biomoon It’s very logical. I posted the Zymergen information as maybe a hint of what Twist and DNA should do. MERGE. Ginkgo issued .91 shares to Zymergen shareholders. $TWST is down to a $677 Million Market Cap. Ginkgo has $1.3 Billion in Cash. I’m not even sure what Twist Cash position is today.",
        "sentiment": {
            "TextBlob": 0.22314814814814812,
            "NLTK": 0.0613,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9902265071868896
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-02T13:37:12Z",
        "content": "$SPGP Interesting leaders early today.",
        "sentiment": {
            "TextBlob": 0.3,
            "NLTK": 0.4019,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9923955202102661
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-02T09:39:32Z",
        "content": "$DNA A lot of people are forgetting that a handful of us are Zymergen Shareholders that became Ginkgo shareholders. The conversion was on October 19th at $2.44. Remarkably those shares still have a gain (barely) and are Longterm gains in 6 weeks. Full disclosure: I’ve more than doubled my position since early March and been pretty loud about it. There’s 3 regulars here that are in a similar situation. I voted for the Merger with a pretty large retail position. People sort of forget the merger wasn’t supposed to happen until Q1 2023 but they got it done in record time in October. They didn’t buy Zymergen, they MERGED. Big difference. I think people have made a similar mistake with other transactions. stocktwits.com/jaydilks/mes... Bullish",
        "sentiment": {
            "TextBlob": 0.18763736263736266,
            "NLTK": 0.4841,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.995919406414032
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-01T18:02:43Z",
        "content": "$DNA The S&P 500 is up 8.94% in 2023. That’s a really good total year return. If someone buys this at $1.18, a 10% return would be $1.30. I think some people’s interpretation of success is clouded by looking in the rearview mirror. Buyers don’t care. They are looking forward. DNA going to $2.36 is more than a decade of great returns in the S&P 500. Bullish",
        "sentiment": {
            "TextBlob": 0.45999999999999996,
            "NLTK": 0.9324,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.6812307834625244
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-01T17:56:44Z",
        "content": "$TSLA twitter.com/farzyness/statu... Bullish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9982753992080688
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-01T10:11:59Z",
        "content": "$MFST $DNA microsoft.com/en-us/researc... Bullish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9981099367141724
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-05-01T10:10:54Z",
        "content": "$ARKG $DNA $MFST Microsoft entering Synthetic Biology turns the space into a Land Grab. Ginkgo Bioworks is easily the #1 way to be involved in the space along with $TWST. My biggest fear is Ginkgo Bioworks gets a serious offer for $10 a share and they don’t go it alone any longer. I cannot believe $GOOG is being left behind but Eric Schmidt is one of the biggest players behind the scenes. Syn Bio heats up !  microsoft.com/en-us/researc... Bullish",
        "sentiment": {
            "TextBlob": -0.16,
            "NLTK": -0.1882,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.7497581243515015
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-30T11:28:29Z",
        "content": "$DNA Things are going to radically change as the year goes on and people are ignoring some obvious newsworthy events. It’s staring at you in plain sight. \n\ntwitter.com/dilksjay/status... Bullish",
        "sentiment": {
            "TextBlob": -0.10714285714285714,
            "NLTK": -0.4019,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9967021346092224
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-29T15:17:55Z",
        "content": "I kind of posted this as a reminder for the future when you sell DNA. One of the toughest things to do is to hold a stock that goes up 400% or more……for years. My most recent story was Tesla over the last decade. Between 2017-2019, I started exiting Tesla and putting more into the ARK Themes like $ARKK $ARKW $ARKQ because they all maintained about 10% weight. I felt like I was meaningfully invested in Tesla without having all my dollars in Tesla. It allowed me to sleep. For long stretches of time, ARK outperformed Tesla, particularly between 2014-2019. If/When DNA goes on a Monster Run, I will post again, what ETFs have major exposure. My hunch is $ARKG will have and KEEP 10% weight. I believe it’s ARKG’s Tesla. Bullish",
        "sentiment": {
            "TextBlob": 0.22791666666666668,
            "NLTK": 0.5719,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9960570335388184
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-29T15:10:15Z",
        "content": "$DNA If you are intrigued Ginkgo Bioworks but owning it scares the heck out of you, perhaps an ETF allows you to sleep at night. Birds of a Feather, Flock together. There’s likely a bunch of other cool stuff to get excited about beyond Ginkgo Bioworks. Here’s the top ETFs arranged by most exposure by % of assets. $IDNA $MOON $MRND are never mentioned. Usually ARK and Bailee Gifford are only thought to play a roll. By the way, VTI is among the biggest owners with the smallest weight. If Jay Powell even hints at an end to hikes, VTI will be one of the biggest inflows of Funds to own the whole market. When money enters, they are buyers of DNA. VTI lifts all ships for sure. It’s also lowered ships for the last year. \n\nAnyhow, lots of cool themes. It might satisfy your curiosity. MOON is one that I sort of wished I owned going into the top of the Market as it owns some edgy stuff. \n\n$KOMP is regarded by a lot of Pros as a more Conservative approach vs. ARK. It goes up less than ARK.",
        "sentiment": {
            "TextBlob": 0.207843137254902,
            "NLTK": 0.962,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9869842529296875
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-29T01:14:14Z",
        "content": "$DNA I kind of missed the Annual Shareholder letter they submitted today. It’s worth reading. There’s some new additions to collaborations. I believe it’s a bit of a hint that 1Q 2023 is pretty solid. Maybe I’m over analyzing that part based on the tone of the letter. sec.gov/Archives/edgar/data... Bullish",
        "sentiment": {
            "TextBlob": 0.2572727272727272,
            "NLTK": 0.4951,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9609315991401672
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-28T20:05:27Z",
        "content": "$DNA Here is Ginkgo vs. all Comparable or associates today. Bullish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9986334443092346
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-28T20:02:26Z",
        "content": "$DNA Some people on here can find the ONE cloud in the sky on a Sunny Day. I picture them kicking their dog after they win the Lottery. You could give them a scoop of Chocolate Ice Cream and they’d want Vanilla. Bullish",
        "sentiment": {
            "TextBlob": 0.8,
            "NLTK": 0.8176,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.827530562877655
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-28T19:57:10Z",
        "content": "$SPGP Excellent Fund Flow. twitter.com/dilksjay/status... Bullish",
        "sentiment": {
            "TextBlob": 1.0,
            "NLTK": 0.5719,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9834379553794861
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-28T18:28:54Z",
        "content": "$BRK.B Leaders of Berkshire’s portfolio today. $CHTR $USB $OXY Bullish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9912639856338501
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-28T18:27:10Z",
        "content": "$SPGP I’m not sure I’ve ever seen $CE $JBHT and $APA be in the top 3 of leaders for SPGP. Bullish",
        "sentiment": {
            "TextBlob": 0.125,
            "NLTK": -0.0418,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9975894689559937
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-28T18:25:13Z",
        "content": "$ARKG Leaders today in ARKG. $PACB $NTLA $IOVA",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9885267019271851
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-28T16:30:42Z",
        "content": "$DNA Two terms I always see misused in investing are: \n\nRecency Bias\nReversion to the Mean\n\nIn my opinion, the last 1-2 years is recent. People are hijacking the last year of awful performance as an assured continuance of awfulness.\n\nIf you believe in Reversion to the Mean, because it’s a real thing, then bad performing stocks, “should” revert to the Mean if business is as good or getting better.  The Mean for DNA is somewhere around $5.50-$6 based on Volume. Not including Volume, someone could game the Stats and say it’s $7 or $4. Regardless, it’s higher. \n\nAgain, people typically apply Recency Bias to Great times only get BETTER. The Bias is a warning that they will not get better. They revert to their Mean. \n\nThe Recency Bias of Bears is that the bad stock action must and will get worse. \n\nSomething to think about. miraeassetmf.co.in/knowledg...",
        "sentiment": {
            "TextBlob": -0.05996376811594203,
            "NLTK": 0.2103,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9981655478477478
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-27T21:29:09Z",
        "content": "$DNA Take this for whatever it’s worth: I think it’s really cool that people are reaching out to Management at Ginkgo Bioworks. Over the last decade I’ve been blown away by how many people I can send a message to and a lot of times they will say, can you just call me at ………. And they give me a phone number and they pick up immediately. It starts a relationship that they frequently reciprocate with an open dialogue. One key thing: Be Nice, know your stuff, have an opinion with a solution. DON’T Complain. It absolutely helps to be an investor for over a year and have the shares to prove it. Whether you have 10,000 shares or 500,000 shares, TIME typically gets the ear of someone. About 10 years ago, I sent someone really famous an email about the Fund they Managed, he asked me for my phone number and I got a call back 2 minutes later. Explained the answer perfectly and he asked me 5 questions. Other ETFs I’ve held, I’ve had some similar experiences. Specific companies……just be NICE.",
        "sentiment": {
            "TextBlob": 0.21435185185185188,
            "NLTK": 0.9742,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9273386597633362
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-27T20:13:02Z",
        "content": "$BRK.B vs. $VTI the last two years.",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9926173090934753
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-27T19:42:11Z",
        "content": "$SPGP Leaders at the moment. Big Movers !",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9991657733917236
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-27T19:39:11Z",
        "content": "$DNA There are a couple of people on here that have posted 10-15 times just today and really without news or information. That would be considered SPAM. Anyone can REPORT and BLOCK. Honestly, I could care less if anyone has a negative opinion and write about it with specifics but SPAM ruins StockTwits for everyone. It’s just thoughtless repetition. It’s why paragraphs are allowed and encouraged to put 15 thoughts into one post.",
        "sentiment": {
            "TextBlob": 0.03666666666666669,
            "NLTK": -0.9124,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9996416568756104
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-27T17:18:28Z",
        "content": "$DNA If you ordered the Motif Burgers, you likely just got a follow-up survey. It’s looks like they are about to launch this for Food Services. FYI. Bullish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.6166,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9954354166984558
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-27T11:16:33Z",
        "content": "$SPGP Pre-Market Movers. Big chunks of positive, one chunk negative of Tractor Supply. SPGP only has 74 holdings. Bullish",
        "sentiment": {
            "TextBlob": -0.01818181818181818,
            "NLTK": -0.0258,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9993888139724731
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-27T09:49:29Z",
        "content": "$TSLA This week, Tesla vehicles crossed over as providing measurably more value than an ICE equivalent. It likely takes months for people to believe it because it will take 10 or more times to see measurable comparisons through social media, the news and word of mouth. Tesla just pivoted from a concept of improving the planet to it’s just a better vehicle with better economics of ownership. This has been talked about as a goal for a decade. It’s happening. The Stock price likely reflects the upside in a meaningful way going into this summer in the Northern Hemisphere. Bullish",
        "sentiment": {
            "TextBlob": 0.31666666666666665,
            "NLTK": 0.9117,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.8081846237182617
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-26T16:09:18Z",
        "content": "$DNA I’m not sure if anyone noticed but those post below of proposed sales are from 5 days ago. This has been happening to create more FUD. If people post on StockTwits with the sole purpose of hating certain stocks, I’d question their intentions. It’s like attending a sporting event for a team a team you hate to boo them and you only boo. That’s odd. It’s not normal. Bullish",
        "sentiment": {
            "TextBlob": -0.07217261904761904,
            "NLTK": -0.8903,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9995546936988831
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-26T15:33:24Z",
        "content": "$TSLA Added more. $154.77 is the 30% RSI.",
        "sentiment": {
            "TextBlob": 0.5,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.968434751033783
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-26T15:13:50Z",
        "content": "$TSLA $154.77 is the 30% RSI which has historically been a large accumulation and technical support. Often, it doesn’t reach there because people front-run it here. Just an observation. I added more shares in the last 10 minutes. Bullish",
        "sentiment": {
            "TextBlob": 0.14285714285714285,
            "NLTK": 0.6478,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9991347193717957
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-26T13:14:52Z",
        "content": "$SPGP Here’s the current top 15 Holdings. Bullish",
        "sentiment": {
            "TextBlob": 0.25,
            "NLTK": 0.2023,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9900351166725159
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-26T12:56:30Z",
        "content": "Here is $ARKK which is their Best Ideas ETF. If you use reasoning, then $DNA is their 20th best idea at about 2% weight. I think they might want it to be top 15 but maybe top 20 is where they are satisfied. ARKK is far larger than ARKG with $7.1 Billion in assets. $ARKG is (surprisingly) their 2nd biggest Fund at just under $2 Billion. When you see ARKK buy 3-4x more shares, that’s why. They have a bigger gun to shoot. Bullish",
        "sentiment": {
            "TextBlob": 0.39999999999999997,
            "NLTK": 0.867,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9723320603370667
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-26T12:50:32Z",
        "content": "$DNA $ARKG I would imagine ARKG is getting close to done buying. The signature I have observed for the last 8 years as an ARK investor is the biggest gains in ARKG typically come from the #10-#25 holdings with those having the highest likelihood of becoming #1-#5, one year later. If you believe that happens for Ginkgo Bioworks, then it begins a 200-300% move soon………..”potentially”. As you can see, they’ve been selling Exact Sciences to attempt to keep it under 10% weight. That will happen to Ginkgo in the future too if it has a massive run. Don’t take it personally when it does. Rarely does ARk buy something to 10%, they want to get it to about 3% and let it Organically Run. If all The holdings run higher, it has a runway closer to 400% UP.",
        "sentiment": {
            "TextBlob": 0.09848484848484848,
            "NLTK": 0.4019,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9630017280578613
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-26T00:10:11Z",
        "content": "$DNA Dang…..that’s a lot of shares for $ARKK and $ARKG. I love it ! Bullish",
        "sentiment": {
            "TextBlob": 0.625,
            "NLTK": 0.7712,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9980833530426025
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-25T17:29:51Z",
        "content": "$DNA Need some more clarity here. investors.biogen.com/news-r... Bullish",
        "sentiment": {
            "TextBlob": 0.5,
            "NLTK": 0.4576,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9987227320671082
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-25T17:28:17Z",
        "content": "$DNA $BIIB FDA grants accelerated approval for Biogen's ALS drug  cnbc.com/2023/04/25/fda-gra... Bullish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.6124,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9910271763801575
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-25T17:15:16Z",
        "content": "$DNA I’m not sure if anyone watched the entire Peter Lynch interview this morning on CNBC from Boston. If you are a buyer today, you would think he was describing Ginkgo Bioworks with their high cash and no debt position. The guy is as sharp as ever. It’s always darkest before it’s Pitch Black as he described it. Even a lot of Bulls feel it’s Pitch Black. That’s progress. Bullish",
        "sentiment": {
            "TextBlob": -0.0913888888888889,
            "NLTK": -0.7237,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.6702780723571777
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-25T15:11:31Z",
        "content": "$DNA Added at $1.22 AGAIN. Bullish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.996738851070404
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-25T14:43:02Z",
        "content": "$DNA Added at $1.22. Bullish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9961044788360596
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-25T14:40:47Z",
        "content": "$DNA Pretty obvious shelf. Bullish",
        "sentiment": {
            "TextBlob": 0.125,
            "NLTK": 0.4939,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9993520379066467
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-24T11:13:22Z",
        "content": "$DNA Basically, Jet Fuel is the Holy Grail. Synthetic Rubber is #2. Sumitomo is behind them as a partner along with the Gates Foundation. Sumitomo is the most important. Bullish",
        "sentiment": {
            "TextBlob": 0.16666666666666666,
            "NLTK": 0.2716,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.927919328212738
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-24T11:11:07Z",
        "content": "$DNA There’s a common denominator. Blue Yard Capital is a Seed Funding partner of Visolis. This was a positive catalyst the last time they were involved. forbes.com/sites/johncumber... Bullish",
        "sentiment": {
            "TextBlob": -0.01818181818181818,
            "NLTK": 0.5574,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9977133274078369
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-23T13:28:44Z",
        "content": "$ARKG The #1 holding $EXAS is up over 100% since October. It’s at 10.36% weight which means it triggers selling to bring it under 10%. ARK loves EXAS and has published their upside which is higher from here. Them selling is Technical and NOT Fundamental. People hated EXAS when they were gobbling up shares in single digits years ago. Forced Selling on STRENGTH is the Utopian ETF trade for ARK. It’s the best case scenario. They are buying today’s “JUNK” with today’s Treasure. It’s a virtuous cycle. It’s why I own ARKG vs. Buying 10 different Biotechs. Bullish",
        "sentiment": {
            "TextBlob": 0.07232142857142858,
            "NLTK": 0.9638,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.8417789340019226
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-23T13:22:21Z",
        "content": "$ARKG Closing at $31.74 is a level the Bears have a tough time defending from a Technical Analysis point of view. Big Air Pocket above that HIGHER. There’s a pretty quick 33% move going into the Summer. That $40.62 is the lid but a 33% move higher likely pushes the 80 RSI into the $60s for the Fall. I’m not sure we get a 100% move in 2023 but you never know. It’s happened several times. Slow and steady is fine with me. Bullish",
        "sentiment": {
            "TextBlob": 0.05198412698412697,
            "NLTK": 0.1548,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.7496724724769592
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-23T12:16:51Z",
        "content": "@SwingTradeToronto I don’t blame you. This is likely the most conservative my portfolio has been in 15 years. There are so many individual companies I want to buy but just haven’t until they get more traction and the environment is more constructive. DNA is the only real REACH I own at the moment for an individual company. My rule has been to try to balance any reach for a stock with equal amounts of Berkshire $BRK.B and $SCHD as Ballasts to my portfolio. It smooths it out in choppy waters. Bullish",
        "sentiment": {
            "TextBlob": 0.21666666666666667,
            "NLTK": 0.2142,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9919775128364563
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-23T11:40:26Z",
        "content": "$DNA $2.45 was the price BTIG assigned to Ginkgo in Mid-November. They bought $100 Million of Ginkgo Bioworks. I just assumed they shorted DNA and now they will ride it all the way back up to $2.45 and determine whether to keep the investment. If they executed it perfectly, it bottomed on March 28th so that took about 4 months. It’s it reasonable to think that about 3 months from now using the same trajectory it hits $2.45 ? Maybe. So on about July 23rd it’s $2.45. It’s a thought. I believe, using Technical Analysis, DNA is a bit like a Beach Ball being held under water. I bet you get 50% of that move in one day. No clue what day that is. Maybe not even Good News Dependent but it wouldn’t hurt either to have genuine Good News with Cash Attached to the news. genomeweb.com/business-news...",
        "sentiment": {
            "TextBlob": 0.375,
            "NLTK": -0.7692,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9978613257408142
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-23T11:06:16Z",
        "content": "$DNA I’m a Fundamental Investor but realize some people ONLY use Technical Analysis. People who use TA typically buy and sell far more frequently and have characteristics of a day trader instead of an investor. If people were being honest, Technical Analysis would have largely kept people out of DNA as an investment for at least the last year including Friday. This goes both ways as there really aren’t a ton of buy signals although the strength just crossed 50% of Friday that’s the START of a trend reversal. If you don’t subscribe to Technical Analysis but want to learn, the most basic way is to look at the following chart. Above the moving line is GOOD, below it is BAD. There’s a bunch of loud naysayers that most have muted or blocked but their tune changes if/when the price closes above $1.39000 and stays there for 2-3 days. If it takes a week, that price is more like $1.375. Looking at the chart, it’s flattened and pinched since early March. Those candles are getting compressed. Bullish",
        "sentiment": {
            "TextBlob": 0.12281746031746033,
            "NLTK": 0.8844,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9990801811218262
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-23T01:42:25Z",
        "content": "$DNA Nice recap from Ferment 2023. Worth reading. linkedin.com/pulse/3-takeaw... Bullish",
        "sentiment": {
            "TextBlob": 0.44999999999999996,
            "NLTK": 0.5719,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9958441853523254
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-22T12:52:09Z",
        "content": "up 300% perfectly puts it as a traditional #1 spot. ARK is being almost belligerent and LOUD about where this goes with their persistence.  It reminds me of $GBTC in 2015 in ARKW with the “shot pattern” for buys. GBTC went from #12 to #1 Fast. Bullish",
        "sentiment": {
            "TextBlob": 0.325,
            "NLTK": 0.6369,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.8374253511428833
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-22T11:14:41Z",
        "content": "I actually meant to tag $ARKG on this but maybe my error was appropriate as ARKG has been buying Ginkgo Bioworks every single day lately. It’s their 11th position.",
        "sentiment": {
            "TextBlob": 0.032142857142857154,
            "NLTK": -0.5499,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9963217973709106
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-22T11:12:04Z",
        "content": "$DNA This doesn’t include Friday but I would assume there were inflows on a strong day. ARKG has been gaining momentum as they have about $40 Million of new buyers this week. 5 days in a row hasn’t happened very often. This (potentially) leads to bigger moves going into May. Nice trend developing. If you don’t understand the graph, it simply means there were more buyers in Dollar Terms than Sellers over the past week. All that money buys the holdings of ARKG. Bullish",
        "sentiment": {
            "TextBlob": 0.17996632996632997,
            "NLTK": 0.9161,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.8944027423858643
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-21T17:57:37Z",
        "content": "$ARKG Leaders of ARKG right now. Oddly, all 10 are either on my wishlist to buy or I own them. $NVTA $VERV $SLGC . That’s why I own ARKG ! Bullish",
        "sentiment": {
            "TextBlob": 0.3672619047619048,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9988150596618652
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-21T01:17:20Z",
        "content": "$SCHD vs. $BRK.B for the last 5 years. I own Both. I add to either based on which one lags the other.",
        "sentiment": {
            "TextBlob": 0.15833333333333333,
            "NLTK": -0.3612,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9982233643531799
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-20T16:03:58Z",
        "content": "$DNA nutraingredients-usa.com/Ar... Bullish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9980663657188416
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-20T15:39:18Z",
        "content": "$SPGP Top Performers today. $NUE $LRCX Bullish",
        "sentiment": {
            "TextBlob": 0.5,
            "NLTK": 0.2023,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9845252633094788
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-20T15:39:15Z",
        "content": "$SPGP Has a bunch of Green in a Sea of Red today. $NUE $LRCX Bullish",
        "sentiment": {
            "TextBlob": -0.1,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9848139882087708
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-20T13:23:39Z",
        "content": "$TSLA Added Pre-Market to a very LONG position already. Bullish",
        "sentiment": {
            "TextBlob": -0.065,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9876204133033752
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-20T10:25:28Z",
        "content": "$DNA This partnership likely goes far deeper that what appears on the surface. optimvia.com/ Bullish",
        "sentiment": {
            "TextBlob": 0.05,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9962674975395203
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-20T10:23:14Z",
        "content": "$TSLA Launch at 8:45 AM Eastern for Starship that will be airborne until about 9:30 for a hard landing in the Ocean off of Hawaii. It’s going to take some time but there’s a point where people will do the math an see how valuable SpaceX will be in the future. I still believe, SpaceX will acquire Tesla in the future if Tesla Market Cap slips more than 20%. I don’t think anyone wants to bet against that combined company. Bullish",
        "sentiment": {
            "TextBlob": 0.08166666666666667,
            "NLTK": 0.6059,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9110234379768372
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-19T22:36:06Z",
        "content": "$TSLA Likely a big opportunity here. I’m not a big fan of after-hour purchases BUT the most I’ve ever done is with Tesla over the past decade. Irrational disappointment should be taken advantage of in my humble opinion. Bullish",
        "sentiment": {
            "TextBlob": -0.07857142857142858,
            "NLTK": -0.6839,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9871892333030701
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-19T22:23:32Z",
        "content": "$DNA I kind of thought this would get attention today. Heparin is VITAL, Worldwide. twitter.com/dilksjay/status... Bullish",
        "sentiment": {
            "TextBlob": 0.35,
            "NLTK": 0.4466,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9220426678657532
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-19T20:02:46Z",
        "content": "$DNA Nice day with 27% higher volume. Bullish",
        "sentiment": {
            "TextBlob": 0.425,
            "NLTK": 0.4215,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9589427709579468
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-19T18:42:44Z",
        "content": "$DNA Deoderant is a massive Potential winner. Unilever should buy it or P&G. Bullish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.5859,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9847485423088074
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-19T18:34:14Z",
        "content": "$DNA Talking about Heparin. This is HUGE. \n\nThis is Optimvia: CritIcal medicine from Pigs by scraping their intestines in China. ITs disgusting. He said that.\n\nSynthetic Heparin. He believes this will take over Pigs. This is the biggest thing of the day, in my opinion. \n\nHeparin is SO CRITICAL\n\nThis is tailor made for ARPA-H. \n\nDon’t discount this…….HUGE. \n\nGotta Go. Bullish",
        "sentiment": {
            "TextBlob": -0.14999999999999997,
            "NLTK": -0.7735,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9982289671897888
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-19T18:30:10Z",
        "content": "$DNA Microba: Australian Company for Gut Microbiome….Ahem…big theme. \n6 out of 10 people have chronic disease. \n\nThe GUT is important for mood in the brain. \n\n71% of everything in the Gut is uncharacterized. \n\nInteresting. Autoimmune with Ginkgo\n\nThey listed Mental Health through Gut\n\nHey, gotta go to a Tennis Match. I hope somebody can update anything newsworthy.",
        "sentiment": {
            "TextBlob": 0.2,
            "NLTK": 0.7506,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.5811383724212646
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-19T18:25:16Z",
        "content": "$DNA More Gut Microbiome. It’s a big Theme. \n\nPersephone: This is interesting. Analyzing Baby Poop. I’ve always thought $EXAS should acquire this for diagnosing things ultra-early. \n\nLiving Medicines for the Gut. \n\nShort and Sweet. Bullish",
        "sentiment": {
            "TextBlob": 0.27,
            "NLTK": 0.6908,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9697024822235107
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-19T18:04:46Z",
        "content": "$DNA I forgot to tag DNA on this.",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9980247020721436
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-19T17:43:58Z",
        "content": "$DNA I like they started on time at 9:30 and 1:30. I notice these things. Another thing people might discount is all the guests have come across as Kind. Not Biotech Dic%s. \n\nMammalian : Circular RNA. Sounds like it can be hyper targeted and durable. \nManufacturing 80% purity. That’s excellent.  \nCAR-T 5 are approved. That might be newsworthy. \nThey have 10,000 CAR Designs currently and test them in head to head tests to rapidly find a “winner”. \nDiversity at Scale: 720,000 unique CAR-T tests in 3 week period. \nMining for Immune Cloking\nI’d encourage looking at the slides from this section.",
        "sentiment": {
            "TextBlob": 0.49375,
            "NLTK": 0.9607,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9844921827316284
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-19T16:21:56Z",
        "content": "$ARKG Top performers today.",
        "sentiment": {
            "TextBlob": 0.5,
            "NLTK": 0.2023,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9592167735099792
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-19T16:19:08Z",
        "content": "$DNA Prokarium : Revolutionize Cancer with Living Cures. This sounds like the company most in need of Ginkgo. I need to do some research on this. \n\nBasically, the gentlest of Cancer Cures in my humble opinion. \n\nLunch till 1:30.",
        "sentiment": {
            "TextBlob": 0.15,
            "NLTK": -0.6705,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9300402998924255
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-19T16:15:13Z",
        "content": "$DNA News Breaking. Ayanna Bio to announce two things. He specifically mentions Kraft Macaroni and Cheese to be healthier. \n\nCacao,Saffron, Coffee, synthetically produced. \n\nEchinacea \n\nLemon Balm\n\nThis is “potentially really big but need to hear specifics at scale. \n\nThis likely had the most amount of obvious Easter Eggs as hints.",
        "sentiment": {
            "TextBlob": 0.125,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9874023795127869
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-19T16:10:38Z",
        "content": "$DNA Saponiqx CEO: I’m clueless on this company QS-21 Tree Bark. Hmmmmmmmm\n\nNo trees needed. Wait a minute. He mentioned Squalane like Amyris. Someone educate me on this. \n\nFor Vaccines through Adjuvants. \n\nI need to dig into this company and the Squalane stood out. \n\nQS-21 used in Malaria potential. \n\nThis might be a sleeping giant and a perfect fit for Ginkgo. I like this guy’s energy. Great Presenter. Talks at Jason Kelly Speed. Bullish",
        "sentiment": {
            "TextBlob": 0.44000000000000006,
            "NLTK": 0.9136,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9442179799079895
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-19T16:05:01Z",
        "content": "$DNA Lygos CEO: Biodegradable home products. OK….this sounds like a shot at Tide Laundry Detergent. Performs better. Anyone correct me if I’m mishearing or misinterpreted. Picture of Woman by Washer and Dryer. Mentions Blue Chip Partners. He’s pumped up. Bullish",
        "sentiment": {
            "TextBlob": 0.25,
            "NLTK": 0.4767,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9975026249885559
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-19T15:49:51Z",
        "content": "$DNA Syngenta and Bayer Crop Science. Interesting because the Dr. from Bayer mentions she is on stage with their biggest competitor. Provocative because Ginkgo can bring them together. \n\nDrought tolerance and Rice surviving Floods. Short stature corn is really a big deal for precision applications.\n\nCorey Huck from Syngenta. Soil Health Microbiome. That’s a hint on maybe where the Ginkgo connection is. If the plant is healthier, it will fight off a bad environment. \nSoil Science in its infancy. He mentioned Pheromones as “maybe” something they are working on to Ferment with Ginkgo. \n\nBayer: Carbon Sequestration. Cover crops in pilot launches. Great for BIO DIESEL \n\nSyngenta. Hunger is big problem and degraded soils are a problem. \n\nMaybe from the segment, Bio Diesel from Crops and enriching Soil are the 2 takeaways .\n\nCover Crops are what the interviewer comes back to. I might have missed the connection but possibly these cover crops improve the soil and can be harvested for Bio Diesel",
        "sentiment": {
            "TextBlob": 0.07500000000000002,
            "NLTK": 0.1779,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9874838590621948
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-19T15:30:41Z",
        "content": "$DNA That slide sure looked like Lettuce they were growing that looked Larger. Possibly Romaine. Bullish",
        "sentiment": {
            "TextBlob": 0.16666666666666666,
            "NLTK": 0.6705,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9959740042686462
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-19T15:14:27Z",
        "content": "$DNA News I missed from a partner today of Ginkgo. prnewswire.com/news-release... Bullish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": -0.296,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9992915391921997
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-19T14:43:57Z",
        "content": "$DNA Also newsworthy is Allonia injecting enzymes into the ground near polluted sites. Pretty cool. Sort of eats the bad stuff before it reaches water. Before, there product was to treat the water for forever chemicals. Bullish",
        "sentiment": {
            "TextBlob": 2.7755575615628914e-17,
            "NLTK": 0.2263,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9910365343093872
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-19T13:56:58Z",
        "content": "$DNA Living Carbon is expected to speak. Jason just said there’s some travel issues with the CEO. When I first heard about this, I asked the CEO and Jason if there was a Ginkgo Link. I didn’t get an answer. This is a really big idea and I hope there IS a connection to Ginkgo Bioworks. Massive idea for fast growing Poplar Trees to reforest places rapidly. Take a look. livingcarbon.com/post/photo...",
        "sentiment": {
            "TextBlob": 0.06999999999999999,
            "NLTK": 0.5574,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.8414557576179504
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-19T13:50:48Z",
        "content": "$DNA Also newsworthy is a new payment method. If it doesn’t work, there’s no charge for Enzymes. That’s Ai certainty. Bullish",
        "sentiment": {
            "TextBlob": 0.13636363636363635,
            "NLTK": -0.0516,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9988551139831543
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-19T13:48:39Z",
        "content": "$DNA Looks like there is a May 31st Cell Therapy event. That’s newsworthy from Ferment. Bullish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.3612,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9867616891860962
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-19T12:16:44Z",
        "content": "$DNA Summitomo is a speaker today and they helped develop Hyaline. Again, this is not newsworthy, I’m not expecting an update BUT it was a product that worked. The problem was doing it at scale. If anyone watches, let me know if you hear Hyaline. It’s upside is performing at high temperatures and durability. Aerospace Optics are the obvious end product. Someone with much deeper knowledge than me, believes Solar Panels are the ultimate homerun for durability. It could be worthless for all I know but I doubt it. Consumer products like TVs,Cell Phones, Car Lights, Windows are easy targets. I’m really not going to defend the product but just bringing awareness. It was the only reason I invested in Zymergen late and received DNA shares after the merger. By the way, I looked at my converted shares and it does say MERGER and not acquisition. synbiobeta.com/read/zymerge...",
        "sentiment": {
            "TextBlob": -0.04518518518518519,
            "NLTK": 0.2617,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9190624356269836
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-19T11:27:24Z",
        "content": "$DNA This is NOT and I stress NOT a Ginkgo Headline but foldable phones are the ultimate end product for Hyaline Film that Ginkgo Acquired from Zymergen. It’s a bendable “glass” tailor made for this because of durability and clarity. Ginkgo has stated they want to sell this technology, ie, get rid of it for the right price. I’ve sort of scratched my head on them holding onto it. Google to launch its first foldable phone, the 'Pixel Fold,' in June cnbc.com/2023/04/18/google-...",
        "sentiment": {
            "TextBlob": 0.17857142857142858,
            "NLTK": 0.6874,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.6464054584503174
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-18T17:21:04Z",
        "content": "$ARKG It’s been a longtime since I’ve seen $TDOC lead the way for $ARKG . Does anyone have any insight on why it’s up?",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9993963241577148
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-18T17:13:02Z",
        "content": "$DNA This is a little “out there” but I was digging into Genomatica’s Patents and the one that is really interesting for EVERYONE in the Chemical Space that’s related to today’s news is this;",
        "sentiment": {
            "TextBlob": 0.10416666666666667,
            "NLTK": 0.611,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9954206347465515
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-18T16:09:54Z",
        "content": "$DNA twitter.com/jrkelly/status/... Bullish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9976048469543457
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-18T11:23:45Z",
        "content": "$DNA Here’s the Genesis. I didn’t realize Genomatica wants to be called Geno. globenewswire.com/en/news-r... Bullish",
        "sentiment": {
            "TextBlob": 0.2,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9976663589477539
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-18T10:01:20Z",
        "content": "$DNA Not exactly sure BUT this might be the product that will be produced at scale with the Berlin, Germany company. This isn’t confirmed but from the description of what they need to produce it for say, Unilever, L’Oréal, etc…..  cambrium.bio/products Bullish",
        "sentiment": {
            "TextBlob": 0.07500000000000001,
            "NLTK": -0.1232,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.996292769908905
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-17T20:27:09Z",
        "content": "$SCHD Best Stocks in SCHD today.",
        "sentiment": {
            "TextBlob": 1.0,
            "NLTK": 0.6369,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.8980685472488403
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-17T20:24:37Z",
        "content": "$SPGP had a surprising RED day today. I usually post top performers but here was the drag associated.",
        "sentiment": {
            "TextBlob": 0.16999999999999998,
            "NLTK": -0.1027,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9505977630615234
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-17T20:22:39Z",
        "content": "$BRK.B Berkshire has some great momentum building since mid-March. Here are today’s top performers.",
        "sentiment": {
            "TextBlob": 0.65,
            "NLTK": 0.7096,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9996451139450073
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-17T20:20:36Z",
        "content": "$ARKG Top performers today.",
        "sentiment": {
            "TextBlob": 0.5,
            "NLTK": 0.2023,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9592167735099792
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-17T19:07:32Z",
        "content": "$MRNA $DNA barrons.com/articles/modern... Bullish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9980588555335999
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-17T18:11:19Z",
        "content": "$DNA One heck of a shelf at $1.22 for a month.",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9963614344596863
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-16T13:19:36Z",
        "content": "@hydel I’m surprised you are the first to bring it up. As a $BRK.B shareholder, I realize Warren has a partial investment in Ginkgo. Two degrees of separation but kind of, sort of connected. Summitomo likely has the nearest path of producing something at scale for everyday products that “might” involve Ginkgo. Bullish",
        "sentiment": {
            "TextBlob": 0.10833333333333332,
            "NLTK": 0.1154,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.7896206974983215
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-16T11:50:50Z",
        "content": "$DNA Matthew McKnight is the head of Biosecurity at Ginkgo Bioworks. The Department of Defense is going to be a bigger customer than most realize today. It’s important. matthewfoxmcknight.medium.c... Bullish",
        "sentiment": {
            "TextBlob": 0.3,
            "NLTK": 0.3182,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9981117248535156
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-16T10:52:49Z",
        "content": "$ARCT trades at $27.57. Although this isn’t related, I’m curious if the name of this new variant causes Algorithmic BUYING of the stock this week. Arcturus is the #13 holding in $ARKG and has been a previous #1. nbcnewyork.com/news/local/n... Bullish",
        "sentiment": {
            "TextBlob": -0.03257575757575758,
            "NLTK": 0.3182,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.996688187122345
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-15T10:46:47Z",
        "content": "$DNA It took a good night’s sleep to understand what was unique about the Motif Burgers I ate yesterday. I was thinking too small. This is something that can be sold to any company that sells Meat Alternatives. I really wonder what adding this to a Veggie/Black Bean Burger would do. 22% of the World doesn’t eat Meat. prnewswire.com/news-release... Bullish",
        "sentiment": {
            "TextBlob": 0.25625,
            "NLTK": 0.4404,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9974677562713623
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-14T23:24:20Z",
        "content": "$DNA Here’s a review of the Motif Burgers. I liked them and they are absolutely made for $MCD to sell as a Meat Substitute. Meat eaters will like them. This is a legit food that is nothing like Beyond Meat or Impossible Burgers. I ate the first one plain without toppings or a bun. Very satisfying.  twitter.com/dilksjay/status... Bullish",
        "sentiment": {
            "TextBlob": 0.13650793650793652,
            "NLTK": 0.8777,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9876987934112549
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-14T18:33:59Z",
        "content": "$DNA There was a little more to the Congo Story this morning. New collaboration. twitter.com/ginkgo/status/1... Bullish",
        "sentiment": {
            "TextBlob": 0.14962121212121213,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9954919815063477
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-14T13:13:31Z",
        "content": "$SPGP has outperformed $SPY / $VOO on every timeframe going back 15 years except for 2023 by 4% due to banks. SPGP is at a discount and likely closes that 4% gap rapidly from here. invesco.com/us/en/country-s...",
        "sentiment": {
            "TextBlob": -0.041666666666666664,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9971375465393066
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-14T12:51:00Z",
        "content": "$SPGP Hey, look who’s leading pre-market. Should be a good day.",
        "sentiment": {
            "TextBlob": 0.7,
            "NLTK": 0.4404,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9994526505470276
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-14T10:29:21Z",
        "content": "$DNA If you follow ARKG trades, the one thing that’s becoming obvious is that ARKG is REALLY trying to keep Ginkgo in the top 10 but everything ahead up it is marching higher. The top holding, $EXAS is something people should take notice of because ARK accumulated Exact Sciences when it was hated and are now FORCED SELLERS (They don’t want to sell it) when it exceeds 10% weight and this selling is now lasting months. ARK was accumulating heavily in 2016 in the $6 range and have been forced sellers in the $60-$70 range. I just don’t want DNA shareholders to get mad when ARK accumulates a massive amount of shares in the $1-$2 Range and are Forced Sellers at $10.",
        "sentiment": {
            "TextBlob": -0.03166666666666667,
            "NLTK": -0.9633,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9953786134719849
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-14T09:50:40Z",
        "content": "$DNA If you believe Ginkgo Bioworks is a Materials Company because it’s in Materials Indexes and ETFs then you would believe in a reversion to the mean in those indexes. Materials are up about 5% as a group in 2023 which lags the market. Ginkgo is down just about 22% so a 27% move higher is warranted. If you think it’s reversion should chase ARK, well ARKK is up 25% and ARKG is up 9.46%. If you think it’s Biotech, XBI is DOWN 4.3%, which surprised me. IBB is only up 1.74%, which also surprises me. I just assumed Biotech was beating the market by a lot based on comments of the board. The Dow is up 2.73% and again I assumed higher. QQQ is up 19.86% and the S&P 500 is up 8.12%. Just be careful of people making it seem like the Market is on fire daily. QQQ is on fire because 7 stocks out of 100 have been great. Reversion to the Mean works both ways. Ginkgo “should” revert higher 25-30% in the next quarter and likely over 100% in a year to make up a massive overshoot negative.",
        "sentiment": {
            "TextBlob": 0.01961805555555556,
            "NLTK": -0.2263,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9925366640090942
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-14T09:30:41Z",
        "content": "$SPGP Financials make up 13.69% of SPGP and today kicks off Financial season with Banks. This ETF holds some Regionals but not any Big Boys. Regardless, the group often trades in Sympathy for better or worse. Right now is about the first time I’ve cared about this weighting in this ETF in years. I typically ignore it. Good news could be a nice tailwind  to fill the sails. Bad news is already been realized to downside last month. Bullish",
        "sentiment": {
            "TextBlob": 0.09718614718614721,
            "NLTK": 0.5719,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9953925609588623
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-13T21:41:37Z",
        "content": "$ARKG Big moves in a lot of holdings today.",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9990591406822205
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-13T19:26:41Z",
        "content": "$DNA I know people won’t believe this but Ginkgo Bioworks has been beating the Dow Index since March 10th. Going on 5 weeks now. It likely takes 2-3 months for people \nTo believe it on this board. Bullish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": -0.6124,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9992548823356628
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-13T14:07:51Z",
        "content": "$ARKG Leaders this morning. $VERV $CRSP $BFLY Bullish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9982596039772034
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-13T14:02:36Z",
        "content": "$DNA The Big Ten Research Consortium is a BIG deal. twitter.com/dilksjay/status... Bullish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9905706644058228
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-13T11:13:36Z",
        "content": "$DNA One thing going unappreciated is Universities are just now setting up curriculum that supports Graduating with the knowledge to FERMENT something by utilizing Ginkgo Bioworks. Environmental Engineering is rapidly changing. Biology + Technology with the help of engineering is exploding beyond MIT and UC Davis. It’s a must have curriculum. Bullish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.3612,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9955431818962097
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-13T11:09:12Z",
        "content": "$DNA The University of Wisconsin is a top 10 NIH Research Institution ranked by $ received in Funding. It’s a big deal. Bullish",
        "sentiment": {
            "TextBlob": 0.25,
            "NLTK": 0.2023,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9927582740783691
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-12T18:58:55Z",
        "content": "$DNA Added another sliver. Bullish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9940463304519653
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-12T14:54:12Z",
        "content": "$DNA Adding a sliver more here Bullish",
        "sentiment": {
            "TextBlob": 0.5,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9979631900787354
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-12T12:37:30Z",
        "content": "$BRK.B It’s stunning what kind of earning power Berkshire has in good times as well as Bad. Remarkably refreshing hearing Warren on CNBC. The steadiest hand in the history of investing. Bullish",
        "sentiment": {
            "TextBlob": 0.32,
            "NLTK": 0.743,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9992806315422058
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-12T10:57:09Z",
        "content": "$DNA With CPI at 8:30 AM, charts are a bit meaningless as it’s a really big deal Good or Bad. If it prints a Hot Number, disregard this completely. If it Neutral or Really Good, $1.40 close to the day is great news as it chops through a lot of overhead resistance. If $1.40 is maintained for the rest of the week to a little higher, then $1.50 is a far easier hurdle to cross. FOMO would then kick in. We aren’t there yet. Today is pretty much the last possible day insiders could sell because it takes two days to settle before wiring cash to the IRS before April 18 at Midnight to pay a 2022 Bill.",
        "sentiment": {
            "TextBlob": 0.12265625000000001,
            "NLTK": 0.8328,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9973389506340027
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-11T21:58:43Z",
        "content": "$ARKG $ARKK Something to consider when you become dismissive about $TDOC in the top 5 for ARKG. If you or a Family Member are diagnosed with Cancer, this might become VERY important when you handle a complicated situation. It’s one of their fastest growing areas of business.  teladoc.com/health-talk/can... Bullish",
        "sentiment": {
            "TextBlob": 0.17333333333333334,
            "NLTK": -0.0191,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.5980737209320068
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-11T18:43:52Z",
        "content": "$SCHD This is an odd leaderboard for SCHD today. $RDN $WHR $PARA Bullish",
        "sentiment": {
            "TextBlob": -0.16666666666666666,
            "NLTK": -0.3182,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9980175495147705
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-11T18:41:55Z",
        "content": "$SPGP Leaders of SPGP at the moment. $CF $MOS $SYF Bullish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9983067512512207
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-11T18:38:19Z",
        "content": "$ARKG Leaders of today at the moment. $SLGC $BFLY $NVTA Bullish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.997572124004364
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-11T18:17:42Z",
        "content": "$DNA Biobot has a Collaborative agreement with Ginkgo Bioworks. They are both In Cambridge Massachusetts. reuters.com/world/us/califo... Bullish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.4939,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9826457500457764
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-11T15:34:44Z",
        "content": "$DNA Just ordered. I’ll give a review next week.",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.5905912518501282
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-10T20:01:23Z",
        "content": "$DNA About 10% of the volume came in the last 10% of the session to the upside. Noted. Bullish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9987571239471436
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-10T18:45:43Z",
        "content": "$DNA Tomorrow, people can start ordering Motif Burgers. Ginkgo Owns Motif. madewithmotif.com/products/... Bullish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9978214502334595
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-10T18:42:09Z",
        "content": "$ARKG Leaders at the moment for ARKG. $BFLY $PRME $CDXS Bullish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9980904459953308
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-10T18:04:03Z",
        "content": "$TSLA This little micro-dip lately was the door closing before, what I believe, is a big move UP. If you added this morning or even now, congratulations ! Bullish",
        "sentiment": {
            "TextBlob": -0.1625,
            "NLTK": 0.636,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9863887429237366
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-10T15:33:31Z",
        "content": "$DNA Most expensive spices in the World. If they are lab grown, brewed, fermented, etc……they are MATERIALS. slofoodgroup.com/blogs/reci... Bullish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9969797730445862
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-10T15:24:29Z",
        "content": "$DNA Similar holdings to Gingko today for comparison.",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9820788502693176
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-07T12:53:00Z",
        "content": "$PACB $ARKG twitter.com/pacbio/status/1... Bullish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9987448453903198
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-07T12:12:25Z",
        "content": "$SPGP It’s clear that SPGP is a smarter choice vs. owning $SPY or $VOO. It’s a GARP ETF that only holds 75 of the 500 stocks that are selected as Growth at A Reasonable Price. Here is the chart since it’s launch in 2011.",
        "sentiment": {
            "TextBlob": 0.10000000000000002,
            "NLTK": 0.802,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9992332458496094
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-07T02:04:28Z",
        "content": "$DNA The Company that just funded $4.2 Million to Sensible Biotechnologies is Blueyard Capital out of Berlin, Germany. I have a feeling they could be involved in future deals involving Ginkgo Bioworks. Here’s an idea of what they are doing this year. Unrelated but in the same space as Ginkgo. forbes.com/sites/johncumber...",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0644,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.995411217212677
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-06T20:24:23Z",
        "content": "$DNA 31% above average volume today. It’s something to take notice of in the big picture. Honestly, a lot of average Funds likely did not want Ginkgo Bioworks on their books for the first quarter. The 2nd quarter that started this week is another story. My hunch is most of the buys are from previous shareholders that booked a loss, waited 30 days to claim it to offset future gains. Whatever it is, today was positive for total shares traded. Nice finish. Happy Easter Weekend if you celebrate. Perhaps we are seeing Ginkgo Rise from the dead.  Forgive me for comparing Jesus to a stock. Bullish",
        "sentiment": {
            "TextBlob": 0.14441287878787878,
            "NLTK": 0.9401,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9360412359237671
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-06T18:33:11Z",
        "content": "$TSLA Likely twitter.com/teslaboomermama... Bullish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9990234375
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-06T16:56:02Z",
        "content": "$ARKG Leaders at the moment for ARKG. $BFLY $DNA $NVTA",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9925675392150879
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-06T01:34:13Z",
        "content": "$DNA If people can’t figure it out, Ginkgo does NOT want to go vertical. They want to be AWS but they don’t want to deliver those packages to your home.  Amazon Delivery is a terrible business. Amazon Web Services is about the best business on the planet. AWS serves the NFL, Biotech, Netflix, Big Pharma and ordinary people that just want to store their family photos inexpensively. People laugh at Ginkgo Bioworks comparison to AWS and that’s fine. The bigger the Flywheel, the better the opportunities. The past 12 months has been fantastic to DNA’s future. As far as the price depreciation………exploit it. Bullish",
        "sentiment": {
            "TextBlob": 0.1013888888888889,
            "NLTK": 0.9753,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9789450168609619
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-05T21:07:34Z",
        "content": "$DNA Really good article. fiercebiotech.com/biotech/g... Bullish",
        "sentiment": {
            "TextBlob": 0.7,
            "NLTK": 0.4927,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9578877091407776
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-05T10:29:10Z",
        "content": "$DNA twitter.com/dilksjay/status... Bullish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9983147382736206
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-04T18:02:04Z",
        "content": "$DNA Comparative ETFs at the moment by sector,market cap and style.",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9643175601959229
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-04T17:45:19Z",
        "content": "$ARKG Leaders at the moment.",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9345529675483704
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-04T14:54:09Z",
        "content": "$DNA twitter.com/jrkelly/status/... Bullish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9976048469543457
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-04T11:22:18Z",
        "content": "$DNA Solvay is an $11 Billion International Company. solvay.com/en/our-company Bullish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9893860816955566
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-04T11:20:18Z",
        "content": "$DNA Does anyone have a realistic handle on Cambridge Real Estate to infer what this is worth? stockilluminati.com/dna/dis... Bullish",
        "sentiment": {
            "TextBlob": 0.22222222222222224,
            "NLTK": 0.2263,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9991481304168701
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-04T11:16:50Z",
        "content": "$DNA Before Tuesday the 18th, there’s really only 6 or 7 days to sell shares to pay a tax bill for 2022. It takes 2 days for a trade to settle. I don’t know, maybe 7 equal buys between now and then gives you a fair average if you intend to hold long. No sales this Quarter, yet by insiders. Bullish",
        "sentiment": {
            "TextBlob": 0.09999999999999999,
            "NLTK": 0.2263,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.999237060546875
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-04T10:42:02Z",
        "content": "$ARKG Premarket movers in ARKG $BFLY",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9917935729026794
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-03T21:36:07Z",
        "content": "$DNA forbes.com/sites/johncumber... Bullish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9946427345275879
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-03T15:56:59Z",
        "content": "$DNA hey Ginkgo: Buy $TWST . It’s an $800 Million Market Cap with $500 Million of Cash on Hand. Basically, they get it for $300 Mill. Drop the Twist Name, trade under DNA ticker. Win/Win for both Longterm. Call it a merger or whatever you want. Just combine them. Powerhouse. Bullish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.34,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9901793003082275
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-03T15:38:17Z",
        "content": "$TWST Does Twist still have about $500 Million Cash on hand for an $800 Million Market Cap?  I’m asking for a friend if anyone has a clear view.",
        "sentiment": {
            "TextBlob": 0.10000000000000002,
            "NLTK": 0.8402,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9983855485916138
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-03T15:08:49Z",
        "content": "$TSLA Selling is becoming exhausted. You might see a big reversal. Bullish",
        "sentiment": {
            "TextBlob": 0.016666666666666663,
            "NLTK": -0.3612,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9997674822807312
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-03T15:02:49Z",
        "content": "$DNA Interesting that Austin Che wrote the news release today. He has before but just a little more leadership visibility. Bullish",
        "sentiment": {
            "TextBlob": 0.2708333333333333,
            "NLTK": 0.2144,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9683127999305725
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-03T11:07:56Z",
        "content": "$TSLA When Oil stays above $80, that’s a tailwind for Tesla. Natural Gas has collapsed. Natural Gas Generates cheaper electricity, higher Oil is more expensive gasoline to fill those SUVs and Trucks. The current Administration absolutely blew it by draining the Strategic Petroleum Reserve. No more bullets to shoot. World is tuning out America for Energy control.",
        "sentiment": {
            "TextBlob": 0.04444444444444443,
            "NLTK": 0.0352,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.99754399061203
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-01T22:59:46Z",
        "content": "$DNA Here’s a list of ETFs by most amount of shares of DNA owned.",
        "sentiment": {
            "TextBlob": 0.5,
            "NLTK": 0.3535,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9971091151237488
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-01T22:58:19Z",
        "content": "$DNA Here’s a list of ETFs that hold DNA shares arranged by highest to lowest allocation.",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": -0.1027,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9987682700157166
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-01T11:35:15Z",
        "content": "@Samalex If you doubt what I’m saying, go back to the earnings call and listen to Jason Kelly explain it. These founders bootstrapped the business by buying stuff with their credit cards to get stuff off of EBay. They really did this. Doing that sort of thing sticks in your mind that can never be shaken. If I were a Forensic Psychologist, their $1.3 Billion in cash is a manifestation of NEVER having to feel like they are Financially leveraged again in their lives. They won’t take on debt and they will always have a Financial Moat for $DNA and their personal lives. Each day they have sold is not like hearing bells go off in a Vegas Slot machine. Quite the contrary. It’s FORCED SELLING. Perhaps the really odd share a dollar amount Jason Kelly just sold under 100,000 shares should tell you something. Perhaps he had a number for 2023, it was met and that’s it. I could be wrong on this.  I don’t know, I’m just inferring. Bullish",
        "sentiment": {
            "TextBlob": -0.09583333333333334,
            "NLTK": -0.387,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.803006112575531
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-04-01T11:10:35Z",
        "content": "$DNA This is exactly correct. When this plan was put in place almost 2 years ago it was with the thought that shares would be $10 or more per share. The Founders have been FORCED SELLERS in two ways. First, the RSUs they received were in 2022. That’s a taxable event immediately. It’s EARNED INCOME at the price they were issued in October. That tax is due in 2 weeks to the IRS. There are no options but to sell at whatever price but it can’t exceed 1% of the daily volume hence a ton of staggered sales. If the price was $20 per share in November, perhaps a handful of sales could have covered the tax Bill. They didn’t even pay themselves from the first batch of sales that lasted months. Now they are paying themselves. This is what they have control over. They have not been living extravagantly for a decade. The Founders are all relatively young in their early 40’s. If you looked closely, they all TRANSFERRED shares to estates and donations too. It’s gotta be close to done.",
        "sentiment": {
            "TextBlob": 0.11388888888888887,
            "NLTK": 0.5845,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9973627924919128
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-03-31T21:49:48Z",
        "content": "$ARKK Wes Pike has a solid record. Here’s his view. twitter.com/dilksjay/status... Bullish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.1531,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.6121978759765625
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-03-31T21:27:03Z",
        "content": "$SPGP leaders today of SPGP.",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.974157989025116
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-03-31T21:18:18Z",
        "content": "$SCHD Top performers for today in SCHD.",
        "sentiment": {
            "TextBlob": 0.5,
            "NLTK": 0.2023,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9908550977706909
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-03-31T21:12:40Z",
        "content": "$BRK.B A steady day for Berkshire. Only Kraft Heinz was red. Here are the top performers.",
        "sentiment": {
            "TextBlob": 0.16666666666666666,
            "NLTK": 0.2023,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9739120006561279
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-03-31T20:56:19Z",
        "content": "$DNA Warrants finished the day +12.5%. Warrants tell the future. Bullish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9977667331695557
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-03-31T20:49:22Z",
        "content": "$ARKG A lot of contributors to ARKG success today. $PACB $ARCT $BFLY",
        "sentiment": {
            "TextBlob": 0.3,
            "NLTK": 0.5719,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9069908857345581
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-03-31T20:35:40Z",
        "content": "$TSLA This has made my year in a big way. Bullish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.998895525932312
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-03-31T20:32:43Z",
        "content": "$TSLA This is playing out exactly as I thought. The symmetry is shockingly similar. Bullish",
        "sentiment": {
            "TextBlob": 0.125,
            "NLTK": 0.0258,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9867189526557922
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-03-31T20:00:50Z",
        "content": "$DNA A Constructive day for this little gem. Bullish",
        "sentiment": {
            "TextBlob": -0.1875,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9954142570495605
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-03-31T13:04:47Z",
        "content": "$SPGP Likely a great spot to add before the move up. Here it is vs. $VOO Bullish",
        "sentiment": {
            "TextBlob": 0.4,
            "NLTK": 0.6249,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9466131329536438
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-03-30T14:15:33Z",
        "content": "$ARKG Early leaders. One thing to note: $ARCT is a former #1 holding of ARKG when ARKG hit $100.",
        "sentiment": {
            "TextBlob": 0.05,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9454807639122009
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-03-30T10:32:06Z",
        "content": "$DNA Fintel has a realistic price chart between now and February for Best Case/Worst Case from Analysts.",
        "sentiment": {
            "TextBlob": 0.5833333333333334,
            "NLTK": 0.6369,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.8884969353675842
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-03-29T19:43:20Z",
        "content": "$DNA The Warrants have been a pretty fair leading predictor for better or worse. They tell the future.",
        "sentiment": {
            "TextBlob": 0.20999999999999996,
            "NLTK": 0.6486,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9801819920539856
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-03-29T19:11:31Z",
        "content": "$ARKG Top performers of ARKG at the moment. $ARCT $CDXS $DNA Bullish",
        "sentiment": {
            "TextBlob": 0.5,
            "NLTK": 0.2023,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9933297038078308
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-03-29T18:33:27Z",
        "content": "@SwingTradeToronto Whether people buy $XBI, $IBB $ARKG or $LABU , I believe Biotech is at a Generational Bottom. Lots of opportunities for upside. Whatever anyone’s speed, I’d pick something in Biotech for the next few years. Bullish",
        "sentiment": {
            "TextBlob": -0.1,
            "NLTK": 0.3818,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9992714524269104
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-03-29T16:16:29Z",
        "content": "$DNA One thing to note: These shares can be bought back by Ginkgo Bioworks and retired. One thing to do is to see if the Float is reduced. It’s a sneaky share buyback “IF” they do it. The shares would essentially never hit the market. They are just retired or kept in Treasury for future uses. I’m speculating but ultimately when these are filed during the session, it likely signals an end. There is no reason to keep filing these daily. Once and done. Bullish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": -0.0129,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9995169639587402
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-03-29T16:08:59Z",
        "content": "$DNA Of all the sales, this is the first disclosed on the same day during a session which means it “MIGHT” signal, the end of selling. The hares are already sold. Bullish",
        "sentiment": {
            "TextBlob": 0.125,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9993127584457397
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-03-29T13:47:43Z",
        "content": "$DNA Per AlphaArchitect: 73% of all stocks will have a 50% or more drawdown in price in their lifetimes. It’s a stunning statistic. Hey, at least you got it over with early. Bullish",
        "sentiment": {
            "TextBlob": 0.19999999999999998,
            "NLTK": 0.3818,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9978728294372559
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-03-29T13:12:47Z",
        "content": "$SPGP Here are the top holdings of SPGP.  $META $NRG Bullish",
        "sentiment": {
            "TextBlob": 0.5,
            "NLTK": 0.2023,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9984011054039001
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-03-29T12:59:31Z",
        "content": "$ARKG Pre-market ARKG leaders.",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9933326840400696
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-03-29T10:50:54Z",
        "content": "$SCHD If your eyes go to the 2020 Covid-19 lows, we are completing the first big dip then a second smaller dip setting up for a big rebound. A pretty significant BASE formed over the last Year +.  We are down more than 10% over the last year which likely means a 20% or move up for the rest of 2023. That would be quite the ripper for SCHD.",
        "sentiment": {
            "TextBlob": 0.03226495726495726,
            "NLTK": 0.4939,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9965386390686035
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-03-28T20:17:03Z",
        "content": "$ARKG $ARCT Nice finance.yahoo.com/news/arct... Bullish",
        "sentiment": {
            "TextBlob": 0.6,
            "NLTK": 0.4215,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9957450032234192
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-03-28T18:44:57Z",
        "content": "$SCHD Leaders of the Fund today.",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.7742564678192139
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-03-28T18:43:57Z",
        "content": "$SPGP Leaders of SPGP at the moment.",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.6186161637306213
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-03-28T18:41:38Z",
        "content": "$ARKG This was a Sea of RED a few hours ago but getting a bit of a turn.",
        "sentiment": {
            "TextBlob": -0.1,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9953605532646179
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-03-28T17:57:28Z",
        "content": "$DNA Added a small amount at $1.17. Bullish",
        "sentiment": {
            "TextBlob": -0.25,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.988275945186615
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-03-28T16:53:02Z",
        "content": "$DNA Sorry if this was posted yesterday.  I totally missed this announcement that is wholly owned by Ginkgo Bioworks. This is interesting. prnewswire.com/news-release... Bullish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": -0.024,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9927369356155396
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-03-28T11:01:51Z",
        "content": "$DNA If you own the stock and are sitting on a loss and you don’t believe that DNA will outperform the market, the reasonable solution would be to sell and invest it in something that will outperform the market. Generally speaking, an 8.8% return is considered, very good, for a balanced portfolio’s return. Based on yesterday’s close, a 9% return would be a close of $1.34 at the end of the year. To be fair, DNA started the year at $1.69, so 9% above that is $1.84, if you have owned this since January 1.  I feel like I need to explain why I hold shares and have not sold. I have shares in a taxable and non-taxable account. The non-taxable 401K is truly something I won’t touch until 2030. The other (about 50%) of the shares I own are shares I won’t sell until, AT LEAST they are 1 year old to have a Longterm Capital Gain or a loss, potentially. I don’t daytrade. I file jointly and am married so Gains are taxed at 15% after 365 days. A gain sold before this would be taxed at 32-37%.",
        "sentiment": {
            "TextBlob": 0.24875000000000003,
            "NLTK": 0.9759,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.62456876039505
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-03-27T18:01:32Z",
        "content": "$DNA Starting to become newsworthy. Marburg often has higher mortality than Ebola. More healthcare workers infected/deaths. A bunch of people from Tanzania traveling Worldwide are being monitored. who.int/emergencies/disease... Bullish",
        "sentiment": {
            "TextBlob": 0.25,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9944791793823242
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-03-27T14:42:24Z",
        "content": "$DNA 9:1 Negative to Positive Ratio here for sentiment. If you want out, JUST SELL. Please sell and find something that excites you. It’s OK. I will never understand someone hating a company and owning shares in the company. It’s insane. Bullish",
        "sentiment": {
            "TextBlob": -0.1431818181818182,
            "NLTK": 0.8669,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9986575841903687
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-03-27T14:39:40Z",
        "content": "$SPGP Somehow, I always forget about the Dividend that hit the account today. Bullish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": -0.2263,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.999143123626709
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-03-24T14:58:49Z",
        "content": "$MMM There’s a solution to 3M’s problems with PFAS. The solution is owned by $DNA allonnia.com/solutions/ Bullish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.2263,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9987972974777222
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-03-24T14:35:03Z",
        "content": "$ARKG I always say, when there’s a Global Banking Crisis, the flight to safety is Biotech………….I will now let myself out the back door.",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": -0.3182,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9914058446884155
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-03-24T14:15:19Z",
        "content": "$SCHD If you are genuinely looking years ahead, today and Monday are great times to “Time the market” for SCHD. Nobody can truly time the market but typically the day before and day of Dividends is a reasonable pocket of a dip. A downdraft. So many people reinvest their dividends, that Monday gets Muted as a 1% dip that’s often .5% dip or even UP. With SCHD Bank holdings, it sure feels like there will be some Bank Resolution this weekend with the Fed meeting today. Here are the worst performers in SCHD that you are…..”buying the dip”.",
        "sentiment": {
            "TextBlob": 0.1761904761904762,
            "NLTK": 0.4678,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9997327923774719
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-03-24T13:41:43Z",
        "content": "$BRK.B I bet Berkshire is active SELLING something today.",
        "sentiment": {
            "TextBlob": -0.13333333333333333,
            "NLTK": 0.4019,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9964869022369385
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-03-24T12:38:34Z",
        "content": "$DNA I’m going to be commenting less and only on real news or at least related news from partners. I’m Long,Strong and patient. I encourage people to mute or block anyone who is repetitive on being miserable without any contribution of deep thought. The FUD game is to be as noisy as possible the sew the seeds of doubt. Ginkgo is a very good company with a lot of upside but a very bad stock……..up to this point. Things change. Bullish",
        "sentiment": {
            "TextBlob": -0.1597222222222222,
            "NLTK": -0.8594,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9690325856208801
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-03-23T19:43:35Z",
        "content": "$ARKG Here’s a different view by weight.",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9736040830612183
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-03-23T19:42:15Z",
        "content": "$ARKG has been very resilient in a bad market today. I have to admit, I have totally missed $ACCD near 100% move up in 2023. Here are today’s ARKG leaders. Bullish",
        "sentiment": {
            "TextBlob": -0.09999999999999995,
            "NLTK": -0.6659,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9995996356010437
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-03-23T17:38:48Z",
        "content": "$BRK.B Kind of a weird day for Berkshire to be down. I usually post the top performers but here are the worst ones. It’s only a handful and it’s not that bad. I’m surprised Berkshire is DOWN today.",
        "sentiment": {
            "TextBlob": -0.15611111111111112,
            "NLTK": -0.1217,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9864880442619324
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-03-23T11:32:48Z",
        "content": "$ARKG The biggest UP days often come out of great despair. Maybe yesterday afternoon was PEAK PESSIMISM. Here’s pre-market Movers in ARKG.",
        "sentiment": {
            "TextBlob": 0.8,
            "NLTK": -0.1111,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9962561130523682
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-03-22T17:29:55Z",
        "content": "$DNA vimeo.com/event/3144203 Starting soon. Bullish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9984115362167358
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-03-22T17:05:58Z",
        "content": "$DNA whitehouse.gov/ostp/news-up... Bullish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9980803728103638
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-03-22T15:05:31Z",
        "content": "$DNA People will look back at Biden speaking about it as the most obvious moment when this concept is embraced. It’s getting close to On Par with the price of producing things the same way they have been made for 100 years. Biology+Technology wins. Bullish",
        "sentiment": {
            "TextBlob": 0.16,
            "NLTK": 0.5719,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9986892342567444
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-03-22T10:51:03Z",
        "content": "$ARKG $ARKK $ARKW Worth Remembering.",
        "sentiment": {
            "TextBlob": 0.3,
            "NLTK": 0.2263,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9627878665924072
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-03-21T22:58:52Z",
        "content": "$DNA This is interesting because Oxford Nanopore is a company Ginkgo, works with on a bunch of programs. Their success is important. businesswire.com/news/home/... Bullish",
        "sentiment": {
            "TextBlob": 0.4000000000000001,
            "NLTK": 0.802,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.99886155128479
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-03-21T20:33:01Z",
        "content": "$DNA Beware of people who change their opinion simply because the price is positive. Investing in whatever the wind blows is Longterm, destructive. I respect momentum investors but not opinions based only on price. Most $50 Billion Companies were once $2 Billion Companies.  I have a list of people with constructive opinions when it wasn’t convenient to be constructive. People who saw no value simply come and go and are noise. Ginkgo has been an awful stock but not an awful company. The progress they have made in the past year is remarkable. The price will catch up to that progress in due time. Apple, Amazon,Tesla,Netflix,Regeneron and 100s more were awful stocks………until they weren’t. Things Change. Bullish",
        "sentiment": {
            "TextBlob": -0.15367132867132866,
            "NLTK": 0.3506,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9611048698425293
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-03-21T20:01:02Z",
        "content": "$DNA A constructive day. Bullish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9986037611961365
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-03-21T19:39:59Z",
        "content": "$SCHD Tomorrow is ex-dividend day for payday on Monday. Here is a great resource to bookmark. dividendmax.com/united-stat... Bullish",
        "sentiment": {
            "TextBlob": 0.8,
            "NLTK": 0.6249,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.5821138620376587
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-03-21T14:50:23Z",
        "content": "$DNA Fermentation Tweet with Funding from The Dept. of Defense and Agriculture. In many ways, it’s the Cell Tower Capacity before the IPhone release. twitter.com/dilksjay/status...",
        "sentiment": {
            "TextBlob": 0.5,
            "NLTK": 0.128,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9875913858413696
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-03-21T13:57:30Z",
        "content": "$SPGP We might be ready for a big run here. The Regional Banks brought this down and they likely lead the way UP.",
        "sentiment": {
            "TextBlob": 0.011111111111111106,
            "NLTK": 0.3612,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9792711734771729
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-03-21T13:50:30Z",
        "content": "$SCHD Almost all of these holdings were added at Friday’s close. Sometimes it’s great to be lucky with timing like SCHD was in this situation. $BOH $SNV Bullish",
        "sentiment": {
            "TextBlob": 0.5666666666666667,
            "NLTK": 0.8555,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.8094844222068787
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-03-21T11:23:06Z",
        "content": "$SCHD Here were the leaders of yesterday with the new holdings. There are a lot of changes in the total holdings.",
        "sentiment": {
            "TextBlob": 0.06818181818181818,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9940487146377563
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-03-21T10:44:03Z",
        "content": "$SCHD Here’s the major rebalance including a bunch of Regional Banks. schwabassetmanagement.com/p... Bullish",
        "sentiment": {
            "TextBlob": 0.0625,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9994860887527466
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-03-21T00:01:34Z",
        "content": "$DNA Before people jump to (positive) conclusions, this is from Biogen’s site about the collaboration. Curing Lou Gehrig’s Disease (ALS). would be fantastic. investors.biogen.com/news-r... Bullish",
        "sentiment": {
            "TextBlob": 0.31363636363636366,
            "NLTK": 0.5574,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9331531524658203
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-03-20T20:02:19Z",
        "content": "$DNA Lousy Price day but he buy at the close moved it over 2% UP. Bullish",
        "sentiment": {
            "TextBlob": -0.5,
            "NLTK": -0.3071,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9578033089637756
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-03-20T20:00:38Z",
        "content": "$DNA 2.3 Million shares bought at flows. Hmmm. Bullish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.296,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9923292994499207
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-03-20T17:12:49Z",
        "content": "$DNA There’s zero shame in selling. If it bothers anyone, get out and never look back. It’s just a stock.",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": -0.5994,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.986889123916626
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-03-20T13:54:31Z",
        "content": "$ARKG Pharma and Materials lead the way in Rate Changes to flat or down. Same with these holdings.",
        "sentiment": {
            "TextBlob": -0.060185185185185196,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.998496413230896
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-03-20T13:52:39Z",
        "content": "$BRK.B Berkshire holdings today. Here are the leaders.",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9928297400474548
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-03-20T13:50:20Z",
        "content": "$SPGP Leaders of SPGP right now.",
        "sentiment": {
            "TextBlob": 0.2857142857142857,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.56657475233078
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-03-19T23:08:12Z",
        "content": "$DNA $ARKG Interesting perspective with data to back it up if The Fed PAUSES. Ginkgo is Biopharma/Biotech/Materials.",
        "sentiment": {
            "TextBlob": 0.25,
            "NLTK": 0.4019,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9810585975646973
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-03-18T19:11:11Z",
        "content": "$SCHD Here’s the top holdings before the rebalance.",
        "sentiment": {
            "TextBlob": 0.5,
            "NLTK": 0.2023,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9869721531867981
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-03-17T20:01:25Z",
        "content": "$DNA 7 Million shares traded in the last 5 seconds. Option expiration. Interesting volume. Let’s see if that flips the script next week. Bullish",
        "sentiment": {
            "TextBlob": 0.16666666666666666,
            "NLTK": 0.5994,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9976164102554321
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-03-17T18:22:34Z",
        "content": "$DNA $1.3167 is the new Pivot Point. A $1.32 close is very bad for the bears.",
        "sentiment": {
            "TextBlob": -0.3868181818181817,
            "NLTK": -0.5849,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9996306896209717
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-03-17T15:22:27Z",
        "content": "$SPGP This is from December but it still does a great job of explaining the Fund. stocks.apple.com/AegRnDFnnT... Bullish",
        "sentiment": {
            "TextBlob": 0.8,
            "NLTK": 0.7684,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9746381044387817
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-03-17T15:03:20Z",
        "content": "$ARKG This doesn’t include yesterday that was likely positive. Inflows are returning to ARKG. The dip is being bought.",
        "sentiment": {
            "TextBlob": 0.11363636363636363,
            "NLTK": 0.5574,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9934896230697632
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-03-17T14:25:34Z",
        "content": "$BRK.B Here are the worst performing Berkshire holdings. I have to imagine they are buying stuff heavily today and this week including their own stock under $300. Bullish",
        "sentiment": {
            "TextBlob": -0.19999999999999998,
            "NLTK": -0.6249,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9997256398200989
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-03-17T14:04:49Z",
        "content": "$DNA wWhats interesting with this, is that if you open it up and read, they put Ginkgo in CHEMICALS for classification. I’m not sure most think of Ginkgo as Chemicals which are low PE and slow or Low growth. Bullish",
        "sentiment": {
            "TextBlob": 0.06428571428571428,
            "NLTK": 0.0356,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9990615248680115
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-03-17T13:48:57Z",
        "content": "$ARKG Only 5 holdings are Green. Looks like between 10:30-11:30 that’s when things start to strengthen this week.",
        "sentiment": {
            "TextBlob": -0.1,
            "NLTK": 0.5859,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.8236153721809387
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-03-17T13:44:30Z",
        "content": "$SPGP $UPS is rarely the top performer in this ETF.",
        "sentiment": {
            "TextBlob": 0.4,
            "NLTK": -0.1511,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9992334842681885
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-03-17T13:31:37Z",
        "content": "$DNA I’m going to laugh if this finishes Unchanged today at $1.32. Options expiration day.  The action has been curious all week. Higher is bad for a lot of “bets”. Bullish",
        "sentiment": {
            "TextBlob": -0.02999999999999996,
            "NLTK": 0.34,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.997803270816803
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-03-17T12:57:40Z",
        "content": "$NOPE is one for the record books of FOMO. People always talk about people “buying at the top” and losing money in themes. It works the other way too. Look at the GREED of pessimism as he was shorting the exact wrong things to start the year. Money poured into  NOPE because he was SHORT ARKK and Tesla as his #1 and #2 top holdings. 62% of that cash has been evaporated by the wrong picks in 10 weeks. That is a new record for ETFs. It’s the worst performing ETF in 2023. I think there’s a fair chance his use of leverage is investigated by the SEC at some point. This would be the 3rd Fund he has lost (if it happens) due to redemptions. He’s 0 for 2 in managing an ETF so far.",
        "sentiment": {
            "TextBlob": -0.01168831168831169,
            "NLTK": -0.9436,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9996045231819153
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-03-17T12:47:28Z",
        "content": "$ARKK There’s an ETF called $NOPE that has been between 30-50% SHORT, ARKK in 2023. NOPE is down 62% so far in 2023. That’s not a typo. ARKK is up 26%. The NOPE etf is an extreme example of HUBRIS as the Manager, George Noble has publicly lambasted ARK. Being 62% down in 65 days is tough to do but his Fund is over leveraged in shorting the wrong things like ARK, Tesla, Nvidia and further wrong that he has been Long Treasuries that have lost value. The reason I mention this is that he apparently has closed or is closing the short of ARKK. It was 40+% a week ago and today it’s under 5%. He’s not investing in ARKK but he has stopped betting against it………..62% too late. I just wanted to pass this along. Bullish",
        "sentiment": {
            "TextBlob": -0.09531250000000001,
            "NLTK": -0.631,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.999431312084198
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-03-17T11:53:40Z",
        "content": "$DNA I’m going to stop this daily exercise of showing ARKK as a buyer due to inflows but here’s further proof.\nTuesday- 105,778,158 shares\nWednesday- 106,749,885 shares\nYesterday - 107,370,724 shares. \n\nNo buys were reported by ARKK. This is a similar story with ARKG too. A couple of people were suggesting I was sort of “making stuff up” about how ETFs work. These are the facts. When ARK reports buys/sell is what’s IN ADDITION to what inflows and outflows were for the day. \n\nIf you are going to question my character, please bring facts to the table. There’s now a whole bunch of ETFs that have DNA in them including Passive ETFs like VTI. Yesterday likely marked a change of tone in the market and a lot of people go from the sidelines to invested. DNA starts to get a ramp UP just by a higher tide raising all ships. Yesterday aside, the Beta in DNA suggests that DNA will rise at a rate about 300% faster as it Reverts to its Mean at or about $4-$6. Beyond that depends on real progress.",
        "sentiment": {
            "TextBlob": 0.03125000000000001,
            "NLTK": 0.9442,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9943363070487976
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-03-16T21:29:20Z",
        "content": "$SCHD Interesting article about March 20th for SCHD. seekingalpha.com/article/45... Bullish",
        "sentiment": {
            "TextBlob": 0.25,
            "NLTK": 0.4019,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9934812784194946
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-03-16T20:44:37Z",
        "content": "$DNA ARKK was up 3.07% today and ARKG was up 1.73%, both on above average volume. They both likely added another 1 million shares. Biotech wasn’t exactly on fire today. IBB was up .54% and XBI was up .23%. I’ve mentioned a lot of Materials ETFs now have Ginkgo in it. VAW was up 1.12% on above average volume. My point is that DNA is now in a range that has sort of stopped going down precipitously. When all these Funds gain momentum, they become buyers or at least the themes become bought. Tomorrow is option expiration day. It just kind of feels like it wants to run but can’t run. That will change. Bullish",
        "sentiment": {
            "TextBlob": 0.029444444444444447,
            "NLTK": 0.3079,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.996455192565918
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-03-16T15:06:04Z",
        "content": "$DNA Reading the Tea Leaves: Ginkgo has elevated this partnership on their website this month. Jason Kelly visited them in Japan this month. It’s most likely the clearest and nearest next big news event that is at a massive scale. prnewswire.com/news-release... Bullish",
        "sentiment": {
            "TextBlob": 0.1,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9950363039970398
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-03-16T15:02:52Z",
        "content": "$TSLA Amyris success is good for Ginkgo. You WANT and NEED any synthetic Biology company to have success. You don’t want your neighbor to lose their job. It’s not good for the neighborhood. $AMRS",
        "sentiment": {
            "TextBlob": 0.23750000000000002,
            "NLTK": 0.9158,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9612572193145752
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-03-16T15:00:10Z",
        "content": "$TSLA Few people talk about Europe raising rates HELPS Tesla as they have to deposit cash there. Last year they paid money to Bank there, now they get Interest income. Bullish",
        "sentiment": {
            "TextBlob": -0.1,
            "NLTK": 0.7456,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.930776059627533
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-03-16T14:56:07Z",
        "content": "$DNA I think we run higher. Market is flipping. We might be about to break out based on Volume Weighted moves this week. Bullish",
        "sentiment": {
            "TextBlob": 0.25,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9989804625511169
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-03-16T14:54:17Z",
        "content": "$ARKG The train is about to leave the station. ARKG is ready to run.",
        "sentiment": {
            "TextBlob": 0.2,
            "NLTK": 0.3182,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9929919242858887
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-03-16T14:12:00Z",
        "content": "$SPGP Leaders of SPGP at the moment.",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.6186161637306213
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-03-16T12:52:32Z",
        "content": "$DNA People should know about page 34 in Ginkgo’s 10-K they filed this week in regards to $AMRS. If anyone wants to weigh in, I’m all ears for what this suggests with $AMRS.",
        "sentiment": {
            "TextBlob": 0.2,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9921860694885254
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-03-16T11:59:11Z",
        "content": "$DNA Just to finalize this ARK idea that they buy and sell daily, even if not reported, like last night. Ginkgo was not on their buys and sells yet they grew the amount of shares of Ginkgo they owned in ARKK . On Wednesday before the market opened, they owned 105, 778,158 shares. Today they own 106,749,885. Just to summarize how this happened. As people buy shares of ARKK during the day at all times of the day, ARKK goes into the market and buys “baskets” of Ginkgo shares as the buy orders come in. They increased their shares by 971,727 shares just yesterday. I will post my thoughts from yesterday and then post the screenshot of their shares right now. This is how ALL ETFs work. It’s not unique to ARK.",
        "sentiment": {
            "TextBlob": 0.13964285714285712,
            "NLTK": 0.9079,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9981665015220642
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-03-15T23:26:52Z",
        "content": "$BRK.B Warren and Charlie have had the time of their lives this past week. I’m a proud Berkshire investor. Bullish",
        "sentiment": {
            "TextBlob": 0.275,
            "NLTK": 0.4767,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.99594646692276
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-03-15T22:57:56Z",
        "content": "I really don’t like people dunking on $AMRS if they are $DNA investors. There’s zero upside to doing so. Listen, I’m one of the biggest fans of John Doerr. I’m also a big admirer of the quality of Amyris Beauty products. It’s the clear future of cosmetics/beauty/Skincare. It’s a better way. A better path. Amyris path is unsustainable with Melo. DNA has no interest in managing consumer goods. There’s value in both of these companies and I believe John would want in on DNA. Give him 3 Board Seats.  I want both companies to thrive. en.wikipedia.org/wiki/John_... Bullish",
        "sentiment": {
            "TextBlob": 0.21666666666666667,
            "NLTK": 0.9665,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.8482519388198853
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-03-15T21:44:42Z",
        "content": "$PATH is the 17th holding in $ARKG and the 8th holding in $ARKK . Tomorrow could be interesting.",
        "sentiment": {
            "TextBlob": 0.5,
            "NLTK": 0.4019,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9116485714912415
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-03-15T20:31:29Z",
        "content": "$ARKG Leaders of ARKG today.",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9489707350730896
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-03-15T20:10:46Z",
        "content": "$DNA ARKK finished up .79% on 37 Million Shares, 7 Million above average. This is how many shares they owned to start the day. 105,778,158 shares. For an experiment, if you genuinely don’t think they buy and sell shares everyday, they update the shares at midnight. See if it changes tomorrow. It will change regardless if they publish it. ARKG was up too, .14%.",
        "sentiment": {
            "TextBlob": 0.11000000000000001,
            "NLTK": 0.8402,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9775294065475464
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-03-15T18:56:52Z",
        "content": "$DNA $1.35 is the Pivot Point. The Golden Cross is up to many different measurements but $1.35 is sort of the agreed upon ……..Above is great, below is unproven from a Technical Perspective. It doesn’t have to happen today but if it did in an awful market, even better.",
        "sentiment": {
            "TextBlob": 0.1375,
            "NLTK": 0.8276,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.5668242573738098
            }
        },
        "image_url": ""
    },
    {
        "username": "jaydilks",
        "timestamp": "2023-03-15T18:47:24Z",
        "content": "$DNA fool.com/investing/2023/03/... Bullish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9991294741630554
            }
        },
        "image_url": ""
    }
]