[
    {
        "username": "Losing2Winning",
        "timestamp": "2023-05-09T22:10:43Z",
        "content": "$SPY $QQQ $TQQQ $SQQQ $SPYD \n\nNo deal. Surprise!!!!! NOT! Get out while you can after hours. Bearish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": -0.5216,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9989393353462219
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-05-04T22:50:54Z",
        "content": "$SPY $QQQ $AAPL $AMD $PACW \n\nI warned you clowns April would be up. Now I'm warning you May and June has the potential to be down big with US running out of cash by June 1 and only 7 days between now and then where the Senate and House will actually be in town, especially with Biden expected to spank McCarthy on Tuesday (yes, this coming Tuesday) with a lecture instead of an offer, be prepared for a MASSIVE crash. \n\nDuring the 2011 debt ceiling limit standoff, the S&P dropped -17% in 3 weeks. In 2022, it took almost 6 months from January to June to drop that much!!!\n\nA crash taking 3 WEEKS vs almost 6 MONTHS!\n\nLet. That. Sink. In.\n\nProtect yourselves.  Buy puts, sell covered calls, buy inverse ETFs, sell, do something.  You have been warned. Bearish",
        "sentiment": {
            "TextBlob": 0.025858410493827158,
            "NLTK": -0.9056,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9992024302482605
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-05-04T04:31:40Z",
        "content": "$SPY $QQQ $TQQQ $SPYD $UPRO  \n \nFed meeting today isn't the issue.  The issue is politicians.  NEW NEWS OUT THE LAST WEEK says if tax revenue isn't sufficient, the new X date is early June.  NEW NEWS MEANS NO ONE PREDICTED IT.  IT'S NEW.  I suspect smart money dumping any chance they get after April's rally. \n \nIn 2011 debt ceiling fight, the S&P 500 dropped 17% in 3 weeks. It took 5+ months to tank that much in 2022 from Jan to June! \n \nLet. That. Sink. In. \n \nIf you thought last year's sell off was bad, you ain't seen nothing yet. Wait for later this month/early June. \n \nEven after politicians agreed, the S&P agency downgraded US credit, causing -7% in 1 day.  Stocks didn't recover for 6 whopping months. \n \nX=X date \nDG=Downgrade \nD=Default date \n \nIf politicians continue to fight, the longer the duration, the more damage and sell off we see. If the US actually defaults, God help us all. This would be a manufactured severe recession or depression when there was non to start with. Bearish",
        "sentiment": {
            "TextBlob": 0.06998001998001999,
            "NLTK": -0.954,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9993718266487122
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-05-04T04:22:49Z",
        "content": "$SPY $QQQ $TQQQ $SPYD $UPRO  \n \nHoly fuck, I thought Biden was trying to work things out.  Looks like he's called the House and Senate leaders up just to act tough.  We are so fucked when the U.S. defaults in June.  Looks like the market is waiting for the last minute to panic sell. Bearish",
        "sentiment": {
            "TextBlob": -0.3472222222222222,
            "NLTK": -0.8725,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9993841648101807
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-05-03T16:12:17Z",
        "content": "$SPY $QQQ $TQQQ $SPYD $UPRO \n\nFed meeting today isn't the issue.  The issue is politicians.  NEW NEWS OUT THE LAST WEEK says if tax revenue isn't sufficient, the new X date is early June.  NEW NEWS MEANS NO ONE PREDICTED IT.  IT'S NEW.  I suspect smart money dumping any chance they get after April's rally.\n\nIn 2011 debt ceiling fight, the S&P 500 dropped 17% in 3 weeks. It took 5+ months to tank that much in 2022 from Jan to June!\n\nLet. That. Sink. In.\n\nEven after politicians agreed, the S&P agency downgraded US credit, causing -7% in 1 day.  The market didn't recover for 6 whopping months.\n\nX=X date\nDG=Downgrade\nD=Default date\n\nIf politicians continue to fight, the longer the duration, the more damage and selloff we see. If the US actually defaults, God help us all. This would be a manufactured severe recession or depression when there was non to start with, if things spiral out of control. \n\n(1 of 2) Bearish",
        "sentiment": {
            "TextBlob": 0.16097402597402596,
            "NLTK": -0.9302,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9993367791175842
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-04-30T13:32:33Z",
        "content": "$FRCB \nLast week I told you guys holding shares to sell the $35-$40 strike covered calls for December and get $200+ per contact, and then use those proceeds to buy puts expiring last week.  If you bought the $13 strikes for $100, you could have bought 2-3 of them, funded by selling covered calls.  If you sold the $20 strike covered calls, you may have been able to get 4-6 puts, netting ~$5K profit per 100 shares.  On Friday, you could have bought the covered calls back for like $20 and then sold the puts for around $1,000 EACH, and THEN sold your shares, making huge returns.  This strategy gives 100%+ gains whether the stock went to $30+ or $3.  NEVER fall in love with a stock.  Use good strategies like this to make MASSIVE returns.",
        "sentiment": {
            "TextBlob": 0.2625,
            "NLTK": 0.9049,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.7119826674461365
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-04-24T17:59:06Z",
        "content": "$FRCB \n\nI got shares around $14.  Sold the December covered call $40 strikes for $2.  I used the proceeds to fund buying the $13 put strikes expiring this week for $1 for insurance in case it tanks hard, and the remaining proceeds I bought the $19.5 call strikes also expiring this week for $1 as well in case it rallies hard.  Worst case, I lose only a little.  Best case, I'm up 200%+ Bullish",
        "sentiment": {
            "TextBlob": -0.12847222222222224,
            "NLTK": -0.7841,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9991200566291809
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-04-24T16:26:12Z",
        "content": "$FRCB \nHope no one was dumb enough to short at $12.  Party starts after hours.  Panic buying and panic covering at MASSIVE losses. Bullish",
        "sentiment": {
            "TextBlob": -0.09375,
            "NLTK": -0.8481,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.998913049697876
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-04-23T23:21:19Z",
        "content": "$FRCB \nIf you own shares, sell 1 (one) $35-$40 strike covered call per 100 lot shares owned expiring December, and use the funds to buy 1 (one) $13.5-$14 strike put expiring next Friday.\n\nIf the stock rallies hard, you'll gain more than 100% up to the strike price of $35-$40. If the stock tanks hard, you'll be able to sell your shares for whatever put strike price you purchased up through to Friday of next week.\n\nIn other words, your losses are limited, but you stand to gain more than double. This is how you manage risk and reward so you don't get divorced or destroy your (and your family's) financial wealth. Bullish",
        "sentiment": {
            "TextBlob": 0.08617216117216117,
            "NLTK": 0.8338,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9918577075004578
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-04-21T21:22:21Z",
        "content": "$FCNCA   Arrogant shorts got totally annihilated on this one trying to short from $500s all the way to $800s and higher LOL! Bullish",
        "sentiment": {
            "TextBlob": 0.3125,
            "NLTK": 0.1593,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9993429780006409
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-04-21T20:25:59Z",
        "content": "$FRCB Strictly looking at charts, no resistance until $20. Minor resistance at $32, $49, $75, and then $99. If FRC shows deposit outflows have stabilized as data from the Feds are confirming, and coupled with Feds pausing rate hike next month, we can easily see the share price hit these levels, which translate to hundreds percentages of gain. Good luck guys. Truly a buy of a lifetime. \n \nX marks the spot of highly probable technical bounces on the Fibonacci lines. Bullish",
        "sentiment": {
            "TextBlob": 0.2072222222222222,
            "NLTK": 0.9274,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.973292887210846
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-04-21T20:13:08Z",
        "content": "@Twock_Stats  \nShorting $FRCB now is like shorting the market since October lows.  While most bears haven't admitted to losing a ton of money this year, a few have already done so, but only a few learned their lessons.  Either you need to learn from your mistakes, or end up broke and bitter and leave the stock market for decades, before stepping back in or forever. Bullish",
        "sentiment": {
            "TextBlob": -4.625929269271485e-18,
            "NLTK": -0.883,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9994086027145386
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-04-21T16:22:22Z",
        "content": "$FRCB \nThis stock already dropped -90%. FDIC didn't shut it down a month ago because things aren't as bad as shorts trying to FUD made it out to be. Bad news already baked in. After earnings, there's only one direction it can go, especially with Feds pausing after May meeting.\n\nIf you're afraid what's to come, sell covered calls further out in expiration, much higher up, like $30-40 strikes in late December or 2024, and buy puts expiring next week slightly below or at the money with those proceeds.\n\nShould the stock rally hard, you'll get MASSIVE gains, but capped at your covered call strikes, and limited loss on the puts.\n\nIf it tanks hard, you gain from the covered calls premium AND after you close your covered calls for cheap, you can sell your shares at those put strikes by exercising the puts. Either you lose a little, or you make MASSIVE gains. Bullish",
        "sentiment": {
            "TextBlob": -0.1563602292768959,
            "NLTK": -0.7345,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9986706972122192
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-04-20T14:22:11Z",
        "content": "$QQQ $SPY $TQQQ $TNA $SPYD \n\nYou know the drill, dump short positions and covered calls at any cost on these manipulated selloffs before big money finishes unloading their puts and short positions and finish loading long shares and calls and then let's it rip. Bullish",
        "sentiment": {
            "TextBlob": -0.0125,
            "NLTK": -0.4588,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9997345805168152
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-04-19T14:34:18Z",
        "content": "$QQQ $SPY $TQQQ $SPYD $TNA \n\nMajor wealth transfer happening as we speak.  The market is a tool in which the patient robs the impatient blind, legally. Bullish",
        "sentiment": {
            "TextBlob": -0.10937499999999999,
            "NLTK": -0.5106,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9973021745681763
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-04-13T16:36:52Z",
        "content": "$SPY $UPRO $TQQQ $QQQ $SPYD  \n \nTried to warn short clowns. Bullish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": -0.1027,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9994140863418579
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-04-12T02:49:33Z",
        "content": "$QQQ $SPY $TQQQ $SPYD $UPRO  \n \nI predicted new 2023 highs by late April/early May, and new all time highs by early/mid 2024.  Article:  An incredibly rare bullish stock market indicator just flashed for the first time since 2019, suggesting that the 18% rally in the S&P 500 that started in mid-October has more fuel to continue higher. \n \nThe last time the Zweig Thrust Indicator triggered was in early 2019. Before then, the indicator flashed in October 2015, October 2013, October 2011, and March 2009, just two weeks after the S&P 500 hit its generational low during the Great Financial Crisis. \n \n\"It has only happened 14 other time since 1950 and the S&P 500 was higher a year later every single time,\" Detrick said, adding that both the average and the median forward one-year return was 23%. Meanwhile, the six-month forward average return after the Zweig Thrust Indicator triggered is 17%. \n \nfinance.yahoo.com/news/incr... Bullish",
        "sentiment": {
            "TextBlob": 0.10138414217361587,
            "NLTK": -0.2732,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9973692893981934
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-04-11T06:01:48Z",
        "content": "$QQQ $SPY $TQQQ $SPYD $NASDAQ  \n \nThe market bounced off support on the bottom trading range of this Uptrend Channel.  Ready to rocket to new 2023 highs. Bullish",
        "sentiment": {
            "TextBlob": 0.16818181818181818,
            "NLTK": 0.6369,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9984943866729736
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-04-10T21:33:40Z",
        "content": "$QQQ \nShorts this year got completely annihilated trying to short the Nasdaq 😂 Bullish",
        "sentiment": {
            "TextBlob": 0.05,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9996026158332825
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-04-04T09:24:39Z",
        "content": "$VORBQ  \nSo... I was watching Deal or No Deal the other day. Some dude had $1 and $1 million left. The bank offered him like $416K. His mom told him to take the deal, \"Don't be greedy. Take the money...\" His other family members egged his gambling on to not take the deal and said really dumb superstitious things about the case numbers, totally unscientific, nothing to do with mathematical probabilities. He was so confident he had the million that he said no deal. He ended up with $1. UNNNN-FFRIGGGGGGGGEENNN-REAL!  Although, he did get the banker's $10K challenge, which I'm sure he felt like dirt losing the $416K. \n \nContestant's name was Richie Bell, Season 4 Episode 7. \n \nDump on any chance you get.  Get out with SOMETHING instead of NOTHING.  At best, this is worth 4 pennies.  At worst, it's worth zero because of all the closing costs to shut down the company. Bearish",
        "sentiment": {
            "TextBlob": 0.07264957264957266,
            "NLTK": -0.7073,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.999402642250061
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-04-04T09:22:48Z",
        "content": "$VORBQ OK, let's do some basic math guys. Per their quarterly report as of September, 2022, their balance sheet showed total assets of $243 million, and total liabilities of $153.5 million, for a net common stock equity of $89.5 million. Their quarterly reports from March, June and September of 2022 showed losses of -$62.6 million, -$33.3 million, -$43.6 million, respectively. So assuming they lost an average (of the last two quarters) of -$38 million for Q4 2022 and Q1 2023, they'd be down to: \n \n$89.5 - ($38 x 2) = $13.5 million left in total assets, minus all liabilities. With 337.01 million shares outstanding, that works out to be: \n \n4 cents per share \n \n(1 of 2) Bearish",
        "sentiment": {
            "TextBlob": 0.02103174603174603,
            "NLTK": 0.8058,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9988607168197632
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-04-04T05:11:18Z",
        "content": "$SPY $SQQQ $TQQQ $QQQ $SPYD  \nThe Nasdaq is up 5% since I posted this prediction.  The REAL chart vs the PREDICTED chart.  Friggen eerily VERY SIMILAR, right?  LoL, simply go through my post history and see how spot on I am guys.  I already predicted months ago the market will make new 2023 highs in late April/early May, sell back for some profit taking into mid June, and rally even harder into July.  New all time highs by early/mid 2024 my friends.  Are you in it to win it?  I am, which is why I'm up 400% YTD. Bullish",
        "sentiment": {
            "TextBlob": 0.1632034632034632,
            "NLTK": 0.9311,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.8839687705039978
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-04-04T03:35:25Z",
        "content": "$SPY $QQQ $TQQQ $SQQQ $SPYD  \nShorts once again trapped today for those who shorted today and Friday LoL.  Some people just never learn.  April and July going to decimate bears.  But what's worse is by the time the new all time highs get here in early/mid 2024, they'll be dead broke and can't even FOMO chase at the all time highs.  Keep digging. Bullish",
        "sentiment": {
            "TextBlob": 0.027272727272727282,
            "NLTK": -0.9442,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9995667338371277
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-04-03T14:37:07Z",
        "content": "$SPY $QQQ $TQQQ $SPYD $SQQQ  \n \nFrom Nerdwallet article: \"Since 1928, the S&P 500 has had an average monthly gain of 1.4% for April, according to an analysis by Yardeni Research. That makes April the second-best month for the index in that period, with July taking the lead at 1.7%. \n \nIf we move our starting point to 1941, then July falls back and April remains the S&P 500’s strongest month, with a 1.7% average gain, according to CNBC. Every other month in that period averages around 0.7%. \n \nNarrowing the frame even further, we’ll see that April has been the strongest performing month since 2002 and the second-strongest since 2012, according to LPL research from last March.\" \n \nnerdwallet.com/article/inve.... Bullish",
        "sentiment": {
            "TextBlob": -0.060714285714285714,
            "NLTK": 0.9118,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.7610171437263489
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-04-02T18:05:43Z",
        "content": "$SPY $QQQ $TQQQ $SPYD $BTC.X \n\nLots of bashing and smack talk here, but everyone wants to make money.  Or at least that should be your goal.  Here's my YTD returns.  I don't gamble.  I do methodical high risk/high rewards trades, with no 0DTE options.  I do utilize mid and longer term options though.\n\n What are y'all YTD returns?  If you can't beat the S&P 500, don't feel embarrassed.  Most people like 75% can't. Most professional fund managers can't either.   And most traders (as high as 99%) especially can't. \n\nLet's discuss how to beat the S&P the \"guaranteed ways\" or high probability way.  The only thing you got to lose is your pride and poorness and your entire future to gain.  Those with open minds will be winners in life.  Oh, and learning to read charts is absolutely critical!  It is the BEST SKILL to teach yourself regardless if you're a trader or investor.  Charts aren't for traders only. Bullish",
        "sentiment": {
            "TextBlob": 0.16555555555555557,
            "NLTK": 0.9687,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9851941466331482
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-04-01T21:46:39Z",
        "content": "$SPY $QQQ $SQQQ $TQQQ $SPYD \n\nWhat happened to the Q4 2022 recession?  The Q1 2023 recession?  The Q2 2023 recession?  Now it's Q3 2023 recession???? Let me guess... soon it'll be pushed out to Q4 2023 recession and then Q1 2024????\n\nA recession by definition is when there's mass layoffs, leading to lowered GDP.  Can someone answer me definitively how there can be a recession when there are millions of job openings more than those who need work, meaning employers NEED their employees and CANNOT AFFORD to mass layoff enough people to trigger this mysterious recession that's eluding us WHILE inflation continues to trend down and Feds are about to pause rate hikes?  C'mon, try your best.  So far no one's been able to explain the logic of how a recession, given current economic trends, would be possible.  \n\nEven the father of the yield curve, the dude who discovered it, says his yield curve inversion tool is dead wrong this time, that there won't be a recession. Dude himself said it. Bullish",
        "sentiment": {
            "TextBlob": 0.1203703703703704,
            "NLTK": -0.9839,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9995841383934021
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-03-31T19:59:27Z",
        "content": "$SPY $QQQ $TQQQ $SQQQ $SPYD  \nLLLLLMMMMFFFAAAAOO!!!!!!!!!  I'm loving this.  Each dump gets panic bought/covered and goes even higher!  Wait until April's rally gets here.  And then wait until new all time highs get here in early/mid 2024.  Bears will be crying manipulation, dead broke, bitter and bankrupt. Bullish",
        "sentiment": {
            "TextBlob": 0.09147727272727274,
            "NLTK": -0.9681,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.7265701293945312
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-03-31T18:10:47Z",
        "content": "$SPY $QQQ $SQQQ $TQQQ $SPYD \n\nUh oh.  Shorts are in big, big trouble.  Market to rally huge in April. Bullish",
        "sentiment": {
            "TextBlob": 0.05000000000000002,
            "NLTK": -0.1027,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9976499676704407
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-03-31T17:28:21Z",
        "content": "$SPY $QQQ $SQQQ $TQQQ $SPYD  \n \nYou perma bears realize the market will be rallying all of April, right?  It's not like you weren't warned.  I already predicted this and warned well over a month ago we'd drop to the 50% retrace level to at least (meaning lower than) 11,200s on the Nasdaq and 3,900s on the S&P and that happened EXACTLY as I predicted, and then predicted we'd be making new 2023 highs in April which will start a run-up mid or late March.  You clowns could have made so much money simply listening to my expert calls.  But perma bears chose to lose money shorting the new multi-year bull mark that started in October LOL!!!!!!!!!!!!!!!  Can't make this shit up.  \n \nOnce we breach Feb 2 highs, the market will be in even bigger fully on rally mode as AI algos kick in, fund managers and weak sideline longs FOMO chase with bears panic covering at MASSIVE losses.  Smart longs already positioned long will be laughing all the way to the bank. Bullish",
        "sentiment": {
            "TextBlob": 0.062357954545454536,
            "NLTK": -0.9512,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9899043440818787
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-03-31T14:02:44Z",
        "content": "$SPY $QQQ $SQQQ $TQQQ $SPYD \n\nPanic selling is so last year.  This year, panic buying is all the rage.  Just ask the shorts.  They can confirm it. Bullish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": -0.8807,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9943607449531555
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-03-31T13:43:56Z",
        "content": "$SPY $QQQ $SQQQ $TQQQ $SPYD \n\nImagine losing your entire life savings shorting the SECOND best stock market recovery in US history (clear back to 1929). And this is for the S&P.  The Nasdaq completely wiped out all bears.  Probably the BEST RECOVERY in history for the Nasdaq.  Lllmmmmffaao!!!!!!11!!!!1!!! Perma bears aren't too bright.  You got to be one dumb mother freaker to go bankrupt shorting a new multi-year bull market that started in October.  LOLOLOLOL!!!!!!!! Bullish",
        "sentiment": {
            "TextBlob": 0.3337790610573509,
            "NLTK": -0.448,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9984080195426941
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-03-31T00:36:13Z",
        "content": "$SPY $QQQ $SQQQ $TQQQ $SPYD \n\nBloomberg reported market did second biggest recovery in history, SINCE 1929! You clowns are shorting one of the best years in fucking history! Lllmmmmffaao!!!!  Shorts all trapped with zero chance to cover, except at massive losses. The longer short clowns wait, the bigger the losses.\n\nThe Nasdaq broke out from a bearish Falling Broadening Wedge on March 21. It's why it's now pushing for new highs. The S&P did the same March 28. This formation ALWAYS happens during bear markets/big corrections and ALWAYS end the same: a breach upside and rallying to new ATHs.\n\nNew 2023 highs in late April/early May as previously predicted months in advance after riding Jan rally to Feb 2, selling + shorting from Feb 2 highs down to 50% retrace level at Nasdaq 11,200s and S&P 3,900 (predicted 1 month earlier), and riding it back up. Only a real expert chart reader and trader could have predicted it spot flipn' on in advance.\n\nNew all time highs in early/mid 2024. Bullish",
        "sentiment": {
            "TextBlob": -0.003838383838383838,
            "NLTK": -0.8002,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9975650310516357
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-03-29T18:05:51Z",
        "content": "$SPY $SQQQ $QQQ $TQQQ $SPYD \n\nThe world is coming to an end, sell all your stocks and bonds!!!!  Quick guys, we need some black swan, WW3, Taiwan invasion, banks and/or US Treasuries collapsing worldwide, debt ceiling fight, Trump induced US civil war, another Great Depression scare, modern civilization-destroying solar flares, an approaching stellar black hole, an undiscovered asteroid, SOMETHING, ANYTHING to scare each other silly so puts can be salvaged. Spread the word.  What bad things can happen??? Bearish",
        "sentiment": {
            "TextBlob": -0.007499999999999984,
            "NLTK": -0.9657,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9984908103942871
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-03-29T14:09:02Z",
        "content": "$SPY $QQQ $SQQQ $TQQQ $SPYD \n\nI told you clowns to quit scaring yourselves silly. Banking crisis is over because only a few poorly mismanaged banks went kaputz, like bear puts. Best times to buy is when silly bears sit around the campfire and scare themselves silly with ghost stories. Now they're all trapped with zero chance to cover, except at massive losses. The longer these clowns wait, the bigger the losses. New 2023 highs in late April as previously predicted months ago after riding 2023 Jan rally to Feb 2, selling and then shorting from Feb 2 highs down to the 50% retrace level at Nasdaq 11,200s and S&P 3,900 in earlier March, and riding it back up. Only a real expert chart reader and trader could have predicted it spot flipn' on in advance. Bullish",
        "sentiment": {
            "TextBlob": -0.08810325476992145,
            "NLTK": -0.9062,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9987403750419617
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-03-27T17:06:38Z",
        "content": "$SPY $SPYD $UPRO $SPXL $SPX \n\nReverse head and shoulders on the 1 day chart. Intraday low is in. Bullish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": -0.2732,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9994485974311829
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-03-27T13:25:46Z",
        "content": "$SPY $SQQQ $TQQQ $QQQ $SPYD \n\nThere is no bank crisis. Credit Suisse was poorly managed for decades and losing money. SVB was catering to a specific sector, like putting all your money into a single stock. The only crisis is shorts' portfolios with the market heading to new all time highs by early 2024. That'll be hilarious if shorts were the next crisis, causing a melt up. Since they don't really hold long term assets, there won't be a melt down when their short positions get liquidated. Bullish",
        "sentiment": {
            "TextBlob": 0.021614959114959115,
            "NLTK": -0.8625,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9983816146850586
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-03-27T04:25:04Z",
        "content": "$SPY $QQQ $SQQQ $TQQQ $SPYD \n\nAs the market continues back to 2023 highs, 5 months after October lows, which we won't see again, clowns still debating non-sense daily while missing out on making huge returns with the market recovering.  This was the worst the Feds were able to do.  Bright times ahead, folks.  This is how so many people want to buy the 2009, 2018 and 2020 lows, but few actually do because they're scaring themselves silly.  Scaring one's self silly is not a legitimate investment strategy. Fact stranger than fiction.  Can't make this stuff up.  No wonder most people can't even beat the S&P 500.  Lllmmmmffaao!!!!11!!!1!!\n\n.\n\nEven when the new all time highs get here in 2024, clowns still be claiming it's a bear market rally.  Clowns claimed recession would be here late 2022, and then Q1 2023, then Q2 2023.  Recession just keeps getting pushed back.  How there going to be a recession with massive layoffs when employers NEED their employees desperately???  Still waiting\n.. Bullish",
        "sentiment": {
            "TextBlob": -0.015688131313131303,
            "NLTK": -0.9826,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.999518871307373
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-03-26T23:40:56Z",
        "content": "$SQQQ $TQQQ $SQQQ $SPY $SPYD \n\n52 week lows approaching for SQQQ. Free fall once $30s break support (ie Nasdaq makes a new 2023 high surpassing Feb 2 highs). Nasdaq broke out of the Falling Broadening Wedge on Tues, March 21 and will continue to new highs this year and drag the S&P like SPY and SPDR up. The charts do not lie. If you studied charts during corrections and bear markets, you will see all of them literally do these Falling Broadening Wedge formations. They end up all the same: the market breaks out of the formation and recovers. Every. Time. Without. Fail.\n\n.\n\nThe huge 1 year Falling Broadening Wedge formation in 2022 was breached to the upside in October for SPY and QQQ. That's how I knew the bottom was in. Don't say you weren't warned folks. I try to help everyone, but if you don't listen, that's on you. I can drag a dying cow to the water, but I can't make the dying cow drink to save its life. Bullish",
        "sentiment": {
            "TextBlob": 0.022171717171717186,
            "NLTK": 0.6957,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9937782287597656
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-03-25T23:28:26Z",
        "content": "$SPY $QQQ $SQQQ $TQQQ $SPYD \n\nBank scare non-sense is over.\n\n-U.S. reportedly considers more support for banks while giving First Republic time to shore up balance sheet\n\n-Deposit drain from smaller banks into financial giants like JPMorgan Chase has slowed, sources say\n\nImagine losing your life savings shorting the new multi-year bull market that started in October. Bullish",
        "sentiment": {
            "TextBlob": 0.17727272727272728,
            "NLTK": 0.2716,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9996634721755981
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-03-24T20:22:28Z",
        "content": "$SPY $QQQ $TQQQ $SQQQ $SPYD \nWho bought puts today to short the market??? Your puts went kaputz!  New 2023 highs in late April, new ALL TIME HIGHS in early/mid 2024.  Enjoy losing your entire life savings shorting from the new multi-year bull market that started in October. Bullish",
        "sentiment": {
            "TextBlob": 0.07272727272727272,
            "NLTK": 0.3468,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9996521472930908
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-03-24T15:06:00Z",
        "content": "$SPY $TQQQ $SQQQ $QQQ $SPYD \n\nThis is NDX, Nasdaq 100 (100 top tech stocks), aka QQQ.  The S&P and Nasdaq composite (2,000+ tech stocks) both had similar formations.  It shows a huge 1 year Falling Broadening Wedge, just like the one from Feb 2 to now that the Nasdaq broke out of just this past Tuesday (see my post history).  This same formation happened during the pandemic 2020 crash too.  After this formation completes, the market always rallies up. \n\nThis is how I knew the market bottoms were in.  Google \"Falling Broadening Wedge\".  Feds tightening cycle is over.  That was the worst the Feds were able to do.  Best times to buy are the bottoms when everyone's panic selling.  Now is the time to panic buy, not panic sell.  That's why most people miss out there massive recoveries since October, 2009, 2018 Trump Tariff Crash, 2020 pandemic crash etc.  The charts do not lie. Bullish",
        "sentiment": {
            "TextBlob": 0.165,
            "NLTK": -0.953,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9974314570426941
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-03-24T14:52:16Z",
        "content": "$SPY $QQQ $TQQQ $SQQQ $SPYD \n\nBe warned, the Nasdaq broke out of the Falling Broadening Wedge I mentioned last month. The top resistance line formed on Feb 2 highs and the Nasdaq broke out of it just days ago this Tuesday, March 21. It's made a beeline up from the resistance line as expected with such a chart formation. That's why TQQQ is near it's $27+ Feb 2 level and SQQQ near its 52 week lows with a year long bearish head and shoulders formation. \n\nThe Nasdaq sold off the most from rising rates. It will rally the most from Feds pausing and lead the other indices back up to new ATHs. The other indices are currently sold off because of this bank non-sense scare, which will pass. There won't be a recession because of the tight labor market. Employers NEED their employees and cannot afford to lay them off en masse. Can't have a recession without massive layoffs.  Even the father of the yield curve, the guy who discovered the yield curve inversion says his tool is wrong this time. Bullish",
        "sentiment": {
            "TextBlob": 0.044576012223071025,
            "NLTK": -0.8731,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9976211190223694
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-03-22T14:30:12Z",
        "content": "$FRCB I went through their financials.  They have a great increasing year over year revenue and profit history, unlike Credit Suisse, which was negative from years of poor mismanagement.  If they can stave off bank runs and NOT dilute, time will prove this puppy goes back above $100. Bullish",
        "sentiment": {
            "TextBlob": 0.019999999999999997,
            "NLTK": 0.4215,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.8027551174163818
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-03-22T14:12:10Z",
        "content": "$FRCB only minor resistance to $25.  No resistance to $80!!!!   I'm up 469% YTD trading market volatility, so I should know.  ;) Bullish",
        "sentiment": {
            "TextBlob": 0.042643229166666664,
            "NLTK": -0.2969,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9984765648841858
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-03-22T14:10:25Z",
        "content": "$FRCB \n\nMASSIVE UPTREND CHANNEL forming!!!!   Over $25 by Friday most likely. Bullish",
        "sentiment": {
            "TextBlob": 0.16666666666666666,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9991685152053833
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-03-22T12:49:18Z",
        "content": "$SPY $QQQ $TQQQ $SQQQ $SPYD \n\nWow I'm up 469% YTD as of yesterday's close.  Can't wait for new 2023 highs in late April.  Totally going to get 1,000%+ this year trading this volatility, up or down! Bullish",
        "sentiment": {
            "TextBlob": -0.05161616161616163,
            "NLTK": 0.6239,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9933986663818359
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-03-21T13:25:39Z",
        "content": "$SPY $QQQ $SQQQ $SPYD $TQQQ \n\nShorts and perma bears continue to get a beating they deserve (for not listening even after being warned repeatedly).  I'm amazed how you guys keep coming back for more beatings and keep losing all your money.  This will be fun with a MASSIVE rally imminent followed by new all time highs in early 2024.  Got my TNA and TQQQ calls all ready, as well as UVXY puts.  Heck, I even managed to get some calls for FRC when it hit the $12s yesterday after buying some at $12.50 and selling at $17.  Leaving the rest to ride LoL!!! Bullish",
        "sentiment": {
            "TextBlob": 0.27954545454545454,
            "NLTK": 0.795,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.8898681402206421
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-03-20T14:26:27Z",
        "content": "$TNA \nBought a bunch of July $36 strike calls adding to last week's when TNA was in the $28s.  Going go $40s next month guys. Bullish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": -0.128,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9980806112289429
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-03-20T01:38:04Z",
        "content": "$SPY  \n \nLast time there was a backstop of depositors by the FDIC, futures rallied 2%, went negative in the morning, then recovered.  I think futures buyers are wary of something like that happening again so they're cautious this time.  However, at open, we should see everyone and their second cousins panic buy.  After Fed decision markets should continue rallying and then next week it'll be earnings run-up hype into April with new 2023 highs.  The Nasdaq recovered extremely well last week.  No big news outlet talked about it, but the Nasdaq basically recovered almost all it's 2023 gains back while the DOW, Russell 2000 lost its gains. The S&P barely stayed green for the year, but also means non-tech indices, especially the Russell 2000 should lead the way back up this week.  That means $TNA will fly hard, $UPRO and $UDOW second, and $TQQQ possibly last.  Although, if Feds are dovish with their dot plot, tech has fallen the most over past year so it can still lead. Bullish",
        "sentiment": {
            "TextBlob": -0.008585858585858589,
            "NLTK": -0.5563,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.994208574295044
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-03-19T22:52:02Z",
        "content": "$SPY $QQQ $TQQQ $SQQQ $SPYD \n\nBank crisis over. Futures rocking. Shorts dead. You perma shorts are really slow. There can't be a recession because employers don't have enough workers. They CAN'T AFFORD to do mass layoffs LoL!!!! Inflation is headed down and banks are being supported by governments. You clowns will never learn. Enjoy shorting all the way to the new all time highs in 2024.  I already covered my Thursday right-before-market-close short Friday morning for a massive gain and went back long for a gain back up. That's why I'm up 439% YTD as of Friday's close and you clowns can't even beat the S&P 500's 10% per year. After Monday, I'll be up well over 500% if the market rallies hard. Lllmmmmffaao!!!!!!11!!!!1!!!\n\nSo easy to make money it should be illegal!!! Bullish",
        "sentiment": {
            "TextBlob": -0.01880550294612796,
            "NLTK": -0.3551,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9991422891616821
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-03-19T20:56:36Z",
        "content": "$SPY $QQQ $TQQQ $SQQQ $SPYD \n\nTheoretical question. If I start a trading company, are you interested in throwing your money in? I won't charge you a fee to join, or some percentage of your total like others. I'll just take 50% of the profit. If no profit, you pay nada, zero, zilch. Of course, I can't guarantee profits so... Bullish",
        "sentiment": {
            "TextBlob": 0.08333333333333333,
            "NLTK": 0.7546,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9990907907485962
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-03-19T05:07:45Z",
        "content": "$BTC.X $BITO $GBTC  \n \nBitcoin does these 1,000%+ runs and 85-90% crash cycles.  I had expected it to crash to $7K before recovering as I was able to predict a year in advance the $3.5K bottom last time, but it recovered around $15.5K this time.  It's possible this is a dead cat bounce to the 50% retrace level at $41.5K as Bitcoin has always done these retraces, but it never did a dead cat bounce this time, possibly due to the inflation/Fed rate hike scare in 2022.  We have two scenarios:  \n  \n1. If this is a dead cat bounce, it'll head to at least $41.5K before trapped longs (circled in red) start dumping.  That's where resistance (old support level) is at.   At minimum, I'd shoot for this before dumping. \n  \n2. If this rally from the $15.5K base is real, this means it can easily go to $155-$200K (1,000%+) before crashing back down again 85-90% before the next cycle.  \n  \nAs such, I've bought BITO calls expiring 2024 and already up 71% on my calls. Bullish",
        "sentiment": {
            "TextBlob": -0.05511695906432749,
            "NLTK": -0.988,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9990720748901367
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-03-19T00:19:47Z",
        "content": "$SPY $QQQ $TQQQ $SQQQ $SPYD  \n \nLOL even Michael Burry thinks the bottom is near. But what he's really saying is the bottom was already back in October/December, depending on which index you're looking at. You clowns still going to hold this until you're dead broke? And big bear Jeremy Grantham thinks market will continue to go up through April (exactly as I predicted) and limited downside this year. Your big bear heroes are closing their shorts for massive losses since October lows and going long, but you perma bear clowns intend on bag holding worthless puts until you're dead broke? LOL!!!!!!!!!!!!!!! That's why most of you guys can't even beat the S&P 500!  I bet some are negative for the year too! Bullish",
        "sentiment": {
            "TextBlob": 0.0799107142857143,
            "NLTK": -0.9888,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9993646740913391
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-03-18T01:39:57Z",
        "content": "$SPY $TQQQ $SQQQ $QQQ $SPYD  \n \nSo what's ya'll YTD returns look like so far?  Here's mine.  Fidelity hasn't updated today's numbers yet.  Tomorrow, I'll post what it is.  I should be well over 400% YTD after today. Bullish",
        "sentiment": {
            "TextBlob": 0.1,
            "NLTK": 0.5574,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9987847208976746
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-03-16T15:24:52Z",
        "content": "$SPY $QQQ $TQQQ $SQQQ $SPYD \n\n-No bank contagion, only linked to a few banks, and world governments stepping up to help.\n\n-SVB collapse spooked businesses into stopping Excuseflation where corporate greed simply raises prices because they know they can get away with it.\n\n-Oil dropping, and new huge refineries coming online in 2023, lowering diesel and gas prices.\n\n-PPI came in so low it was off the charts to the downside.\n\n-Feds don't want to break something. With inflation down, they'll only hike 25 bps at most.\n\n-Finally, we're at the bottom of an uptrend channel from October/December tax loss selling, meaning only up from here and a MASSIVE rally into April and May earnings hype.\n\n-This is why I'm well over 400% YTD returns, because I take the real picture into consideration and make money in any and all directions while most people can't even beat the S&P 500 LoL!!!! Bullish",
        "sentiment": {
            "TextBlob": 0.14880050505050507,
            "NLTK": -0.9329,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9991657733917236
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-03-15T15:20:53Z",
        "content": "$SPY $QQQ $TQQQ $SQQQ $SPYD \n\nBig funds just messing around today with the fear so they can load up calls and shares for cheap.  Play along, or you'll be extreme short bag holders. Bullish",
        "sentiment": {
            "TextBlob": 0.06875,
            "NLTK": 0.1027,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9995848536491394
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-03-15T06:06:23Z",
        "content": "@StellaArtois  \nI even transferred some to my play Robinhood account and made some nice returns on $FRCB Bullish",
        "sentiment": {
            "TextBlob": 0.6,
            "NLTK": 0.6369,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9909239411354065
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-03-15T05:52:50Z",
        "content": "$SPY $QQQ $TQQQ $SQQQ $SPYD  \n \nSPOT FUCKING ON.  It's as if I'm a space-time traveler from the future, a Tradernator, sent back to help you poor saps.  LOL! \n \nWanna know what happens next?  I'll give you a hint:  Shorts will be slaughtered next month. \n \nOh and BTW, it is space-time traveler, not time traveler.  Space and time are inseparable, like the Darklord and the One Ring. Bullish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.7118,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.995192289352417
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-03-15T05:26:28Z",
        "content": "$QQQ $SPYD  \n \nGuys, I ran the numbers and did the chart analysis.  I don't have any good news for $SQQQ holders.  The charts predict free fall starts around $30-$31 and will drop into the mid to low $20s, probably $22 likely by late April/early May.  I don't seldom give dire warnings unless I truly expect it to come.  Good luck holding if you're going to bag hold this.  $TQQQ on the other hand should head to the low $30s, most likely the $32 area.  $SPY should hit the $430s. Bullish",
        "sentiment": {
            "TextBlob": 0.17045454545454544,
            "NLTK": 0.8119,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9996416568756104
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-03-14T20:15:35Z",
        "content": "$SPY $QQQ $SQQQ $TQQQ $SPYD \n\nI was sooooo tired of WINNING I even took a 3 hour nap, woke up just in time to see intraday swing to the lower bound buying range of the uptrend channel Nasdaq at +1% that I sold my shares for a profit and bought calls with the proceeds to gain on well over 1%+ gains of normal Nasdaq move on my calls, which gave me a further like 15-20% compounded gains. Expert trader in the hiiissoouuse!!!!!!11!!!1!!!!\n\nBears DESTROYED.  Completely and utterly DESTROYED!  Best part, we're still in the lower ranges of a YUUUGGGEE uptrend channel.  More gains to come through to late April, possibly mid May. Bullish",
        "sentiment": {
            "TextBlob": 0.155,
            "NLTK": 0.9314,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9992163181304932
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-03-14T14:19:30Z",
        "content": "$SPY $QQQ $TQQQ $SQQQ $SPYD \n\nInflation trending down as expected, SVB collapse stabilized with the government backstopping deposits, and Feds not interested in creating a crisis and high probability they'll only continue slowly 25 bps or lower rates hikes, market should recover. Charts can still be repaired if still close to support. Late April/May 2023 highs still possible. Bullish",
        "sentiment": {
            "TextBlob": -0.10256944444444446,
            "NLTK": -0.8734,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9967149496078491
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-03-14T05:24:26Z",
        "content": "$FRCB \n\nGot some call debit spreads when this puppy hit the sub $20s.  Easiest money making opportunity since I shorted $TSLA to the $100s LMAO!   Bloomberg:\n\nAs the fallout from Silicon Valley Bank’s collapse continues to unfold, investor Michael Burry thinks the crisis could resolve “very quickly.”\n\n“I am not seeing any true danger here,” Burry, who runs Scion Asset Management, said in a tweet Monday night. Bullish",
        "sentiment": {
            "TextBlob": 0.29444444444444445,
            "NLTK": 0.3804,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9988729357719421
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-03-14T05:17:40Z",
        "content": "$SPY $QQQ $TQQQ $SQQQ $SPYD \n\nAs the fallout from Silicon Valley Bank’s collapse continues to unfold, investor Michael Burry thinks the crisis could resolve “very quickly.”\n\n“I am not seeing any true danger here,” Burry, who runs Scion Asset Management, said in a tweet Monday night. Bullish",
        "sentiment": {
            "TextBlob": 0.06666666666666665,
            "NLTK": -0.8373,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9988675117492676
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-03-13T15:23:42Z",
        "content": "$SPY $QQQ $TQQQ $SQQQ $SPYD  \n \nEver heard of \"Don't fight the Feds?\"  Well this is \"Don't fight the F*ckn' United States of American government\".  LOL!!!!!!!!!!!!!!!!!!!!11!!!!!!1!!!!!! Bullish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.8568,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.996528685092926
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-03-13T14:36:52Z",
        "content": "$BITO  Something tells me Bitcoin is going to hit $30K or even $40K before the year is over.  Just a hunch. Bullish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9996970891952515
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-03-13T14:12:43Z",
        "content": "$SPY $QQQ $TQQQ $SQQQ $SPYD  \n \nI have an admission to make.  I shorted on Friday and panic covered when the Nasdaq hit -1.30% this morning LMAO!!!!!!!!!!!!!!!!!!  Turned and went back long.  Thank GOD for that opportunity to make some money!  I thought I was dead with last night's futures. Bullish",
        "sentiment": {
            "TextBlob": 0.14750000000000002,
            "NLTK": -0.3889,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9980022311210632
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-03-13T06:33:27Z",
        "content": "$SPY $QQQ $TQQQ $SQQQ $SPYD  \n \nPerma bears vs these United States of America, the greatest country there ever was on the face of this planet.  It's not even a fair fight LLLMMMAAAAOOO!!!! Bullish",
        "sentiment": {
            "TextBlob": 1.0,
            "NLTK": 0.8552,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9992921352386475
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-03-13T02:54:23Z",
        "content": "$SPY $QQQ $SQQQ $TQQQ $SPYD  \n \nPerma bears are dead. Government vs perma bears. The government ALWAYS wins.  ALWAYS.  Ever heard of Don't Fight the Feds?  Well this is Don't Fight the fucking United States of American Government.  Don't do it.  You're still young. Bullish",
        "sentiment": {
            "TextBlob": -0.08,
            "NLTK": 0.7882,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.7730103731155396
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-03-13T02:45:08Z",
        "content": "$SPY $QQQ $SQQQ $TQQQ $SPYD  \nToo big to fucking fail guys.  The government cannot, shall not, will not allow another Great Depression or Great Recession.  They will do anything in their power to step in and help.  My take away from their response to this SVB collapse?  BUY THE FUCKING DIP. Bullish",
        "sentiment": {
            "TextBlob": 0.10000000000000002,
            "NLTK": -0.9508,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9986434578895569
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-03-09T09:15:02Z",
        "content": "$TSLA \nWhat a piece of shit.   This should have warned everyone when the chart was giving a middle finger. Bearish",
        "sentiment": {
            "TextBlob": -0.1,
            "NLTK": -0.5106,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9994675517082214
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-03-09T08:18:04Z",
        "content": "$SPY $QQQ $SQQQ $TQQQ $SPYD  \n \nWatch for the support and resistance lines.  Two converging patterns (a larger Rising Wedge which implies new 2023 highs in August, and a smaller Falling Broadening Wedge, which also implies a rally back up once the formation completes).  Only one will win.  Like highlander, there can only be one.  But both predicts a rally. Bullish",
        "sentiment": {
            "TextBlob": 0.13376623376623378,
            "NLTK": 0.5719,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9976338148117065
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-03-09T08:12:03Z",
        "content": "$SPY $QQQ $SQQQ $TQQQ $SPYD  \n \nOn Weds, the market (with this being specifically the Nasdaq) recovered on the Rising Wedge lower bound uptrend line as expected, something I already predicted.  Jobs Friday and CPI Tuesday going to determine if it breaks above the resistance line (very bullish) or below the support line (very bearish).  Pay very close attention. \n \nIf it goes above the resistance line, then it's new 2023 highs in April/May as I previously predicted.  If it breaks below it, it would be really bad, but charts can still be repaired.  I suspect massive buying will ensue not long after as smart buyers load up.  This 25 bps extra hike is a joke compared to the 75 bps from 2022.  Perma bears be claiming an extra 25 bps is somehow going to usher in a new depression.  Hilarious.  The market recovered last year just fine.  It'll recover from this easily. Bullish",
        "sentiment": {
            "TextBlob": 0.07870243791296425,
            "NLTK": 0.6735,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9685702919960022
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-03-09T06:56:12Z",
        "content": "$SPY $QQQ $SQQQ $TQQQ $SPYD \n\nI'M SO EXCITED!  I can't wait for new 2023 highs in late April/early May, and continued trend up until we make new all time highs in 2024.  Show of hands which playa you'll be:\n\n1. Ride all the way to the top laughing all the way to the bank\n\n2. Watch nervously from the sidelines, missing out of all the gains and only start buying after new all time highs get here again\n\n3. Rage short all the way to the top until you're dead broke. Bullish",
        "sentiment": {
            "TextBlob": 0.10707644628099175,
            "NLTK": -0.347,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9923132061958313
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-03-09T04:51:28Z",
        "content": "$TSLA \n\nThis trash dragged down the market today.  The charts at all levels from the 5 year, 1 year, 6 month, 3 month, 1 month, 5 day, and 1 day all show a nasty ass head and shoulders formation.  Look, it's even giving you the middle finger. Bearish",
        "sentiment": {
            "TextBlob": -0.38518518518518524,
            "NLTK": -0.7096,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9992716908454895
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-03-08T16:53:31Z",
        "content": "$SPY $QQQ $TQQQ $SQQQ $SPYD  \nLots of trapped short bears being made right now. Market is forward looking. Inflation already peaked. Apparently they didn't learn their lessons after the October and tax loss selling December lows.  They're intent on losing all their money LoL!!!!  Amazing.  Some people should not be allowed near the stock market for their own financial safety. Bullish",
        "sentiment": {
            "TextBlob": 0.2706349206349207,
            "NLTK": -0.5673,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9699367880821228
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-03-08T16:15:24Z",
        "content": "$SPY $QQQ $TQQQ $SQQQ $SPYD  \n \nFed scare is over.  Nothing like it was in 2022.  We're at the bottom of an uptrend channel.  Time to load up or cry later losing money shorting.  Inflation is trending down regardless of what we see this few months.  Gas and diesel expected to drop like a rock in 2023 and 2024 from huge global refineries coming online in late 2022, and 2023 in the Middle East, SE Asia and Africa.  If you study charts from groceries and restaurants, health care costs, rent and housing data, plane ticket prices over the past year etc., you will see they are ALL going down.  Don't say you weren't warned.  The market will still head to all time highs in early/mid 2024 as the charts all predict. \n \nWhat's worse than missing out on the 2022 lows and 2023 uptrend channel lows as a weak sideline long who then FOMO buys at the new all time highs?  Shorting from the bottom up until you're broke, bitter and bankrupt once the all time highs get here and having nothing to show for. Bullish",
        "sentiment": {
            "TextBlob": -0.10935921717171718,
            "NLTK": -0.9774,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9995831847190857
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-03-08T08:03:11Z",
        "content": "$SPY $QQQ $TQQQ $SQQQ $SPYD  \nSo I was thinking, last month's jobs report for January blew everything out of the water with half a million jobs created.  The State of the Union was just days thereafter.  Anyone find it fishy the timing, that maybe the Biden Administration had something to do with it so Biden could tout record job creations during the State of the Union???  In other words, faked numbers?  Just curious what you guys think.",
        "sentiment": {
            "TextBlob": -0.09791666666666665,
            "NLTK": 0.7266,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.999476969242096
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-03-07T16:55:07Z",
        "content": "$SPY $QQQ $TQQQ $SQQQ $SPYD  \n \nPowell's confirming what the father of the yield curve, the dude who discovered it, said, that they don't believe a recession is required to bring inflation under control due to so many job openings/a strong job market. Companies can simply stop hiring, and not have to do firings. This keeps the unemployment rate similar and prevents a recession just like I said.  Plus history says the stock market makes new all time highs AFTER the yield curve inverts and BEFORE recessions actually start, assuming there's even one.  This is a fact.  Almost every single yield curve inversion is followed by the market making new all time highs, and THEN a recession and a real sell off.  I fully expect new all time highs by 2024 before any recessions even remotely happens. Bullish",
        "sentiment": {
            "TextBlob": 0.10383297258297257,
            "NLTK": 0.7903,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9944925308227539
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-03-07T10:45:21Z",
        "content": "$SPY $QQQ $SPYD $TQQQ $SQQQ \n\nHoly smokes!!! Fidelity just updated yesterday's numbers and said my account is up 344.16% YTD after that flawless trade I did yesterday where I rode the bull to +1.10% on the Nasdaq, sold and shorted it back down to 0%.  Expert trader in the hiiissoouuse for realz!!! Bullish",
        "sentiment": {
            "TextBlob": 0.2320601851851852,
            "NLTK": 0.6671,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9966006875038147
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-03-07T09:33:59Z",
        "content": "$COMPQ $SPYD $SPX $SPY  \nChart Breakdown:   Depending on how hawkish or dovish Powell's comments are the next two days when being drilled by Congress, we can expect some possible chart movements like this.  \n  \nJobs report Friday and CPI next Tuesday (1 week from now) could rally or tank the market.  \n  \nI suspect though any bad reports starting with a sell off will be met with a recovery rally.  \n  \nOtherwise, if the sell offs break the Rising Wedge bottom support line, this would signal the formation being destroyed and be very bearish.  I just don't think sentiment is that bad.  \n  \nAll roads lead to an earnings hype run-up rally by April into May before selling off again for a healthy pull back to form a stronger base for the next run-up to 450-460 SPY / 14,500+ on the Nasdaq around September. Bullish",
        "sentiment": {
            "TextBlob": -0.13636363636363635,
            "NLTK": -0.4404,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9992109537124634
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-03-07T09:21:27Z",
        "content": "@andy0323\n$TSLA had an H&S pattern, also known as the middle finger formation.  I don't see the indices showing it though.",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9989457726478577
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-03-07T07:59:26Z",
        "content": "$SPY $QQQ $TQQQ $SQQQ $NASDAQ  \n \nChart Breakdown:   Depending on how hawkish or dovish Powell's comments are the next two days when being drilled by Congress, we can expect some possible chart movements like this. \n \nJobs report Friday and CPI next Tuesday (1 week from now) could rally or tank the market. \n \nI suspect though any bad reports starting with a sell off will be met with a recovery rally. \n \nOtherwise, if the sell offs break the Rising Wedge bottom support line, this would signal the formation being destroyed and be very bearish.  I just don't think sentiment is that bad. \n \nAll roads lead to an earnings hype run-up rally by April into May before selling off again for a healthy pull back to form a stronger base for the next run-up to 450-460 SPY / 14,500+ on the Nasdaq around September. Bullish",
        "sentiment": {
            "TextBlob": -0.13636363636363635,
            "NLTK": -0.4404,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.999334990978241
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-03-07T05:12:28Z",
        "content": "$YINN  \nBought some $59/$60 call debit spreads (aka vertical spreads) for July and a few for April for real cheap.  Should they close in the money, it'll be an easy 250%-375% rate of return. Bullish",
        "sentiment": {
            "TextBlob": 0.27777777777777785,
            "NLTK": 0.4404,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9990088939666748
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-03-07T01:11:26Z",
        "content": "$SPY $QQQ $TQQQ $SQQQ $NASDAQ \n\nWhile you guys were busy insulting and trolling each other, I rode the Nasdaq to +1.1%, immediately sold my calls and long shares and switched to puts and inverse ETFs and gained another +1.1% on the Nasdaq back down to zero for a total of +2.2%  move.  \n\nThe market was flat while I continue compounding MASSIVELY my 300%+ YTD gains.   Some FOMO longs or panicked covering shorts no doubt bought during the intraday highs and lost money today.  That's why most people can't beat the S&P 500.\n\nExpert trader in the hiiissoouuse!!!!!11!!!1!! Bullish",
        "sentiment": {
            "TextBlob": -0.04743055555555555,
            "NLTK": -0.8002,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9996826648712158
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-03-06T19:56:04Z",
        "content": "$SPY $QQQ $TQQQ $SQQQ $NASDAQ  \n \nClosed my short positions here when the Nasdaq is almost 0% gains for the day.  Switching back to TQQQ.  Expert trader in the hiisssoouuussee!!!!11!!!1!!   \n \nAin't no one's ever gone broke taking profits ;) Bullish",
        "sentiment": {
            "TextBlob": 0.0375,
            "NLTK": 0.7333,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9985143542289734
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-03-06T16:00:33Z",
        "content": "$SPY $QQQ $TQQQ $SQQQ $NASDAQ  \n \nNasdaq is hitting a resistance line from a Falling Broadening Wedge pattern I explained weeks ago.  It's almost hitting the trapped long positions at 11,900 as well.  Going to short for a little bit at $35.20s and get some profit going short before switching back to long.  Taking off for a bit.  Have gun guys. \n \nSold most long positions at +1.10% on the Nasdaq today on 3/6.  Switched to mostly shorts (around $35.20 SQQQ) at this point for some profit taking.  Will go back long later in the week. Bearish",
        "sentiment": {
            "TextBlob": 0.031730769230769236,
            "NLTK": 0.1935,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9991143345832825
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-03-06T15:23:10Z",
        "content": "$SPY $QQQ $TQQQ $SQQQ $NASDAQ  \n \nThe Rising Wedge formation (red lines) is still in play.  It bounced off EXACTLY where I predicted it would. \n \nBut there's the smaller Falling Broadening Wedge that's showing selling pressure (purple lines), meaning there's a chance it'll will sell back down for profit taking before rallying. \n \nBut the Falling Broadening Wedge pattern almost always means a massive rally after its formation is complete, meaning the trend to 2023 highs in April as I previously predicted should be attainable. \n \nObviously whatever comes out from Powell's mouth will move markets midweek.  No one can predict what comes from his mouth and how markets will behave.  But longer trend charts are almost always correct. \n \nCharts cannot predict news, so once news comes out and changes chart patterns, charts need to be re-assessed and redrawn.  That's the one thing most people can't seem to grasp.  DUH! Bullish",
        "sentiment": {
            "TextBlob": 0.01388888888888889,
            "NLTK": -0.1635,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9952677488327026
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-03-06T14:50:06Z",
        "content": "$SPY $QQQ $TQQQ $SQQQ $NASDAQ  \n \nTook some long profits when the Nasdaq hit +0.58%.  Going to be range bound for just a little bit.  We'll probably see some profit taking and resistance selling from weak trapped longs.",
        "sentiment": {
            "TextBlob": -0.203125,
            "NLTK": -0.128,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.998393714427948
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-03-05T18:55:52Z",
        "content": "$SPY $QQQ $SQQQ $TQQQ $NASDAQ \n\nThis is why I'm up 300% YTD.  Spot Frickn' on with my predictions, long or short. It's as if I'm a tradernator sent from the future back in time to help investors and traders make some real money.  He/she who so ever believeth in me, shall be rewarded with eternal MASSIVELY compound returns. \n\nTQQQ hit the $20s, SQQQ hit $41 premarket 3/2/23.  Nasdaq bounced off 11,300s during trading hours, but hit 11,200s in premarket at -1% futures.  SPY got real close to 390 premarket.\n\nIf someone tells you no one can time the market, you send them to me.  I'll pound that non-sense out of them.  I now predict the market will make a new 2023 high in April before selling off from profit taking for the next leg up.  New all time highs in early 2024.\n\nDon't be THAT guy/girl who loses your entire life savings perma shorting from the October lows to the new all time highs. Bullish",
        "sentiment": {
            "TextBlob": 0.04793939393939394,
            "NLTK": -0.0387,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9981532692909241
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-03-04T11:24:52Z",
        "content": "$SPY $QQQ $TQQQ $SQQQ $NASDAQ \n\n300% YTD annual returns in just 2 months, baby!  This is the type of returns people hope to get in like 15-20 years.  The truth is most people can't beat the S&P, and most professional fund managers can't either!  Month is negative, I'm up.  Month is positive, I'm up.  That's how true expert traders do it.  Hell yeah!!! Bullish",
        "sentiment": {
            "TextBlob": 0.28931107954545454,
            "NLTK": 0.8002,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.937986433506012
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-03-03T21:26:19Z",
        "content": "$SPY $QQQ $SQQQ $TQQQ $NASDAQ \n\nArrogant short bears the past 2 weeks all got completely destroyed.  Lllmmmmffaao!!!!!11!!!!1!!!  I tried to warn you clowns.  Look at all the desperate shorts hoping and praying for some really bad news to tank the market so their worthless puts can be dumped on others lllmmmmffaao. Jeeeze people, I posted my trades publicly, explained in detail facts and analysis along with charts and explained that I shorted Feb 2 to the 50% retrace and warned you clowns repeatedly I was covering and went back long for the ride back up the April 2023 highs. Why didn't you clowns listen????? I tried to help you all. Amazing. I can't help everyone. I can only help the willing. I should now be up well over 300% YTD. Will need 1 day for broker to properly calculate.  That's like 15-20 years return for the average person LMAO!!!! Bullish",
        "sentiment": {
            "TextBlob": -0.031542968749999956,
            "NLTK": -0.5412,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9979705214500427
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-03-03T17:35:42Z",
        "content": "$SPY $QQQ $SQQQ $TQQQ $NASDAQ \n\nWow, all bears the last week+ all trapped.  Panic covering and FOMO chasing, with bears and weak ass longs stepping over each other soon, at massive losses.\n\nNew 2023 highs soon boys.  Enjoy holding worthless puts.\n\nWhat's worse than being a weak ass sideline long who misses out on the market recovery and FOMO buys for much less shares at the all time highs?  Being a perma short bad timing short who shorts all the way from the October lows to new all time highs and loses their entire life savings Lllmmmmffaao!!!!11!!!!1!!!! Bullish",
        "sentiment": {
            "TextBlob": -0.14310207336523126,
            "NLTK": -0.9817,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9997360110282898
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-03-02T20:16:25Z",
        "content": "$SPY $QQQ $TQQQ $SQQQ $NASDAQ \n\nIt's clear the Feds are going to hike rates slowly from here on out and see how inflation does the next year from a delayed rate hike effect. They're not trying to spook the market. They know inflation is expected to tank hard the second half of 2023 so this buys them time to see how inflation behaves. Stocks are going to rally hard as predicted and hit all time highs be early/mid 2024. Shorts and weak sideline longs are going to regret big time.  Perma bears be broke, bitter and bankrupt shorting from the bear market lows to new all time highs LMAO.\n\nWhat's worse than missing out on the rallies as a weak ass sideline long and FOMO buying after the new all time highs??? Being a short who loses his/her life savings shorting from the October multi-year bull market lows to the new all time highs. Bullish",
        "sentiment": {
            "TextBlob": -0.08766233766233766,
            "NLTK": -0.9764,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.997871994972229
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-03-02T19:13:27Z",
        "content": "$SPY $QQQ $SQQQ $TQQQ $NASDAQ\nbreakingthenews.net/Article... Bullish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9987404942512512
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-03-01T12:46:47Z",
        "content": "$SPY $QQQ $SQQQ $TQQQ $NASDAQ \n\nRemember, BUY THE DIP.  God is giving you this opportunity.  Do not let it slip away.\n\nThere was this devoted pastor, trapped in a hurricane, who believed God would save him. He said he'd been devoted to God his entire life, that he wouldn't be forsaken. When the floods and winds came, policemen came knocking on his door, asking him to leave. He refused, said God would provide. Then the water rose to his hips. Firefighters came and pleaded with him. He again refused, said God would save him.  Then the water grew above his head.  He had to climb on the roof.  The wind and rain was furious.  Rescue helicopters and boats came out, begging the man.  Still, the pastor refused.  He said he had devoted his entire life to serving His will, that the Almighty would surely save him.  When the pastor finally succumbed to the might of the hurricane, the man died. He asked God, \"Lord, why didn't you save me?\" God answered, \"I sent all those people...\" Bullish",
        "sentiment": {
            "TextBlob": 0.12857142857142856,
            "NLTK": 0.9794,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9807559847831726
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-02-28T15:20:54Z",
        "content": "$SPY $QQQ $TQQQ $SQQQ $NASDAQ  \n \nClosed short positions this morning at open on that dip for a small profit.  Adding to long positions.  Have fun bag holding puts guys!  Market green, my portfolios green.  Market red, my portfolios green.  Consolidation period for the next run-up is this week and possibly next week.  Big funds exchanging hands at these levels. Bullish",
        "sentiment": {
            "TextBlob": -0.04807692307692308,
            "NLTK": 0.7574,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9974133372306824
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-02-27T19:43:02Z",
        "content": "$SPY $QQQ $TQQQ $SQQQ $NASDAQ  \n \nMarket is green, my portfolios are green.  Market is red, my portfolios are green.  Making money in any and all directions.  Oh yeah, I closed my long positions from last week for massive returns at 1.4%+ on the Nasdaq today and shorted the market, waiting for bad earnings from Lowe's and Target before I go back long to hopefully buy down cheaper. Making money in any and all directions better than a pro.   The market should take 1-2 weeks to consolidate before skyrocketing back up to re-test Feb 2 highs.  Don't get trapped bag holding worthless puts.  Gotta trade them like I do and make massive returns. Bearish",
        "sentiment": {
            "TextBlob": -0.12679738562091505,
            "NLTK": 0.6884,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9981232285499573
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-02-27T10:20:35Z",
        "content": "$SPY $QQQ $TQQQ $SQQQ $NASDAQ  \n \nSome statistics from my Twitter followers.  Polls still open for almost a week so values might change a little, but preliminary results are this. I asked:  \n \n'For those who shorted since the bull market ended, did you make NET total profit up through to today?' \n \n-25% said they made a profit \n-25% broke even \n-25% have a net loss \n-25% lost both going long and shorting (they must have panic sold the lows and shorted from the lows??) \n \nI asked shorts who lost money shorting the new bull market 'For those who shorted and lost money since October lows, or missed out on the rallies, are you adding on this dip in late February?' \n \n-23% responded yes they are going long on dips \n-46% said only adding a little \n-23% said they aren't doing anything \n-8% said they were shorting more from here (and going to lose all their money???) \n \nAs you can see, the majority of people are buying the dip.  \n \n1 of 2 (continue in next reply to this post) Bullish",
        "sentiment": {
            "TextBlob": -0.010664335664335667,
            "NLTK": -0.954,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9993113279342651
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-02-27T09:40:41Z",
        "content": "$QQQ $TQQQ $SQQQ $NASDAQ $COMPQ  \n \nThis is the chart for those who don't know how to read charts. I will explain. The year low Falling Broadening Wedge formation completed and broke to the upside in October. It failed to make a lower low to touch the bottom of the trading range. This was a VERY bullish sign.  We're at the bottom of an uptrend channel. It will shoot right back up to re-test Feb 2 12,200 Nasdaq highs, and then August 13,000 highs. Will eventually retest resistance at 15,300 by around September via this Rising Wedge pattern. It'll do a 50% retrace sell off after that because a Rising Wedge implies it'll do a healthy sell off at that point, which is also where trapped longs at 15,300 will sell out. A 50% retrace down will recover around 13,000 or so, and then reverse back up and continue to rally to year end, closing the year slightly below 14,000. Then new all time highs in early 2024 my friends. YOU HAVE BEEN WARNED. Bullish",
        "sentiment": {
            "TextBlob": 0.01537351537351537,
            "NLTK": -0.9317,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9994173049926758
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-02-27T09:02:13Z",
        "content": "$SPY $QQQ $TQQQ $SQQQ $NASDAQ  \n \nGoogle \"EIA gasoline diesel prices 2023 2024\" and look at the charts they are projecting for 2023 and 2024. Huge oil global refineries in the Middle East, SE Asia and Africa came online in 2022 and will be coming online in 2023, drastically dropping gas and diesel prices. Gas and diesel prices will tank hard into 2023 and 2024, lowering inflation and corprorate expenses big time, helping earnings and consumers alike. This is the chart for those who don't know how to read charts. I will explain. The year low Falling Broadening Wedge formation completed and broke to the upside in October. It failed to make a lower low to touch the bottom of the trading range. This was a VERY bullish sign, which is why I went full on calls in October, because I knew it would breach the upside resistance, break out and form an uptrend channel. I finally sold on Feb 2 and shorted, and covered last week to go long again. Expert trader here guys, up 270% YTD.  \n \n1 of 2 Bullish",
        "sentiment": {
            "TextBlob": 0.008333333333333337,
            "NLTK": -0.875,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.999188244342804
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-02-26T23:02:54Z",
        "content": "$SPY $QQQ $TQQQ $SQQQ $NASDAQ  \n \nA few years ago, I charted data points for the S&P vs Unemployment Rates vs Recession vs Yield Curve.  I found almost every single time yields inverted, stocks actually rallied to make new highs, or at least a double top before the real selling and real recession starts.  The yield curve has never been wrong.  However, it's interesting the father of the yield curve, Campbell Harvey, the man who discovered this, says he actually doesn't believe the yield curve is correct this time, citing unemployment rates are extremely low and no signs of major layoffs.  A study by the Feds (which you can Google) concluded you can use unemployment rates or yield curve inversions to predict recessions, and that unemployment rates were better at doing so. \n \nAfter inflation has peaks, history shows the market is usually double digits higher 12 months later. History suggests the market will continue to new all time highs first, assuming we even get a recession. Bullish",
        "sentiment": {
            "TextBlob": 0.08318993506493506,
            "NLTK": -0.9313,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.8295193910598755
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-02-26T11:42:24Z",
        "content": "$SPY $QQQ $TQQQ $SQQQ $UPRO  \n \nWhat's interesting on Friday is the 1 day chart behaved like a bad earnings/good outlook event where the selling was met with buying and simply trended up, and not a selloff down.  The charts don't lie. \n \nPlus an anonymous survey showed most shorts who had some profit in 2022 are either now break even, or actually lost money shorting since the October new multi-year bull market started.  And most are actually saying they are buying the dip here.  Only a few will continue to short until they're dead broke or something.  I find people are more truthful when they are answering anonymously. \n \nAlmost a full month to Fed decision, the market will continue to rally back all month to that catalyst date.  And then, April, it's earnings hype run-up, so... shorts will get no break.  Expert shorts and traders like myself already shorted on Feb 2 and covered are shorts to go back long on the trend up to new all time highs. Bullish",
        "sentiment": {
            "TextBlob": 0.09085858585858586,
            "NLTK": -0.2975,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9961076378822327
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-02-26T11:03:36Z",
        "content": "$SPY $QQQ $TQQQ $SQQQ $NASDAQ  \n \nFor you shorts are who itching to lose money, continue shorting the new bull market that started in October to the new all time highs.  That'll be fun to have stories to tell during family and friends gatherings.  For expert shorts and traders like myself, we're waiting for when a new Republican President takes office, because during the past 100 years, every, and I mean EVERY Republican President has presided over a recession in their first term of office.  USA Today did some fact checks back in 2020 titled: \n \n\"Fact check: Do Republican presidents oversee recessions and Dems oversee recoveries?\" \n \nSo, if Biden gets defeated in 2024, or the GOP wins the presidency in 2028, get ready to short the fuck out of the market. \n \nTrump tried to sidestep this curse (as they call it), with a massive tax cut for the rich, which has NEVER been done before during a bull market, but alas he succumbed to the curse. Bullish",
        "sentiment": {
            "TextBlob": 0.03143939393939393,
            "NLTK": -0.8462,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9964659214019775
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-02-26T10:53:42Z",
        "content": "$SPY $QQQ $SQQQ $TQQQ $NASDAQ  \n \nThe dude who came up with the yield curve inversion, which has reliably predicted recessions in the past, Campbell Harvey, said he thinks this time it's not accurate. \n \nThe reason is because unemployment rates are not going up significantly as I've shown in my posts in the past where when a recession starts, unemployment rates start going up.  But the job market is extremely strong.  He came to the same conclusion as I did.  In fact, a study by the Feds (which you can Google) says you can use the yield curve OR unemployment rates to predict a recession, and that a unemployment rates are a better predictor. \n \nstansberryresearch.com/arti... Bullish",
        "sentiment": {
            "TextBlob": 0.08690476190476189,
            "NLTK": -0.7551,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9809442162513733
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-02-26T10:50:03Z",
        "content": "$SPY $QQQ $SQQQ $TQQQ $NASDAQ  \n \nHere's my prediction.  Assuming the Rising Wedge pattern is realized and maintains its form (need a week or two to confirm), we should see the market continue to trend up to re-test the major resistance around 4,500-4,600, most likely around early fall, which is where trapped longs/retirees will dump. This pattern predicts a selloff, most likely to the 50% retrace level around 4,080 level, where it should recover and rally back to year end, closing anywhere from 4,200-4,400.  December is usually a good month, and if it closest higher as most analysts predict, shorts will panic cover at massive losses for tax loss harvesting.  That implies a new all time high, or double top would be in early to mid 2024.  Typically when yield curves invert, it takes about a year or more before a recession AND stocks typically make a new all time high or double top BEFORE the recession.  That's when we see the real selling. \n \nHOWEVER... (continue on next reply) Bullish",
        "sentiment": {
            "TextBlob": 0.1656257014590348,
            "NLTK": -0.932,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9980997443199158
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-02-26T05:26:28Z",
        "content": "$SPY $QQQ $TQQQ $SQQQ $NASDAQ \n\nThe beauty of it is gas is now cheaper than when Russia invaded Ukraine last year. Diesel is almost back down and both are expected to continue down drastically later in 2023, into 2024 because huge new refineries in the Middle East, SE Asia and Africa came online in late 2022 and will continue to come online fully in 2023.\n\nDespite an uptick in inflation in January, as Walmart's profit shows, that appears to be just corporate greed raising prices to take advantage of consumers. Walmart is already pushing back on it's suppliers to stop the greed.  Inflation is expected to drop *drastically* later in 2023, especially with gas and diesel skyrocketing in Feb-June of 2022.  The final figures in 2023 will drop huge compared to 2022.\n\nThe charts clearly show the downtrend was broken in October and what's mocked as a bear market rally or sucker's rally will eventually be renamed to the start of a new bull market. Bullish",
        "sentiment": {
            "TextBlob": -0.016113516113516108,
            "NLTK": -0.0516,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9953633546829224
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-02-25T00:55:57Z",
        "content": "$SPY $QQQ $TQQQ $SQQQ $NASDAQ \n\nFYI Bullish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.368,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9983044862747192
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-02-25T00:53:45Z",
        "content": "$SPY $QQQ $TQQQ $SQQQ $NASDAQ \n\nI find people are more honest when they respond anonymously to surveys.  I'll repost full survey results in a week.\n\nI bet you many perma shorts who made money initially in early 2022 lost most, if not all, their gains by now continuing to short from the Oct lows. Bullish",
        "sentiment": {
            "TextBlob": 0.3642857142857143,
            "NLTK": -0.1388,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9991137385368347
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-02-25T00:27:26Z",
        "content": "$SPY $QQQ $SQQQ $TQQQ \n\n1 day chart showing an uptrend.  Looks like the majority is just using the dips as buying opportunities.  Unless you held shorts overnight, pretty much everyone who shorted today on the S&P 500 is red. Bullish",
        "sentiment": {
            "TextBlob": 0.15,
            "NLTK": 0.8074,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9997023940086365
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-02-24T17:32:19Z",
        "content": "$SPY $QQQ $TQQQ $SQQQ $NASDAQ   \n \nGuys, I think big money going to run this up green soon because they know the market will continue up in 2023 with inflation expected to drop big the second half.  Many people missed the October lows and realized now they done f'd up shorting since October and losing massive amounts of money LOL.  They're finally loading up now that they realize the worst is already behind us in 2022.  I mean, no one wants to be THAT guy (or gal) who shorted from October lows all the way to the all time highs ROTFL!!!!!!!!!!!!!!!11!!!!1!!! \n \nI bet you some clowns shorted March, 2009 lows all the way to the all time highs, or sat out and missed on a massive 10+ year bull market.  Do you want to be that person??? \n \nI think we'll see people stepping over each other FOMO buying for those weak ass longs who missed out on huge gains since October lows sitting on the sideline, and panic covering at massive losses for shorts who didn't close at a profit. Bullish",
        "sentiment": {
            "TextBlob": -0.03097587719298245,
            "NLTK": -0.9814,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9994955062866211
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-02-24T17:02:19Z",
        "content": "$SPY $QQQ $TQQQ $SQQQ $NASDAQ  \n \nLOL!!!!  Looks like pretty much everyone who shorted the S&P today are under water or close to being under water with the market attempting to rally back up.  The Nasdaq is very close behind.  This sell off today feels different. It's almost as if big money is going to turn around and run it up green because this is so close to the 50% retrace support level and intersection with an uptrend channel from October.  Anyone else have that feeling, like this is a big ol' bear trap? \n \nI mean my God, half the people are bearish so they must have missed out on half the recovery back to the all time highs since October!  Amazing.  You can't make this stuff up LOL.  And then, there's people who's been shorting since October.  They must have lost all their gains from shorting in 2022, ASSUMING they shorted from the top down.  Most only shorted after a few months, especially after Russia invaded, which means they'd probably be at break even or losses by now. Bullish",
        "sentiment": {
            "TextBlob": 0.11130050505050507,
            "NLTK": 0.9493,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9990346431732178
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-02-24T16:48:16Z",
        "content": "$SPY $QQQ $TQQQ $SQQQ $NASDAQ  \n \nI hope ya'll used this opportunity to buy in, especially if you missed out since October lows.  You basically missed half the market's recovery!  LOL \n \nI wouldn't be surprised to see the market do a full on U-turn and go green since the trend has been up since October lows, and the uptrend channel from October is intersecting with the current levels. \n \nAdditionally, there's 1 more month until Feds decide and plenty of data to come out before then. Bullish",
        "sentiment": {
            "TextBlob": 0.16770833333333335,
            "NLTK": 0.4179,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9996920824050903
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-02-23T21:44:47Z",
        "content": "$SPY $QQQ $TQQQ $SQQQ $NASDAQ \n\nPerma bears are hilarious. Even when we're at the all time highs again they'll claim it's a bear market rally lllmmmmffaao!!!!!1!!11!!!  I'll be laughing all the way to the bank whether the market goes up or down trading this volatility all the way to the ATHs. Bullish",
        "sentiment": {
            "TextBlob": 0.4105034722222222,
            "NLTK": 0.7946,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9712076783180237
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-02-23T20:59:07Z",
        "content": "$SPY $QQQ $TQQQ $SQQQ $NASDAQ  \n \nHere's what I think will happen.  There's a larger uptrend channel from October that's meeting up with the Falling Broadening Wedge formation.  When the two meet, it should continue up.  Short term chart says we're going to rally hard.  Longer term suggests slightly down more for support to meet that intersection, and then rally up, just in time for April earnings hype run-up. \n \nOoops, did I forget the chart?  Didn't see it on my original post. Bullish",
        "sentiment": {
            "TextBlob": 0.07129629629629629,
            "NLTK": 0.3353,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.999213457107544
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-02-23T20:51:59Z",
        "content": "$SPY $QQQ $TQQQ $SQQQ $NASDAQ  \n \nHere's what I think will happen.  There's a larger uptrend channel from October that's meeting up with the Falling Broadening Wedge formation.  When the two meet, it should continue up.  Short term chart says we're going to rally hard.  Longer term suggests slightly down more for support to meet that intersection, and then rally up, just in time for April earnings hype run-up. Bullish",
        "sentiment": {
            "TextBlob": 0.01055555555555554,
            "NLTK": 0.2449,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9990025162696838
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-02-23T20:11:05Z",
        "content": "$SPY $QQQ $TQQQ $SQQQ $NASDAQ  \n \nMassive bear trap LMFAO!  Watch big money run this to the close, and then run this even more tomorrow regardless of what Core PCE is. Bullish",
        "sentiment": {
            "TextBlob": 0.16666666666666666,
            "NLTK": 0.4981,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9988956451416016
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-02-23T19:57:30Z",
        "content": "$SPY $QQQ $TQQQ $SQQQ $NASDAQ  \n \nWelcome to the stock market.  Looks like big money tricked retail bear to load puts while they loaded shares and calls for cheap.  Tomorrow, I bet they will let it run hard regardless of what Core PCE is.  Big money knows the bear market ended in October and just trying to get shares and calls as cheap as they can.  Are you the kid crying on the right, or the kid on the left who's enjoying the ride, making a shit ton of money???? Bullish",
        "sentiment": {
            "TextBlob": 0.15400432900432903,
            "NLTK": 0.6767,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9995418787002563
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-02-23T02:52:32Z",
        "content": "$SPY $QQQ $SQQQ $TQQQ $NASDAQ \n\nBeen a great 2 months trading, riding the market up to Feb 2 and shorting it back down and riding it back up multiple times in February, and then finally covering Tuesday and going back long.  This volatility is great for making MASSIVE compounded returns.  I predict we see a huge technical bounce.  If sentiment is good enough, we may even make a new high above the Feb highs.  Friday will be make or break. Bullish",
        "sentiment": {
            "TextBlob": 0.16416518122400475,
            "NLTK": 0.9246,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9562705755233765
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-02-22T18:19:17Z",
        "content": "$SPY $QQQ $SQQQ $TQQQ $NASDAQ \n\nMASSIVE rally about to start.  I already closed my puts yesterday for massive gains and went long.  I'm up 265% YTD. Screenshot taken real time of my Fidelity brokerage account and my kids'Roth IRAs.  Going to trade their Roth IRAs to millions, all tax free baby! Bullish",
        "sentiment": {
            "TextBlob": 0.09166666666666667,
            "NLTK": 0.7177,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9978811144828796
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-02-22T17:26:05Z",
        "content": "$SPY $QQQ $SQQQ $TQQQ $NASDAQ  \n \nFalling Broadening Wedge chart formation is currently in play. With that formation the market will move across both upper and lower bound ranges in extreme \"manipulated\" ways. As time progresses, the wedge broadens (as its name implies), resulting in extreme wild movements scaling up and down the upper and lower bounds of the ranges.  Right now we're at the lower bound of this range, meaning it should rally hard back up 2-3% in a short time.  We saw a huge formation like this during the Trump Tariff Crash of 2018.  The thing about these formations is that once it's completed, it'll shoot up and above resistance and attempt to make a new high, or at least attempt to take out the original high that was part of this wedge initially.  Google \"Falling Broadening Wedge\".  \n \n. \n \nExpert trader in the hiissoousse here trying to help you guys out. I rode the bull up to Feb 2, shorted it back down, back and forth, and am up like 265% YTD as of yesterday. Bullish",
        "sentiment": {
            "TextBlob": 0.021104552013642922,
            "NLTK": 0.1027,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9963371753692627
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-02-22T13:57:49Z",
        "content": "$SPY $QQQ $SQQQ $TQQQ $NASDAQ \n\nReady for a MASSIVE bounce the next few days????  The charts predict it'll happen.  Yesterday was a profit taking stop loss selling gap down to before Powell's last remarks.  Gap has been filled so it'll bounce back up.  Friday's Core PCE is key.\n\nGas and diesel will come down in 2023 and into 2024 because HUGE global refineries in the Middle East, Southeast Asia and Africa came online in late 2022 and all of 2023.\n\nInflation may have spiked in January, but long term, it *IS* going down. Bullish",
        "sentiment": {
            "TextBlob": -0.0010416666666666647,
            "NLTK": 0.5309,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.998741090297699
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-02-21T23:44:13Z",
        "content": "$SPY $QQQ $TQQQ $SQQQ $NASDAQ  \n \nShorter term charts show the market is following this Falling Broadening Wedge.  This chart formation means as time progresses, we'll see YUGE volatility 1 day moves, similar to Friday + today as the market goes from the upper/bottom range to the opposite extreme. It can still rally insanely up 2.5%+ in just days, so be careful. \n \nThere's a chance it'll break down through support and sell off more.  However, this chart shows it's technically oversold at this point.  Longer term charts show we need to drop just a little bit more to get to solid support for the next leg up, however, the shorter term charts suggest we'll do a major bounce, even if a lower high and lower low gets created next week.  The market doesn't move in a straight line so this volatility is normal. \n \nLonger term charts, with future catalysts suggest a big rally will start in April for Q2 earnings run-up hype, implying near term lows will be late March. Bullish",
        "sentiment": {
            "TextBlob": -0.008502415458937205,
            "NLTK": 0.0161,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.998665452003479
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-02-21T23:42:41Z",
        "content": "$SPY $QQQ $SQQQ $TQQQ $NASDAQ $UPRO  \n \nShorter term charts show the market is following this Falling Broadening Wedge.  This chart formation means as time progresses, we'll see YUGE volatility 1 day moves, similar to Friday + today as the market goes from the upper/bottom range to the opposite extreme. It can still rally insanely up 2.5%+ in just days, so be careful. \n \nThere's a chance it'll break down through support below and sell off more.  However, this chart shows it's technically oversold at this point.  Longer term charts show we need to drop just a little bit more to get to solid support for the next leg up, however, the shorter term charts suggest we'll do a major bounce, even if a lower high and lower low gets created next week.  The market doesn't move in a straight line so this volatility is normal. \n \nLonger term charts, with future catalysts suggest a big rally will start in April for Q2 earnings run-up hype, implying near term lows will be late March. Bullish",
        "sentiment": {
            "TextBlob": -0.008502415458937205,
            "NLTK": 0.0161,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9986925721168518
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-02-21T22:48:51Z",
        "content": "$SPY $QQQ $SQQQ $TQQQ $NASDAQ \n\nLoL where's all the arrogant bulls now???  Good news, the market doesn't move in a straight line.  Tomorrow and Thursday you'll get your chance to dump on a major dead cat bounce.  But don't forget to dump before Friday Core PCE release. Bullish",
        "sentiment": {
            "TextBlob": 0.3125,
            "NLTK": -0.6677,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9973922967910767
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-02-21T20:05:40Z",
        "content": "$SPY $QQQ $SQQQ $TQQQ $NASDAQ \n\nBottom's in.  Time to load up.  Dump again before Friday's Core PCE. Bullish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": -0.3818,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9997668862342834
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-02-21T15:52:33Z",
        "content": "$SPY $QQQ $SQQQ $TQQQ $UPRO  \n \nSo... I think we'll see a dead cat bounce today, hype pump to Fed meeting minutes tomorrow.  Then, one of three possibilities. Either it tanks after Fed meeting minutes because that's meaningless data.  Those minutes were written BEFORE inflation went sky high.  It's like reading an ex-girlfriend's love letters to you AFTER she's already left you LOL.  But, the market either will attempt to find good news where there's none and rally just so they can dump later, or it'll just sell off.   \n \nEither way, on Friday, trapped big money might attempt to rally after horrible hot Core PCE only to dump on unsuspecting FOMO bag holders.  In other words, this week should end down regardless of any pump and dumps that happen. \n \nOnce that support line breaks though, the Nasdaq should drop to the 50% retrace, around 11,200s and S&P 500 to the 3,900 level for support. Bearish",
        "sentiment": {
            "TextBlob": 0.015296296296296296,
            "NLTK": -0.9037,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9994668364524841
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-02-21T15:20:02Z",
        "content": "$SPY $QQQ $TQQQ $SQQQ $TNA  \n \nClosed all my put options for MASSIVE gains at -1.70% on the Nasdaq.  Went long to catch a dead cat bounce.   MASSIVE compounded returns guys.  This is how you do it.  Expert trader in the hisssoouuuussee!!!!!!! Bullish",
        "sentiment": {
            "TextBlob": -0.07,
            "NLTK": -0.6209,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9965752959251404
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-02-21T14:21:11Z",
        "content": "$SPY $QQQ $TQQQ $SQQQ $TNA \n\nFOMO bag holder gamblers will regret buying in Feb during the 3-6 month highs. Some never learn their lessons. Smart longs bought in early January and are locking in profits. Bearish",
        "sentiment": {
            "TextBlob": 0.15714285714285714,
            "NLTK": 0.4215,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9948493838310242
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-02-21T14:06:41Z",
        "content": "$SPY $QQQ $SQQQ $TQQQ $NASDAQ \n\nUh oh.  This isn't good.  50 cents VIX trader bought a shit ton of VIX calls for May.  He's never been wrong. Bearish",
        "sentiment": {
            "TextBlob": -1.850371707708594e-17,
            "NLTK": -0.5349,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9980883002281189
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-02-21T13:33:43Z",
        "content": "$TGT \nIf Walmart is reporting people are buying food and not other regular stuff, Target is going to report bad earnings and outlook. Bearish",
        "sentiment": {
            "TextBlob": -0.21249999999999994,
            "NLTK": -0.5423,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9996961355209351
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-02-21T12:42:37Z",
        "content": "$WMT \nTheir earnings beat shows corporate greed is the cause of inflation.  How can they make so much money while Americans, especially lower income people, suffer??????  UnfriggenReal.  Unacceptable. Bearish",
        "sentiment": {
            "TextBlob": 0.06666666666666667,
            "NLTK": -0.8463,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9993415474891663
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-02-21T12:23:26Z",
        "content": "$SPY $QQQ $SQQQ $TQQQ $NASDAQ \n\nI'll bet my bottom dollar big funds all crunched the numbers this long weekend and realized the risk of stagnate or even rising inflation and a debt ceiling fight later this year, coupled with deteriorating earnings, along with charts showing lower highs and lower lows since Feb 2 is telling them to sell and lock in profits before it's too late.  While retail FOMO buy options and stocks, big money does calculations and risk assessments.  Support is about to break and massive selling back down.  If you were a fund manager and you have a full year's worth of gains in 1 month, would you take it??? Bearish",
        "sentiment": {
            "TextBlob": 0.014444444444444444,
            "NLTK": -0.6298,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9974870681762695
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-02-21T11:46:06Z",
        "content": "$SPY $QQQ $SQQQ $TQQQ $NASDAQ \nTrend is down. Buyers will be bag holding all summer through the debt ceiling fight. 50 cents VIX trader is betting big massive selloff by May. He's never been wrong. Bag holders' convention starts this week. Get your tickets while you can!\n\nI'm up 249% on my best account YTD and 100% in Feb despite it being a flat month.  Expert trader in the hisoouusse here.  I should be up 500% by the time this selloff is over, and then I'll ride the rally back up.  Should hopefully do 1,000% gains by mid summer. Bearish",
        "sentiment": {
            "TextBlob": 0.024305555555555556,
            "NLTK": 0.7933,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9865912795066833
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-02-21T11:14:40Z",
        "content": "$SPY $QQQ $TQQQ $SQQQ $NASDAQ  \n \nThe trend is down.  Don't let the FOMO bag holding mentality fool you into losing money.  Dump on any rallies.  Never fight the feds, and never fight the trends. Bearish",
        "sentiment": {
            "TextBlob": -0.15555555555555559,
            "NLTK": -0.5764,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9992489218711853
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-02-21T10:45:52Z",
        "content": "$SPY $QQQ $TQQQ $SQQQ $NASDAQ  \n \nRemember, on any pump, sell the rips.  That's your chance to get out with a profit, and buy back when it's much lower.  Otherwise, you'll be bag holding.   The market gives us many, many opportunities to exit our positions.  Most people hesitate or have bagholder mentality (i.e. gambler's mentality) where they simply hold and are happy to lose money.  That's why most people can't beat the S&P 500 annual returns. Bearish",
        "sentiment": {
            "TextBlob": 0.375,
            "NLTK": 0.6022,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9933034777641296
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-02-21T09:43:55Z",
        "content": "$SPY $QQQ $TQQQ $SQQQ  \nAt minimum, we need a 50% retrace to the 3,900s on the S&P and 11,200s on the Nasdaq to form a solid support, ASSUMING the uptrend channel is intact. \n \nIf support is broken, obviously we're going much, much lower.   \n \nCore PCE and the March economic reports will seal the fate of this rally.  Pay close attention.  Inflation CANNOT be allowed to continue up.  The Feds will 100% destroy inflation even if that means destroying the economy and stocks in order to reset the bull/bear cycles.  It has always been this way.  It is the ONLY way.  The Feds' dual mandate demands it. \n \nThe next earnings hype run-up won't start around April, which is when I expect the next bull rally to start.  I'd be buying calls around April, not anytime sooner. Bearish",
        "sentiment": {
            "TextBlob": -0.04,
            "NLTK": -0.7184,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9954738020896912
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-02-21T01:26:57Z",
        "content": "$SPY $QQQ $TQQQ $SQQQ $NASDAQ \n\nLONG ways down.  You have been warned.  Protect your investments.  Sell covered calls, buy puts, lock in your profits.  Do something.  Ain't no one's ever gone broke taking profits, but plenty have gone broke watching massive profits turn into massive losses. Bearish",
        "sentiment": {
            "TextBlob": -0.0513888888888889,
            "NLTK": -0.1793,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9900200366973877
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-02-20T17:22:20Z",
        "content": "$QQQ $SPY $TQQQ $SQQQ $NASDAQ \n\nSo far so good riding the bull market in January and dumping my longs on Feb 2 to short and trade the volatility since.  As you can see, market up big, I'm up big.  Market down or flat in Feb MTD (as long as there's volatility), I'm up big, compounded.  Compounding is the most powerful force in the universe.  Up in any and all directions.  Screenshot taken real time of my Fidelity brokerage account just minutes ago.\n\nMarket should drop back down to do a 50% retrace at minimum, to 11,200s on the Nasdaq and 3,900s on the S&P.  Expert trader in the hisoouusse!!!  \n\nMy 7 and 10 year olds' Roth IRAs are up huge since I started them on August, 2022.  All tax free baby, all tax free.  I plan on making them millionaires trading their tax free Roth IRA in a few years of massively compounded gains. Bearish",
        "sentiment": {
            "TextBlob": 0.13328124999999996,
            "NLTK": 0.9598,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9683514833450317
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-02-19T20:34:28Z",
        "content": "$SPY $QQQ $TQQQ $SQQQ\n\nBloomberg has an awesome article titled \"Investors in a Bind as Risk Appetite Slams Into a Resolute Fed\". It has a chart of earnings EPS YoY vs the S&P 500. It shows the earnings EPS has gone negative year over year. This only happened 4 times in the past 23 years. 3 of those 4 times, a recession followed with massive selling. Only 1 of those 4 times (in 2014), a recession didn't happen, BUT stocks still sold off.\n\nWhat's insane is stocks reported horrible earnings and outlook and many just kept rallying. Clearly, the Feds need to do more to stop this gambling.\n\nInflation MUST come down fast for a soft landing. If it doesn't, Feds MUST hike more rates. This eventually leads to a recession. EPS corporate greed creates these bust/boom economic cycles.\n\n.\n\nMarch economic reports will make or break this rally. Continued inflation direction AND SPEED this year is the only thing that matters and will dictate if we see a recession or a soft landing. Bearish",
        "sentiment": {
            "TextBlob": 0.034722222222222224,
            "NLTK": -0.9624,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9937393665313721
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-02-19T00:35:16Z",
        "content": "$SPY $QQQ $TQQQ $SQQQ \nRiding the bull wave and shorting it back down, over and over.  It's called MASSIVE compounding in any and all directions.  Think Warren Buffett compounding over 50 years, in the span of just a fraction of that time.   Accounts up big despite market has been down since August 1, 2022.\n\nI'll explain it in layman's terms.  They say time is the most important factor in compounded gains.  I tell you that's wrong.  Rate of return is the most important factor.  Expert trader in the hiiissoouuse!! Bearish",
        "sentiment": {
            "TextBlob": 0.12138888888888888,
            "NLTK": 0.4714,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9978317618370056
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-02-17T17:04:22Z",
        "content": "$SPY $QQQ $TQQQ $SQQQ \nThat's me laughing all the way to the bank.  Massive short positions with puts bought much higher up when the unsustainable FOMO buying was happening.\n\nIt's a long ways down.  50% retrace is at 11,200 on the Nasdaq and around 3,900 on the S&P.  At minimum, MINIMUM, we hit those levels before an uptrend can restart.  But there's a good possibility we overshoot due to the extremely high inflation and Feds doing 50 bps rate hikes for the foreseeable future until inflation drops back down.  Powell said it'll depend on the data, but clowns be ignoring his words and dared to pump the market despite these nasty inflation data. Bearish",
        "sentiment": {
            "TextBlob": -0.031342592592592596,
            "NLTK": 0.742,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9970855116844177
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-02-17T16:31:03Z",
        "content": "$SPY $QQQ $TQQQ $SQQQ \nI'll make a bold prediction. All month, possibly into March, each day bulls try to be a heroes and buy, they'll just eventually end up being trapped bag holding as big funds and other bulls dump on them to either lock in profits or preserve capital. Shorts will continue selling too, but smart ones already took positions much higher and just laughing all the way to the bank. The bulls will do the majority of panic selling.\n\nThe charts show ZERO support at these levels under these economic conditions. Being I'm up like 200%+ YTD in my best account and 80%+ in most other accounts, not even including today's massive gains as I'm loaded on puts as some accounts only calculate the last trading day like Fidelity, I'm not too bad with my assessments. Bearish",
        "sentiment": {
            "TextBlob": 0.08984126984126985,
            "NLTK": 0.9818,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9842161536216736
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-02-17T14:55:23Z",
        "content": "$SPY $QQQ $TQQQ $SQQQ $SPXS \nMy YTD returns for my main account, among many others, and my 7 and 10 year olds'Roth IRAs I started for them last year.  Expert trader in the hisoouusse!!!  And this is not even including today's massive gains.  The market will tank further.  Don't let the daily volatility fool you.  The trend is back down. Bearish",
        "sentiment": {
            "TextBlob": 0.06388888888888888,
            "NLTK": -0.3348,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9973481893539429
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-02-17T14:43:16Z",
        "content": "$SPY $QQQ $TQQQ $SQQQ \nA 50% retrace is 11,200 on the Nasdaq and 3,900 on the S&P.  A healthy pullback IS REQUIRED for the uptrend to continue.  The 1 month through 1 year charts all predict this will happen.  Don't be a hero and try to catch a falling knife.  Heroes get killed. Bearish",
        "sentiment": {
            "TextBlob": 0.15,
            "NLTK": -0.4632,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.991631805896759
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-02-17T14:29:17Z",
        "content": "$SPY $QQQ $TQQQ $SQQQ \nGet ready for a head fake up, and then massive dumping the remainder of the day as everyone steps over each other to exit long positions.  Remember, no one ever gone broke locking profits.  Warren Buffett's number one rule is: Preserve capital!!! Bearish",
        "sentiment": {
            "TextBlob": -0.10453125,
            "NLTK": -0.6784,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9977801442146301
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-02-17T05:53:52Z",
        "content": "$SPY $QQQ $TQQQ $SQQQ\nSo many trapped bulls got caught with pants down.  The market tanked in an hour and basically the entire week's gains went down the drain.  Next time, after the market's already made a full year's worth of gains in only one month, and ALL economic reports comes in extremely bad, quit buying no matter how much the FOMO kicks in.  But puts instead little by little.\n\nThat little voice in the back of your head should have warned you, like buying AMC, TLRY or GME near the top lol.  That means as the market continues to tank from profit taking, there's going to be extreme panic selling.  Hope y'all learned ya FOMO lessons.  But somehow I doubt some people will.\n\nBloodbath coming. Bearish",
        "sentiment": {
            "TextBlob": 0.052569444444444446,
            "NLTK": 0.6205,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9993389248847961
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-02-16T23:10:58Z",
        "content": "@CoffeeGetsMeThru @bobvu  \nYeah, but you could say the same about whats her face making a comment earlier in the week about being close to a pause too, causing further rally.  That's beyond the point.  The fact is all inflation data went through the fucking roof this week and the market ignored it because that's what big funds do.  PPI went way, way above the ranges economists even expected.  PPI will lead to future inflation.  Big funds manipulate any chance they can to get out and then they let the market tank hard.  It's like horrible earnings/outlook like $UPST, getting idiots to buy in high and then they dump on them.",
        "sentiment": {
            "TextBlob": -0.20243589743589746,
            "NLTK": -0.4767,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9992903470993042
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-02-16T22:49:01Z",
        "content": "$SPY $QQQ $TQQQ $SQQQ  \nAlmost the entire week's gains lost in ONE HOUR.  ONE flipn' hour!   LoL!!!!!!   You can't make this stuff up.  The only thing more epic is if the entire week's gains would have been lost in just 1 hour.   Tomorrow, less than 1% sell off means the week is red, which confirms downtrend is intact back to at minimum, MINUMUM, 50% retrace at Nasdaq 11,200 and S&P 3,900.  Now that's what you call a rug pull.  Greed kills people.  Remember, in a pump and dump, you have to dump high to actually make a profit. Bearish",
        "sentiment": {
            "TextBlob": 0.14484848484848484,
            "NLTK": -0.8257,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9982796907424927
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-02-16T21:33:31Z",
        "content": "$SPY $QQQ $TQQQ $SQQQ \nFor you perma longs, I'll give you a little advice.  I trade in most my accounts and anm up 80-220% YTD, but I have one where I hold only long shares, long term for tax purposes.  When the market rallies unsustainably hard, I sell deeper in the money covered calls a few months out to get the most money.  With the proceeds, I buy inverse ETFs like SPXS or SQQQ.\n\nMy account I bag hold in is up green today despite the market being deeper red.  As the market tanks further, I eventually sell the inverse ETFs for more money, buy back the covered calls for cheap as heck, or they sometimes expire worthless and I get to keep all the premium.  And then, I buy more long shares for cheap.  It's like getting 50-100% more returns like this ON TOP of the usual appreciation.  That's how pros like me do it. Bearish",
        "sentiment": {
            "TextBlob": 0.08194444444444444,
            "NLTK": 0.9678,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9903843402862549
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-02-16T21:04:23Z",
        "content": "$QQQ $SPY    \nLONG WAYS DOWN.  Lock in your profits before it's too late. Bearish",
        "sentiment": {
            "TextBlob": -0.1685185185185185,
            "NLTK": 0.4404,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9938865303993225
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-02-16T20:49:56Z",
        "content": "$QQQ $SPY $TQQQ $SQQQ  \nWho got tricked into buying the highs while big money dump smacked into your mouths? Bearish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": -0.4939,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9988277554512024
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-02-16T20:26:04Z",
        "content": "$QQQ $SPY $TQQQ $SQQQ  \nDon't everyone sell off all at once now.  We need some idiots to bag hold this shit while the rest of us makes the getaway. Bearish",
        "sentiment": {
            "TextBlob": -0.5,
            "NLTK": -0.6428,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9923914074897766
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-02-16T20:18:14Z",
        "content": "$QQQ $SPY $TQQQ $SQQQ  \nWAIT!  I thought we were going to the moon without any pullbacks?  I mean nothing bad can happen when you get a full year's return in a month's time, right???? Bearish",
        "sentiment": {
            "TextBlob": -0.09419642857142851,
            "NLTK": 0.6251,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9687471389770508
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-02-16T19:15:05Z",
        "content": "$SPY $QQQ $SQQQ $TQQQ \nBuying drying up.  Lower highs and lows since Feb 2.  Remember, in a pump and dump, you have to actually dump to make a profit. Bearish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": -0.6486,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9991010427474976
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-02-16T19:13:00Z",
        "content": "$SPY $QQQ $UPRO $SPXS $SPXU $SPXL $UVXY \nBuying drying up.  Remember, in a pump and dump, you need to actually dump to lock in profits.  And if you're late to the pump, you'll end up a bitter bag holder. Bearish",
        "sentiment": {
            "TextBlob": -0.13333333333333333,
            "NLTK": -0.6249,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9987762570381165
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-02-16T18:32:07Z",
        "content": "$QQQ $SPY $TQQQ $SQQQ \nRemember, this pump only lasts so long, only until big funds exit all their positions.  After that, they'll stop propping up the market.  Someone's going to be left holding the bag and without a chair after the pump is over.  In order to make money in pumps and dumps, you need to actually sell to lock in profits. Bearish",
        "sentiment": {
            "TextBlob": -0.008333333333333333,
            "NLTK": -0.25,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9990441203117371
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-02-15T17:25:23Z",
        "content": "$SPY $SPX \nLower highs and lower lows since Feb 2.  Every pop is being dumped.  Smart money dumping while FOMO bag holders are buying after a full year's worth of gains in only a month.  Get ready for massive profit taking with more fear of Feds increasing rates back to 50 bps or prolonged 25 bps all year long. Bearish",
        "sentiment": {
            "TextBlob": 0.16825396825396824,
            "NLTK": -0.3167,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9975041747093201
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-02-15T17:20:37Z",
        "content": "$SPY $SPX \nHead and shoulders formation???? Bearish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9970756769180298
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-02-15T17:18:43Z",
        "content": "$SPY \nHead and shoulders appearing to form on the S&P???\n\n$SPX\n$UPRO\n$SPXL\n$SPXS\n$SPXU\n$SQQQ\n$TQQQ Bearish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9972426891326904
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-02-15T15:31:25Z",
        "content": "$QQQ \nDollar index DXY heading back up while stocks try to pump and dump after hot inflation.  All data like jobs, sales, and inflation says Feds haven't done enough..  Classic bull trap. $SPY to 390 at minimum.  $TQQQ to $20s, and $SQQQ to $40s.  1 full year's gain in a month.  Smart money is taking profits. Bearish",
        "sentiment": {
            "TextBlob": 0.1634920634920635,
            "NLTK": 0.765,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9975919723510742
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-02-15T15:03:03Z",
        "content": "$SPY uptrend line almost broken.  Once it's broken, all hell breaks loose. Bearish",
        "sentiment": {
            "TextBlob": -0.2923076923076923,
            "NLTK": -0.9102,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9972904920578003
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-02-15T01:47:08Z",
        "content": "$TQQQ The Nasdaq is currently forming a Falling Broadening Wedge.  When this happens, the market will move with bigger and bigger intraday swings to hit the upper and lower bound ranges of the formation, until it finds a foundation (i.e. most likely the 50% retrace at around 11,200 on the $NASDAQ $COMP , and then rally back up, breaking the upper bound resistance and make higher highs.  I expect profit taking to take us down within the next week or two, and then after a solid base is formed for a week or two, we'll move back up to make higher highs.  The reason is the market cannot do 100% gains without healthy pullbacks.  We already did 1 year's worth of gains in 1 month.  Smart people and traders will take profit.  Right now it's smart to be in $SQQQ to gain on the expected pull back before switching back to $TQQQ.  The $SPY  should hit 390 for a pull back as well. Bearish",
        "sentiment": {
            "TextBlob": 0.06078042328042326,
            "NLTK": 0.877,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9917130470275879
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-02-14T19:09:57Z",
        "content": "$QQQ\nThis manipulation pump and dump isn't going to end well.  While retail is tricked and confused into bag holding, big funds are dumping furiously.  When they finally stop propping this up, the panic selling will be hilarious. Bearish",
        "sentiment": {
            "TextBlob": 0.024999999999999994,
            "NLTK": -0.9118,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9902117848396301
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-02-14T17:49:26Z",
        "content": "$TQQQ \nHope no one was dumb enough to buy this morning on the manipulation pump and dump.  Trend is down for the $NASDAQ $COMPQ .  Don't let the manipulation pump fool you to bag hold.  $SQQQ to $40+ once earnings hype is over.  Lower highs, lower lows. Bearish",
        "sentiment": {
            "TextBlob": -0.17685185185185184,
            "NLTK": -0.9403,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.998754620552063
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-02-14T17:09:28Z",
        "content": "$SQQQ \nPortfolio up big trading the manipulation and volatility better than a pro.  Up huge YTD.  $TQQQ going down to $20s and $SQQQ to $40s.  $NASDAQ heading to 11,200 for 50% retrace while $SPY to 390.  Don't let the manipulation fool you guys.  Trend is down since Feb 2.  No more catalyst with all the bad news, profit taking shall continue until mid/late March for the next earnings run-up hype. Bearish",
        "sentiment": {
            "TextBlob": -0.04513888888888885,
            "NLTK": -0.5994,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9983929991722107
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-02-14T05:53:14Z",
        "content": "$TQQQ \nTrend is down. Hope you guys got out $25 today.  Need a healthy pullback to 11,200 on the $NASDAQ to continue the uptrend.  1 year's worth of gains in 1 month, smart money is taking profit.  Up big YTD trading the volatility.  Already closed my calls I bought late Thursday and intraday lows Friday for a fat profit today and jumped back into $SQQQ .  Buy the hype, sell the news.  Lower highs, lower lows. Bearish",
        "sentiment": {
            "TextBlob": 0.05734126984126984,
            "NLTK": 0.886,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9984362721443176
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2023-02-12T05:19:08Z",
        "content": "$TQQQ \nUp big in 2023 trading $TQQQ and $SQQQ shares, calls and puts, riding the volatility to massive profit up or down.  Truly a trader's dream.  Hoping for one more dead cat bounce Monday before possibly a big dump for Tuesday's elevated CPI.  Plus I think we need a healthy pullback to $NASDAQ  11,200 and $SPX 3,960 to continue the uptrend.",
        "sentiment": {
            "TextBlob": 0.09206349206349206,
            "NLTK": 0.7436,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9374457597732544
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2022-12-05T08:13:20Z",
        "content": "$XPEV \nPanic covering and FOMO chasing now.  Best part?  This is only the beginning.  MASSIVE rally 100% gains from here.  Zero resistance.  I'm seldom wrong. Bullish",
        "sentiment": {
            "TextBlob": 0.125,
            "NLTK": 0.7054,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9323237538337708
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2022-12-05T08:00:58Z",
        "content": "$XPEV Shorts are seriously fooked.  Beautiful chart.  100% gains from here.  Hopefully no one shorted under $7 LMAO! Bullish",
        "sentiment": {
            "TextBlob": 0.4222222222222222,
            "NLTK": 0.9006,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.8839184641838074
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2022-12-05T06:26:05Z",
        "content": "@SupremeLeaderKimJunUn\n\nPlus bro, I'm damn good at charts.  $XPEV has no resistance until $20.  It's going to be a wild ride up. Bullish",
        "sentiment": {
            "TextBlob": 0.39999999999999997,
            "NLTK": -0.25,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9968140721321106
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2022-12-05T06:24:14Z",
        "content": "@SupremeLeaderKimJunUn \nBut I have to admit, last month I was bearish because the CCP had been destroying tech, and I thought leaked news of easing was a pump and dump.  I didn't short, but only watched Chinese stocks tank all year.  However, after the protests and word of China's economy being the worst since the Cultural Revolution, and Putin losing the war, I realized it was real and bought in.  Now I'm up big, like I'm up big riding $TQQQ calls and shares trading the past few months. Bullish",
        "sentiment": {
            "TextBlob": -0.11249999999999999,
            "NLTK": -0.965,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9811754822731018
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2022-12-05T06:16:19Z",
        "content": "$XPEV \nWe know who the shorts are who are holding tons of worthless puts because they're showing their desperation, bitterness and anger.  A short, caught on camera.  LoL Bullish",
        "sentiment": {
            "TextBlob": -0.175,
            "NLTK": -0.8591,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9988754391670227
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2022-12-05T01:57:17Z",
        "content": "$XPEV $NIO $BABA \nShorts fooked.  $XPEV up massively in Hong Kong. Bullish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9984853863716125
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2022-12-04T23:20:14Z",
        "content": "$TQQQ $SQQQ $SPY $QQQ $AMZN \nBloomberg: “The stock market has probably seen the lows because we’re likely near the end of the Fed’s rate hikes,” said Eric Beiley, executive managing director of wealth management at Steward Partners Global Advisory. “As I look to next year, I do see the Fed’s policy of raising rates coming to an end, hopefully early in 2023, because these hikes are having an impact in weakening inflation numbers and a slowdown in the global economy.”\n\nIf the market rebound since mid-October holds through December, the S&P 500 would end an otherwise tumultuous year for global money managers on a high note. The S&P 500 is up 14% since the end of September and on pace for its best fourth quarter since 1999.\n\nPART 1 OF 2 Bullish",
        "sentiment": {
            "TextBlob": 0.13599999999999998,
            "NLTK": 0.7906,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9961429238319397
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2022-12-04T20:44:02Z",
        "content": "$XPEV $NIO $BABA \nThe Hang Seng had the best month since 1998.  That's before some of you were born lol.  Shorts got fooked big time.  Best part is it'll continue rallying.  Bears Be Broke.  BBB!",
        "sentiment": {
            "TextBlob": 0.7,
            "NLTK": 0.8655,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9503203630447388
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2022-12-04T20:13:00Z",
        "content": "$TQQQ $SQQQ $SPY $QQQ \nGas only 5 cents from last year!  CPI going to be low.  Another +7% day next week after CPI released. Bullish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": -0.3382,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9996509552001953
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2022-12-04T20:00:26Z",
        "content": "$XPEV $NIO $TQQQ $SPY $QQQ $YINN \nChinese stocks have rallied recently, fueled by rising optimism that China is softening its pursuit of Zero Covid. In Hong Kong, the Hang Seng China Enterprises Index surged 29% in November, capping its best month since 2003, while the benchmark Hang Seng Index posted its biggest monthly gain since 1998. \n\nThat was from Bloomberg.  DOW Jones recently had the most epic month in decades.  Nasdaq and S&P next.\n\nTranslation: Bears missed out and broke as a joke. Bullish",
        "sentiment": {
            "TextBlob": 0.2285714285714286,
            "NLTK": 0.8519,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.6303056478500366
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2022-12-04T19:36:27Z",
        "content": "$XPEV $NIO $BABA $YINN $TQQQ $SPY $QQQ \nBloomberg: \"Chinese stocks have rallied recently, fueled by rising optimism that China is softening its pursuit of Zero Covid. In Hong Kong, the Hang Seng China Enterprises Index surged 29% in November, capping its best month since 2003, while the benchmark Hang Seng Index posted its biggest monthly gain since 1998.\"\n\nThe DOW Jones recently had the most epic month in decades.  Next up: The Nasdaq.\n\nTranslation: Bears Be Broke. Bullish",
        "sentiment": {
            "TextBlob": 0.2285714285714286,
            "NLTK": 0.8519,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9752854704856873
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2022-12-04T18:25:46Z",
        "content": "$XPEV $NIO $TQQQ $SPY $QQQ \nXi just acknowledged zero COVID will be eased. Inflation going to ease and world, US and especially Chinese market going to rally hard. The rally will be so epic shorts will be completely decimated. Furthermore, WSJ reports Apple going to move production out of China. This coupled with Putin losing the war going to drastically reduce inflation next year. All flipn' time highs are going to wipe shorts clean. The MASSIVE short squeeze in the Nasdaq will lead the way back up. Bullish",
        "sentiment": {
            "TextBlob": 0.030555555555555558,
            "NLTK": -0.128,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.998264491558075
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2022-12-04T13:16:57Z",
        "content": "$AAPL $TQQQ $SPY $QQQ $SQQQ $NASDAQ  \n\nApple has hastened plans to move part of its production out of China, home to the world's largest iPhone factory, according to a The Wall Street Journal.\n\nXi will have no choice but to ease zero COVID.  Market going to rally hard. Bullish",
        "sentiment": {
            "TextBlob": -0.2916666666666667,
            "NLTK": 0.2617,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9993581175804138
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2022-12-04T03:06:16Z",
        "content": "@GenX_Bagholder @ericha \nMeant to say no need to hedge losing positions where you have to PAY for the position.  With covered calls, you get the premium up front and decay works for you, assuming you sell them after big rallies and close them out in red selloff days.  I miss $TVIX.  $UVXY you lose on decay unless the S&P tanks hard, which it hasn't done so lately and appears to be ready to break out of its 1 year downtrend.",
        "sentiment": {
            "TextBlob": -0.07833333333333334,
            "NLTK": -0.9106,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9994565844535828
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2022-12-04T02:49:39Z",
        "content": "@JimmyBuffett @Shooter_McGav @Shooter_McGav \nAgreed.  Comparing $TQQQ to $UVXY is like comparing apples to rocks.",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.5574,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9618946313858032
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2022-12-04T02:46:27Z",
        "content": "@OneBabyBuffalo \nBro, this ETF will go to zero eventually.  Don't bag hold from the bottoms.  You have been warned.  Better to accumulate $TQQQ long term.",
        "sentiment": {
            "TextBlob": 0.225,
            "NLTK": 0.2023,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9996589422225952
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2022-12-04T02:44:11Z",
        "content": "@Albear69b \nBear market is over.  Bull is here.  Safer to buy $TQQQ on dips. Bullish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.4215,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9992700219154358
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2022-12-04T02:43:02Z",
        "content": "@ericha \n\nNo need to hedge.  You're better off selling covered calls on your long positions a few strikes up and a few months out and collecting the premiums and then buying more shares with it.  Holding inverse ETFs when the Feds are about to slow down rate hikes is like burning your money.  $UVXY decay is horrible.  You're better off shorting it.",
        "sentiment": {
            "TextBlob": -0.04506172839506173,
            "NLTK": -0.0276,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9995887875556946
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2022-12-04T00:32:24Z",
        "content": "$TQQQ $SPY $NASDAQ $COMPQ $QQQ $SPX $SQQQ \n\nHere's some advice. Short the lows, you'll lose money when the market continues to new all time highs (expected in 2023). You'll have less money AND you'll be FOMO panic buying very expensive prices.\n\nBuy the lows, you'll be worrying if the market tanks. But hold long enough and you'll be fine.\n\nBuy the lows, and sell covered calls a few strikes up and a few months out, if the market continues up, you gain the share price appreciation AND capture covered call premiums. You can buy more shares with it or roll over covered calls higher and further out to capture more premium. If the market tanks, you can buy covered calls back cheap, locking in profits, and then buy more shares with the premium. Win/win. Basic math.\n\nYou're welcome guys. I care, that's why I share. Bullish",
        "sentiment": {
            "TextBlob": 0.11244019138755983,
            "NLTK": 0.9788,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9548173546791077
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2022-12-03T22:38:57Z",
        "content": "@WallStreetBuyDip \n\nGood job!  Now the real question is, what's your total compounded rate of return?  Also, playing that many tickers can get tricky when bad news comes out.  I prefer trading index-related tickers only and holding a few days for the trend, but will hit certain stocks if it's sold off too much, too soon.  You day trading and not holding overnight, or you holding for a few days?\n\nI'm trading almost exclusively $TQQQ and $SQQQ only and did over 100% returns for my kids Roth IRAs, which I started on August 1. Bullish",
        "sentiment": {
            "TextBlob": 0.08084415584415586,
            "NLTK": 0.477,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9944304823875427
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2022-12-03T21:55:05Z",
        "content": "$TQQQ $SPY $NASDAQ $COMPQ \n\nWith China officially pivoting on zero COVID and Putin losing the war, inflation will continue down drastically next year.  This coupled with strong jobs mean no recession.  This effectively translate to SOFT LANDING.  Stocks will rally hard.  Bears who didn't cover and go long like I did in October will lose all their gains from earlier in the year and some will go bankrupt.\n\nI estimate Putin will lose completely by mid to late 2023 due to US provided HIMARS destroying Russian ammo and fuel depots.  Can't fight a war without supply lines.  That's why Russia high tailed out of Kherson because of a little river.  Russia won't even be able to defend Crimea due to no easy access over the ocean once Ukraine completely destroys the bridge from Russia. Bullish",
        "sentiment": {
            "TextBlob": -0.0035277777777777838,
            "NLTK": -0.9602,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9991158843040466
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2022-12-03T21:45:50Z",
        "content": "$XPEV No resistance until $20.  But with official China pivot on zero COVID, it'll go back into the $30s by middle 2023.",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": -0.1531,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9976968169212341
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2022-12-03T21:40:52Z",
        "content": "$XPEV \nXPEV and all other Chinese stocks have a LONG ways to rally with China officially pivoting on zero COVID lockdowns.  Zero resistance until $20.  Will easily double from here.  This will also reduce inflation, and coupled with Putin losing the war from US provided HIMARS destroying Russian supply and fuel depots by next year, the entire market will rally hard back to all time highs by next year.\n\n$NIO\n$BABA\n$AAPL\n$TQQQ\n$SPY Bullish",
        "sentiment": {
            "TextBlob": -0.060606060606060615,
            "NLTK": -0.8442,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9963488578796387
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2022-12-03T21:29:02Z",
        "content": "$XPEV  More China zero COVID restrictions lifted.  Zero resistance until $20.  Should easily make this before year end and $25+ by January.  Xi is pivoting on zero COVID lockdowns because China's economy is the worst since the Cultural Revolution, before many of us were born!  Plus he no longer sees trying to help Putin by increasing inflation on the West as helpful with Putin losing the war.\n\nMASSIVE short squeeze to da moon folks.\n\ncnbc.com/2022/12/03/beijing...",
        "sentiment": {
            "TextBlob": 0.09404761904761905,
            "NLTK": -0.7345,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9991268515586853
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2022-12-01T20:39:30Z",
        "content": "$TQQQ  Sweet, I started two Roth IRAs for my children ages 6 and 9 on August 1.  After 4 months, I'm to well over 100% returns trading $TQQQ and $SQQQ by using economic conditions and chart analysis.  Consistent gains each month like a friggen pro.  Better than a pro.  The annual returns work out to be around 370%!!!   Expert trader in the hiiissoouuse!",
        "sentiment": {
            "TextBlob": 0.45,
            "NLTK": 0.9196,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9664055705070496
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2022-11-09T17:14:08Z",
        "content": "$NIO I warned you guys.  Pump and dump COVID easing hype is over.  Selloff resumes.\n\n$XPEV\n$BABA Bearish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": -0.4019,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9995075464248657
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2022-11-08T15:43:47Z",
        "content": "$NIO pump and dump hype over.  Dump commences Bearish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": -0.6369,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9953399896621704
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2022-11-08T15:42:08Z",
        "content": "Pump and dump COVID easing hype is over.  Dump commences.  52 week and all time lows coming.  Xi giving up power and control and abandoning zero COVID lockdown policies is like Putin getting on his knees and apologizing to Zelensky, Ukraine and the world for his illegal invasion and war crimes.  Not going to happen. \n\nLike these directors, Elon Musk now experiencing power and showing his true colors with his Twitter takeover.  $TSLA product and Twitter boycotts and cancellations are all the rage.\n\n$NIO\n$XPEV\n$BABA\n$JD\n$YANG\n$YINN Bearish",
        "sentiment": {
            "TextBlob": -0.07500000000000001,
            "NLTK": -0.9042,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9924156665802002
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2022-11-06T11:34:33Z",
        "content": "$XPEV  \nChina said on Saturday they're sticking UNSWERVINGLY to zero COVID lockdown policies.  Cases exponentially increased to 6 month highs.  Pump and dump hype over.  Bloodbath Monday with new all time lows coming.  Workers in world's largest iPhone manufacturing plant trying to escape from the plant. \n \n$NIO\n$BABA Bearish",
        "sentiment": {
            "TextBlob": 0.13636363636363635,
            "NLTK": -0.1531,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9984413981437683
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2022-08-29T15:43:44Z",
        "content": "$SPY  \n \nFriday's selloff was simply profit taking triggered by Powell. The fact it ran 2 year's gain in just 2 month is the real reason for the profit taking. It's like a ripe fruit, ready for the taking.  Wind blows whichever way, the fruit falls. The market is currently testing the 50% retrace down from August highs and June lows, which is 3,985.99 on the S&P 500 and 11,846.60 on the Nasdaq, or about -1% from current intraday levels. If they hold, uptrend is intact, and the market will continue to rally through end of year. \n \nHere's a chart prediction corroborating with JPMorgan saying the S&P will hit 4,800 by year end. As long as inflation trends down and jobs report is decent, it doesn't matter what Powell says or does. The market is forward looking. Uptrend trendlines concur with JPMorgran. Don't let the daily price movements fool you. The longer TREND is more important.  Selling pressures from the first part of the year are mostly diminished. \n \n$SPX\n$QQQ\n$NASDAQ\n$TQQQ Bullish",
        "sentiment": {
            "TextBlob": 0.13253968253968254,
            "NLTK": 0.8675,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9891344308853149
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2022-07-19T16:19:56Z",
        "content": "$NFLX  \n14% run-up to earnings in just a few days.  Take the money and run guys.  No shame in taking profit.  It's the only way to make money with this volatility, long or short.  \n \nLooks like intraday peak has passed. Double top spanning two days formed. Deleveraging for bad earnings will start soon, right before east coast lunch time. The only way to profit is to take profit wherever you can, long or short. Just day traders playing the predicted small % moves now. \n \n$NASDAQ\n$QQQ Bearish",
        "sentiment": {
            "TextBlob": -0.03869047619047618,
            "NLTK": 0.6124,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9994127750396729
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2022-07-19T15:58:13Z",
        "content": "$NFLX  \nFrom Whisper Earnings: \n\"Netflix (NFLX) reported 1st Quarter March 2022 earnings of $3.53 per share on revenue of $7.9 billion. The consensus earnings estimate was $2.92 per share on revenue of $7.9 billion. The Earnings Whisper number was $2.99 per share. Revenue grew 9.8% on a year-over-year basis. \n \nThe company said in its shareholders letter it expects second quarter earnings of approximately $3.00 per share on revenue of approximately $8.053 billion. The current consensus earnings estimate is $2.97 per share on revenue of $8.21 billion for the quarter ending June 30, 2022.\" \n \nLet's break this down.  We know web traffic dropped off in late Feb, meaning there was 1 month+ (March, plus a little of end of Feb) where subscribers all canceled.  In Q2, there's 3 full months where web traffic is basically stagnant.  How then can revenue still be BETTER in Q2 as in Q1?   3 full months vs 1+ month? Bearish",
        "sentiment": {
            "TextBlob": -0.024305555555555546,
            "NLTK": 0.923,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9992207288742065
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2022-07-19T15:35:01Z",
        "content": "$NFLX  \n \nWebsite traffic for Netflix for the past year.  Less customers = less website traffic.  Anyone want to guess how they'll do after hours? Bearish",
        "sentiment": {
            "TextBlob": -0.19444444444444442,
            "NLTK": 0.0772,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9973330497741699
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2022-06-03T23:29:52Z",
        "content": "$NVAX  \nYeah, 5 NVAX vaccine vs 1 placebo cases of myocarditis, all hospitalized in serious condition.  No FDA approval at this rate.   Horrible statistics, 5-15 times higher than mRNA vaccines in real world statistics. Bearish",
        "sentiment": {
            "TextBlob": -0.22083333333333333,
            "NLTK": -0.1779,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9995238780975342
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2022-06-03T23:19:56Z",
        "content": "$NVAX  \nRead the damning report directly from the FDA, and weep. \nfda.gov/media/158912/download \n \n6 cases on the NVAX vaccine side, 1 case placebo.  Of the 6 cases, only 1 can be attributed to possibly not related to the vaccine. \n \nSo the FDA believes 5 cases (vaccine) vs 1 case (placebo) for myocarditis, which is 5-15 times higher than mRNA live real world statistics from Australia, Israel and the United States. \n \nI expect the FDA to deny EUA next week.  This will surely go under $20. Bearish",
        "sentiment": {
            "TextBlob": 0.14829545454545454,
            "NLTK": -0.4215,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9989566802978516
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2022-06-03T22:17:04Z",
        "content": "$NVAX  \n \nDo some DD before you lose it all next week.  Search this in Google, and do the math, and compare to the 5 cases of myocarditis in 40K trial participants for NVAX.  FDA won't approve when there are other options available, especially when NVAX causes myocarditis 5-15 TIMES more than mRNA vaccines. Bearish",
        "sentiment": {
            "TextBlob": 0.155,
            "NLTK": -0.4019,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9984355568885803
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2022-06-03T21:13:41Z",
        "content": "$NVAX  \nOne failure after another.  NVAX destroys shareholders.  Next week, there will be many crying wondering why they didn't sell sooner. \n \nLower lows each time. Bearish",
        "sentiment": {
            "TextBlob": -0.00416666666666668,
            "NLTK": -0.8724,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9971530437469482
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2022-06-03T20:35:53Z",
        "content": "$NVAX  Next support is at $18.  After that, $4.  After FDA rejection and the rest of the world refusing to take NVAX vaccines from much higher rates of myocarditis, this sucker will head back under $10. Bearish",
        "sentiment": {
            "TextBlob": -0.012499999999999997,
            "NLTK": -0.8176,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9985143542289734
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2022-06-03T20:28:45Z",
        "content": "$NVAX  \nmRNA vaccine statistics in real world for those developing myocarditis: \n0.00213% for Israel. NVAX is 5.8 TIMES higher. \n0.00300% for Australia. NVAX is 4.2 TIMES higher. \n0.00085% for the U.S. NVAX is 14.7 TIMES higher. \n \n0.0125% for NVAX (5 out of 40K trials) \n \nThere were 6 cases of myocarditis, but the FDA doesn't think 1 of them were related to the vaccine. \nAll these cases were reported within TWO weeks of vaccination., so they weren't coincidence like happening months later. \n \nEUA will only be granted if there's no other treatment. There ARE other treatment, other vaccines, that have higher efficacy AND much, much lower myocarditis rates. There is no way the FDA will approve this just so it can scare people into not getting vaccinated. Way too many Trumptard cults already won't take vaccines.  The FDA has rejected other promising drugs that didn't have good safety profiles, including recommended not taking J&J vaccines unless you have no other choice. \n \n$PFE\n$MRNA Bearish",
        "sentiment": {
            "TextBlob": 0.15,
            "NLTK": -0.9677,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9978166818618774
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2022-05-30T07:09:57Z",
        "content": "@CrunchyTempura @OptionsTraveler Nasdaq technical bounce goes to about 13.5K, which equates to over $50+ on $TQQQ. Bullish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9987003803253174
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2022-05-30T06:36:41Z",
        "content": "$SPY Shorts are soooooo screwed \n$QQQ Bullish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": -0.4939,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9983481168746948
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2022-05-30T05:23:33Z",
        "content": "$QQQ Shorts are panicking.  Futures going higher and higher.  By the time Tuesday is here, their puts will be worthless. \n \n-Inflation has peaked in March \n-China is reopening economy and learned from their mistakes in Shanghai so they didn't need to lock down Beijing. \n-COVID supply chains are getting better, with shippers racking up more time. \n \nNasdaq future at +1.24% right now, and S&P at +60%. \n \n$SPY Bullish",
        "sentiment": {
            "TextBlob": 0.10376984126984126,
            "NLTK": -0.6597,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.999067485332489
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2022-05-30T04:17:59Z",
        "content": "$QQQ Have fun shorts who haven't covered yet. \n$SPY Bullish",
        "sentiment": {
            "TextBlob": 0.3,
            "NLTK": 0.5106,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.8223476409912109
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2022-05-30T02:41:55Z",
        "content": "$SPY  \n \nIf you look back at the last 50 years of history, to the 70s, when Core PCE goes up, stocks go down. When Core PCE peaks and heads down, stocks go up. It's no coincidence. Core PCE peaked in March. Inflation started in May, 2021. Since this figure is measured year over year, that means in May, 2022 (reported next month) the denominator (i.e. the inflation value from May 2021) will be on the bottom of the equation. This increasing denominator causes the new/current Core PCE value to go down. \n \nIn other words, Core PCE is going to decrease over time.  Many experts see inflation at 2-3% by mid-2023.  History says the stock market will go up. \n \nI dare you all to do some due diligence and you will see. The truth shall open your eyes and show you the error of your ways.  \n  \nLots of people are missing the bottom, and will regret big when we're at the all time highs again.  Only after it's bottomed will we see articles talking about the bottom LOL. \n \n$AMZN\n$TQQQ Bullish",
        "sentiment": {
            "TextBlob": 0.027380952380952374,
            "NLTK": 0.186,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9969502091407776
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2022-05-30T02:31:30Z",
        "content": "$AAPL  \nChina reopening.  Futures ripping.  By Tuesday's opening, futures will be much, much higher.  Shorts are totally screwed. \n \nCore PCE inflation peaked in March.  History says when inflation has peaked, stocks go up. Bullish",
        "sentiment": {
            "TextBlob": 0.125,
            "NLTK": -0.5413,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9995443224906921
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2022-05-30T02:22:58Z",
        "content": "$NASDAQ Bullish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9989686012268066
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2022-05-30T02:22:10Z",
        "content": "$NASDAQ  \n \nIf you look back at the last 50 years of history, to the 70s, when Core PCE goes up, stocks go down. When Core PCE peaks and heads down, stocks go up. It's no coincidence. Core PCE peaked in March. Inflation started in May, 2021. Since this figure is measured year over year, that means in May, 2022 (reported next month) the denominator (i.e. the inflation value from May 2021) will be on the bottom of the equation. This increasing denominator causes the new/current Core PCE value to go down. In other words, Core PCE is going to decrease over time. History says the stock market will go up. I dare you all to do some due diligence and you will see. The truth shall open your eyes and show you the error of your ways. \n \nLots of people are missing the bottom, and will regret big when we're at the all time highs again. \n \n$SPY\n$QQQ\n$TQQQ\n$AAPL\n$AMZN Bullish",
        "sentiment": {
            "TextBlob": -0.08333333333333334,
            "NLTK": -0.4215,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9968634843826294
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2022-05-30T02:07:33Z",
        "content": "$AMZN  \n \nI did some more research on Core PCE year over year vs how the stock market did since the 1970s inflation.  Here's what I found: \n \ntwitter.com/lose2win_trades... \n \nThe market most likely have bottomed with Core PCE peaking in March and trending down.  History says the market goes down when Core PCE goes up, and when Core  PCE peaks and heads down, stocks go back up. \n \nWith China reopening, inflation will continue down.  China is also getting better at dealing with infections, as evident from Beijing not having to lock down like Shanghai.  Companies like Apple and Tesla will recover. \n \nBy the time everyone and their mommas realize the bottom's in, it'll have been too late to get in during the bottoms. \n \n$AAPL\n$GOOG\n$NASDAQ\n$TSLA\n$SPY\n$SPX\n$RUT Bullish",
        "sentiment": {
            "TextBlob": 0.05601851851851852,
            "NLTK": 0.7845,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9995759129524231
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2022-05-27T13:57:15Z",
        "content": "$NASDAQ  \n \nPANIC BUYING and covering for the next few weeks as China reopens and inflation starts trending down. Minimum Nasdaq 13K and S&P 4.4K. And if inflation continues to die down over time to 2% as some expects it to by mid 2023, we could very well have seen the lows of the year as stocks recover back to the all time highs again. \n \nTO DA MOON FOLKS! \n \nLots of longs haven't re-bought after selling off weeks or months ago, and some panic sold at the bottom.  Even more shorts haven't covered.  They'll propel us to the moon. \n \n$SPY\n$SPX\n$DJIA\n$RUT\n$TQQQ\n$UPRO Bullish",
        "sentiment": {
            "TextBlob": 0.023611111111111104,
            "NLTK": -0.8986,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.998433530330658
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2022-05-24T09:32:41Z",
        "content": "Web traffic predicted $NFLX and $AMZN would tank after earnings. Since Amazon reported, they can obviously see how much worse its gotten.  How long do you think until Amazon management warn shareholders like $SNAP did?  If they know some material event, they are required to inform investors, or face lawsuits. So will they simply surprise the next loss report (not earnings, but loss)? Or do they warn first? And how deep do you guys think the sell off will be if they chose to warn? \n \nTheir Q1 earnings included Jan, Feb, Mar, and since Russia invaded Ukraine at the end of Feb, only higher inflation from Putin for the month of March was really included in that Q1 earnings, meaning damage was minimal. But next quarter's report will include 3 FULL MONTHS of inflation from Russia's invasion AND 2 full months of Shanghai lockdowns. How bad do you guys think the loss report will be?  Don't say you weren't warned. Bearish",
        "sentiment": {
            "TextBlob": 0.010000000000000009,
            "NLTK": -0.9342,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9996312856674194
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2022-05-24T09:07:25Z",
        "content": "$TSLA Let's be honest.  How much losses can Tesla handle when China repeatedly locks down Shanghai in the future intermittently each time the coronavirus hits their 25 million population who are within inches of each other in proximity in public?  If they lock down Shanghai 2 months out of the year, or 4 months out of the year, what happens? Bearish",
        "sentiment": {
            "TextBlob": 0.05198412698412699,
            "NLTK": 0.2406,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9974820017814636
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2022-05-24T08:55:37Z",
        "content": "$BBY Best Buy website traffic is down almost -60% from a year ago, from the 12 million visitors (customers) per day, down to under 5 million customers per day as of the end of May. Customers dropped off after Christmas from rising inflation, but really accelerated after Russia invaded Ukraine and oil prices spiked. The same thing happened to $AMZN, $NFLX and a host of other companies. \n \nThe problem is Putin shows no signs of stopping anytime soon, and China's unwavering zero COVID policy which Xi doubled down on, where hundreds of millions of people locked down for months at a time for the foreseeable future, only ensures inflation remains, forcing Feds to keep raising rates aggressively to trigger a recession to \"fix\" the demand side. \n \nOnline schools being canceled and workers being told to come back into offices mean less Chromebooks, home offices, and iPads are going to be bought, dragging down $AAPL, $GOOG Bearish",
        "sentiment": {
            "TextBlob": -0.012996031746031752,
            "NLTK": -0.9194,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9989544153213501
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2022-05-24T07:19:14Z",
        "content": "$SNAP  \n \nWait until indices have dropped below -50% to buy.  Thank me later. Bearish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.3612,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9845811724662781
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2022-05-24T01:23:18Z",
        "content": "@fkyocouch22  \nYep, tech already tanked AH from $SNAP.  $BBY might contribute to another -5% day.  Sell the rips. Bearish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.296,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9977115392684937
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2022-05-24T01:04:34Z",
        "content": "$BBY  Last year's earnings for this quarter was: \n \n$11.64 billion revenue \n$595 million net profit \n \nAnalysts are expecting: \n \n$10.44 billion revenue \n$139.7 million net profit (EPS 1.61) \n \nPer website traffic (average about 55% lower than last year if accounting the entire current quarter average web traffic), the revenue could come as low as $6.91 billion \n \nThe math:  $11.64 billion x 0.55 x 1.08 = $6.91 billion (accounting for 8% inflation rise) \n \nSince their cost of revenue was $8.9 billion last year, and $WMT and $TGT both reported a higher cost of revenue similar to that of inflation, it's very possible Bad Buy will have a negative EPS.  We shall see. \n \nAccording to the charts, if this happens, we will easily see $50 if support in the high $60s don't hold.  $50 is where the last two major support held a few years ago. Bearish",
        "sentiment": {
            "TextBlob": -0.029708333333333326,
            "NLTK": 0.2075,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9981057643890381
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2022-05-24T00:31:12Z",
        "content": "$BBY Blood bath tomorrow.  Web traffic went down from 12 million visitors shopping per day to 5 million (and even dipped below that) as of the current time period.  That's like -60% DROP IN TRAFFIC!!!!!, which in the past I've used this site to calculate revenue accurately, meaning revenue will drop close to that -60% drop!  It'll benefit about 7-8% from inflation, but the lack of customers more than kills revenue and profit.  \n  \nPeople stopped buying stuff after Christmas, but then the Ukraine invasion guaranteed even more people stopped buying junk they don't need as oil prices skyrocketed.  \n  \nWill only get worse from here with the U.S. canceling online schools and some companies cancel work from home. Bearish",
        "sentiment": {
            "TextBlob": 0.08680555555555557,
            "NLTK": -0.952,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9994127750396729
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2022-05-23T23:49:16Z",
        "content": "$SNAP They warned during the earnings release \"In the latter portion of Q1, advertisers in a wider variety of industry groups reported concerns related to the macro operating environment, including continued supply chain disruptions rising input costs, economic concerns due to rising interest rates, and concerns related to geopolitical risks stemming from the war in Ukraine. \" \n \nThis means companies are paying less to advertise, pulling back advertisement altogether, or choosing smaller packages.  Any company making revenue off ads (i.e. tech growth stocks like $GOOGL, $META, $TWTR.P etc.) will suffer tomorrow and for the foreseeable future.  \n \nBear market to continue through the end of the year and into next year until a deep recession or depression kills the demand side and equalizes the SUPPLY = DEMAND equation. Bearish",
        "sentiment": {
            "TextBlob": -0.008333333333333331,
            "NLTK": -0.9561,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9972820281982422
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2022-05-23T23:19:03Z",
        "content": "$SNAP anyone bag holding from above $75?  Just curious.  Once the deep recession or depression hits, we should see under $5. Bearish",
        "sentiment": {
            "TextBlob": -0.03333333333333333,
            "NLTK": -0.6369,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9976381063461304
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2022-05-23T23:01:05Z",
        "content": "$SNAP  \n \nIn bull markets, buy the dip. \nIn bear markets, sell the rips. \n \nThis will continue until next year, at which point a deep recession or depression ensues, and then we'll see the real panic selling before it bottoms. \n \nHave fun bag holding.  China (zero COVID policy lockdowns) and Russia (invasion of Ukraine) will continue creating inflation for the rest of the world, destroying the supply side, as they continue their economic war with the West. \n \nFeds stand powerless except to raise rates until they completely destroy the demand side to make the SUPPLY = DEMAND equation balance out. Bearish",
        "sentiment": {
            "TextBlob": -0.025,
            "NLTK": -0.9712,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9984477758407593
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2022-05-23T22:57:04Z",
        "content": "$SNAP  Guys, just look at Amazon web traffic.  It's down BIG time.  Last earnings only included 1 month of Ukraine invasion effects of less customers going online.  Next quarter will include 3 full months of Ukraine invasion AND 2 full months of Shanghai lockdowns.  It's only going to get worse.   \n   \nBest Buy web traffic is down -60% from last year!!!  This will affect  Google and Apple, and any TV manufacturers as Best Buy sells Chromebooks and iPads for online school, which many are now going back to on-premise.   \n   \nAll of this is affecting consumers and companies like SNAP.   \n   \nThe pain and bear market will continue all year.  Sell the rips.  Wait until the indices are at least -50% before buying for long term.  Don't be a remorseful bag holder when you can buy lower, for more shares. \n \n$AAPL\n$BBY\n$GOOG\n$GOOGL\n$AMZN\n$SPX\n$NASDAQ\n$SPY Bearish",
        "sentiment": {
            "TextBlob": 0.1301169590643275,
            "NLTK": 0.8416,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9993952512741089
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2022-05-23T22:53:33Z",
        "content": "$SNAP \n Guys, just look at $AMZN web traffic.  It's down BIG time.  Last earnings only included 1 month of Ukraine invasion effects of less customers going online.  Next quarter will include 3 full months of Ukraine invasion AND 2 full months of Shanghai lockdowns.  It's only going to get worse.  \n  \n$BBY web traffic is down -60% from last year!!!  This will affect  \n$GOOG, $GOOGL and $AAPL  and any TV manufacturers as Best Buy sells Chromebooks and iPads for online school, which many are now going back to on-premise.  \n  \nAll of this is affecting consumers and companies like SNAP.  \n  \nThe pain and bear market will continue all year.  Sell the rips.  Wait until the indices are at least -50% before buying for long term.  Don't be a remorseful bag holder when you can buy lower, for more shares. Bearish",
        "sentiment": {
            "TextBlob": 0.0817901234567901,
            "NLTK": 0.4828,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9991391897201538
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2022-05-23T22:50:59Z",
        "content": "$SNAP Guys, just look at $AMZN web traffic.  It's down BIG time.  Last earnings only included 1 month of Ukraine invasion effects of less customers going online.  Next quarter will include 3 full months of Ukraine invasion AND 2 full months of Shanghai lockdowns.  It's only going to get worse. \n \n$BBY web traffic is down -60% from last year!!!  This will affect $GOOG $GOOGL and $AAPL, and any TV manufacturers as Best Buy sells Chromebooks and iPads for online school, which many are now going back to on-premise. \n \nAll of this is affecting consumers and companies like SNAP. \n \nThe pain and bear market will continue all year.  Sell the rips.  Wait until the indices are at least -50% before buying for long term.  Don't be a bag holder. Bearish",
        "sentiment": {
            "TextBlob": 0.05718954248366011,
            "NLTK": 0.2905,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9991171956062317
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2022-05-23T21:52:13Z",
        "content": "$AMZN  As I have proven, and warned before the earnings miss, web traffic showed the month of March had a huge reduction in customers going on their website to shop.  Well, web traffic says even more people stopped shopping on Amazon since April, and the trend continues down.  That means next quarter is going to show an even bigger organic loss. \n \nPer the charts, support is at around $1,800.  It *WILL* fall back down here for support.  Once people start realizing this inflation is here to stay with China's unwavering zero COVID policy and Putin not giving up on his war on Ukraine, Feds will have to be forced to raise rates until we see a deep recession or even a depression under the right conditions.  Once $1,800 falls, there's some minor support at $1,400, and then it's straight down to $1,000.  I suspect we'll see this once the deep recession/depression hits sometime late next year. Bearish",
        "sentiment": {
            "TextBlob": 0.016815476190476197,
            "NLTK": -0.8662,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9991484880447388
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2022-05-23T21:29:42Z",
        "content": "$AMZN  \n \nSell the rips, don't bag hold the dips.  Web traffic warning next quarter's earnings will be even worse.  Instead of only including 1 month of dramatically less buyers, it'll include 3 full months. \n \nwolframalpha.com/input?i=am... Bearish",
        "sentiment": {
            "TextBlob": -0.043333333333333335,
            "NLTK": -0.6705,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9997009038925171
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2022-05-23T21:25:27Z",
        "content": "$AMZN Remember, sell the rips, do not bag hold or suffer the consequences on their next loss report.  Their first quarter loss report was barely effected because it only included 1 month of the Ukrainian invasion (March, the yellow highlight).  \n  \nSince their earnings, web traffic to Amazon has dropped considerably (red highlight) by at least -25% from the highs.  Next time they report their loss again, it'll include not only 1 month of high oil prices from Russia's invasion, but a FULL THREE MONTHS.  To make matters worse, it'll also include TWO MONTHS of Shanghai lockdowns.  \n  \nDiesel prices have nearly doubled from a year ago, from $3.178 to $5.554 average today, and as you know diesel is used for big rigs to transport goods, as well as for shipping.  \n  \nAll the indices will need to drop at least MINIMUM -50% from all time highs to be even remotely investable in this environment.  Good chance we'll see -70% by next year. \n \n$SPX\n$SPY\n$NASDAQ\n$QQQ\n$RUT\n$DJIA Bearish",
        "sentiment": {
            "TextBlob": 0.01894736842105263,
            "NLTK": -0.3612,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9978975057601929
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2022-05-23T21:22:42Z",
        "content": "$AMZN  \n \nRemember, sell the rips, do not bag hold or suffer the consequences on their next loss report.  Their first quarter loss report was barely effected because it only included 1 month of the Ukrainian invasion (March, the yellow highlight). \n \nSince their earnings, web traffic to Amazon has dropped considerably (red highlight) by at least -25% from the highs.  Next time they report their loss again, it'll include not only 1 month of high oil prices from Russia's invasion, but a FULL THREE MONTHS.  To make matters worse, it'll also include TWO MONTHS of Shanghai lockdowns. \n \nDiesel prices have nearly doubled from a year ago, from $3.178 to $5.554 average today, and as you know diesel is used for big rigs to transport goods, as well as for shipping. \n \nAll the indices $SPX $SPY $NASDAQ $QQQ $RUT $DJIA will need to drop at least MINIMUM -50% from all time highs to be even remotely investable in this environment.  Good chance we'll see -70% by next year. Bearish",
        "sentiment": {
            "TextBlob": 0.01894736842105263,
            "NLTK": -0.3612,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9975486397743225
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2022-05-23T21:13:54Z",
        "content": "@DrixGod  \n \nI've used it to closely approximate earnings accurately for $WISH and $AMZN, as well as $NFLX.  Website traffic includes people going online to shop AND using mobile apps since mobile apps make API calls to the same web addresses.  It doesn't include foot traffic, but it's safe to say the same people going online or lack thereof should be similar to foot traffic as well. \n \nOn the contrary, if you use the website and put in AMD's web address, and click on SHOW HISTORY, you'll see their website traffic actually went up despite the war in Ukraine, which concurs with the better earnings they did.  The numbers do not lie my friend.  Best Buy's traffic/customers dropped BIG TIME. \n \nwolframalpha.com/input?i=ww... Bearish",
        "sentiment": {
            "TextBlob": 0.2,
            "NLTK": 0.9479,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9912531971931458
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2022-05-23T20:42:44Z",
        "content": "$BBY  \n \nA few weeks ago I saw an article where $WMT was paying $100K for brand-spanking-new truck drivers.  Lack of truck drivers, supply chain issues, China unwavering zero COVID policy causing intermittent months long hundreds of millions of people locked down... forever, Putin not ending his assault on Ukraine no matter how many Ukrainians or Russians die, Ukraine refusing to concede land, with the West continuing to send in just enough weapons for a long stalemate. \n \nIf China reopens, oil goes up. $WMT, $TGT, $AMZN all showed the rising cost of fuel on consumers. \n \nSupply completely destroyed, and all Feds can do is raise rates until demand is destroyed (recession/depression) to equalize equation of Supply = Demand. \n \nCompanies have only 2 options: \n \n1. Eat costs and stocks tank. \n \n-or- \n \n2. Pass costs to customers, increasing inflation, forcing Feds to keep raising rates aggressively, causing stocks to tank \n \nEither way, stocks tank. \n \nThe worst is yet to come. Bearish",
        "sentiment": {
            "TextBlob": -0.09506172839506173,
            "NLTK": -0.9764,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9992738366127014
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2022-05-23T20:27:53Z",
        "content": "$BBY  \n \nBest Buy web traffic went from about 12 million visitors per day from a year ago, to 5.1 million visitors per day by the end of this quarter they're about to report. That's almost a -60% drop! \n \nTheir quarterly report includes 3 full months since Russia invaded Ukraine and 2 months of Shanghai lockdowns.  Since the Ukraine invasion, everyone and their mom stopped buying junk they don't need.  Online schools also starting to transition to on-premise, with less Chromebooks and iPads being sold.  $AAPL and $GOOG $GOOGL no doubt will be affected too. \n \nI wouldn't be surprised to see revenue of $9+ billion, with a net loss given their cost of revenue from last year was $8.9 billion.  This is looking more and more like Bad Buy, not Best Buy. Bearish",
        "sentiment": {
            "TextBlob": 0.0984848484848485,
            "NLTK": -0.3821,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9980162382125854
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2022-05-22T22:48:40Z",
        "content": "$COST  \n \nGet ready for a blood bath this week.  Costco will include earnings timeline from AFTER Russia invaded Ukraine, whereas $WMT and $TGT only included two months of the Ukraine invasion effects.  Analysts still think Costco will do the same earnings and net profit as last quarter.  Revenue should be a little higher, or flat, due to inflation, but net profit will drop bigly. \n \nSee this for more information: \n \ntwitter.com/lose2win_trades... Bearish",
        "sentiment": {
            "TextBlob": 0.05104166666666667,
            "NLTK": 0.5994,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9986779093742371
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2022-05-22T20:51:28Z",
        "content": "$AMZN  \n \nRemember when Amazon reported earnings loss in Q1?  After the Ukraine invasion, consumers stopped buying stuff they don't need because of a massive rise in oil prices, and therefore inflation.  Q1 only included ONE month of the Ukrainian invasion effects (March).  Wait until next quarter when their losses will include THREE full months of the Ukrainian invasion effects AND 2 full months of China's Shanghai lockdowns. \n \nChina's dead set on zero COVID policy, meaning the moment the virus just ticks up a few cases, they'll lock down hundreds of millions of people again.  Putin isn't giving up no matter how many Russians or Ukrainians die. The only option is Feds keep raising rates aggressively and undoing a ridiculous $9 trillion QE balance sheet to lower inflation. \n \nThe selling is nowhere close to be done.  In a bull market, you buy the dips.  In a bear market, you sell the rips. \n \nThe $NASDAQ $QQQ , $SPX $SPY and other indices will need to fall -50% at MINIMUM. Bearish",
        "sentiment": {
            "TextBlob": 0.015509259259259256,
            "NLTK": -0.9609,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9993570446968079
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2022-04-28T20:06:33Z",
        "content": "$AMZN LMAO I told you dum dums to sell before the close, with a massive loss of web traffic, which I already warned you guys.  Some people shouldn't be allowed near the stock market. Bearish",
        "sentiment": {
            "TextBlob": 0.2333333333333333,
            "NLTK": 0.3034,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9997610449790955
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2022-04-28T18:49:55Z",
        "content": "$AMZN  \n \nHere's a preview of Amazon earnings.  Massive web traffic tankage, just like what happened to $NFLX after the invasion of Ukraine.  People are cutting back.  $META and $TWTR.P saw users jump because people logged in to discuss the invasion.  But revenue is actually down, confirming advertisers are less willing to spend money. \n \n2 more hours until the downtrend continues. Bearish",
        "sentiment": {
            "TextBlob": -0.024603174603174596,
            "NLTK": 0.2144,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9994307160377502
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2021-10-27T18:38:54Z",
        "content": "$DWAC  Something tells me we're about to see the BIGGEST short squeeze in the history of the world.  It's going to make $GME and $AMC look like child's play. Bullish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.5994,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9665014147758484
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2021-10-25T17:02:41Z",
        "content": "$DWAC \n\nI don't like Trump, but let's do some basic math and use some common knowledge.\n\nTwitter = 200 million active users, $50 billion market cap.\nFacebook = almost 3 billion users, close to $1 TRILLION market cap.\n\nTrump will easily get 100 million active users due to right-wing believers piling on and believing ANYTHING he says (except when he told them to get the vaccine lol). He'll get another 50+ million from anti Trumpers as well as regular users who just wants to try.\n\nAt $25 billion market cap, and 37 million outstanding shares, DWAC is worth almost $700 per share ($25 billion market cap/$37 million shares).\n\nAt $50 billion market cap, DWAC is worth $1,350 per share. That's well over 1,000% gains from here.\n\nOn top of that, they don't need to spend BILLIONS a year on marketing to get and retain users.  That translates to PURE PROFIT because the expense that would normally go into that (which is a HUGE chunk of every company's costs), can go directly into PROFIT. Bullish",
        "sentiment": {
            "TextBlob": 0.18858543417366946,
            "NLTK": 0.9936,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9363725781440735
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2021-10-25T16:53:53Z",
        "content": "$DWAC \nGet the DWACW warrants.  They give you 5 years to exercise at $11.50.  Here's the example:\n\n1. Buy 100 DWACW at $34.  Your cost $34 + exercise price $11.50 = $45.50\n\n2. That means if the stock price drops to $45.50 by Sept of 2022 (basically when you can exercise), you are BREAK EVEN.  Yes, you read this right.  Even if the stock price is cut in half, you are BREAK EVEN.\n\n3. If the stock price stays at $98 by then, you'll make $98 - $45.50= $52.50.  Multiply by 100 if you buy 100 lots and that's $5,250 PROFIT.\n\n4. If the stock price goes BELOW $45.50 by Sept, 2022, then you'll finally technically lose money, on paper.  But you have FIVE YEARS to wait for it to appreciate.\n\n5. If it goes to $1,000 as I expect with loyal Trump supporters, you're looking at $1K - $45.50 = $954.50 profit PER share, or x 100 = $95,450 PROFIT. Bullish",
        "sentiment": {
            "TextBlob": 0.09047619047619046,
            "NLTK": 0.9774,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9983928799629211
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2021-10-25T13:42:19Z",
        "content": "$DWAC \n\nI don't like Trump, but let's do some basic math and use some common knowledge.\n\nTwitter = 200 million active users, $50 billion market cap.\nFacebook = almost 3 billion users, close to $1 TRILLION market cap.\n\nTrump will easily get 100 million active users due to right-wing believers piling on and believing ANYTHING he says (except when he told them to get the vaccine lol). He'll get another 50+ million from anti Trumpers as well as regular users who just wants to try.\n\nAt $25 billion market cap, and 37 million outstanding shares, DWAC is worth almost $700 per share ($25 billion market cap/$37 million shares).\n\nAt $50 billion market cap, DWAC is worth $1,350 per share. That's well over 1,000% gains from here.\n\nOn top of that, they don't need to spend BILLIONS a year on marketing to get and retain users.  That translates to PURE PROFIT because the expense that would normally go into that (which is a HUGE chunk of every company's costs), can go directly into PROFIT. Bullish",
        "sentiment": {
            "TextBlob": 0.18858543417366946,
            "NLTK": 0.9936,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9363725781440735
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2021-10-25T09:04:24Z",
        "content": "$DWAC \nI hate Trump, but I'm going to make money off him LOL.  Got in the $40s for the stock and $11s for the warrants.  This shit will be bigly YUGE because of his loyal followers.  Instant active customer base = $$$\n\nI'll use the proceeds to buy a private island before he incites an insurrection. Bullish",
        "sentiment": {
            "TextBlob": -0.08888888888888889,
            "NLTK": 0.7391,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9966416358947754
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2021-10-25T09:01:08Z",
        "content": "$DWAC Love Trump or hate Trump, this is a money maker, easily 10x bagger, even from these $90+ levels.  At least you might be able to buy a private island before Trump incites civil war LOL. Bullish",
        "sentiment": {
            "TextBlob": 0.1619047619047619,
            "NLTK": 0.368,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9913787841796875
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2021-10-25T08:57:57Z",
        "content": "$DWAC  \nLook at Twitter's active users and market cap, and then think of all Trump supporters, as well as Trump haters who'll join just to mock and reply to Trump supporters and Trump, as well as regular users who just want to try it out.  Then think about all the advertising companies who will be paying Trump's social media company a ton of money.\n\nNext, think of Trump's brand name that everyone knows him so they'll spend next to nothing on marketing costs, which is A LOT for most companies. That means this savings translates directly to PURE PROFIT.  This shit is going to be big, bigger than most people realize.\n\n$50 billion market cap like Twitter, $DWAC will be worth $1,350!\n\nEven at half that, it's worth almost $700 per share!\n\nUnfreaking believable.  What's better, the warrants trading under $DWACW are GROSSLY undervalued.  They're worth $11.50 below current stock price as they have exercise price of $11.50, have an expiration date 5 years out, & can be exercised by Sept, 2022. Bullish",
        "sentiment": {
            "TextBlob": 0.14724310776942354,
            "NLTK": 0.9453,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9907624125480652
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2021-10-25T08:42:49Z",
        "content": "$DWAC \nI don't like Trump, but let's do some basic math and use some common knowledge.\n\nTwitter = 200 million active users, $50 billion market cap.\nFacebook = almost 3 billion users, close to $1 TRILLION market cap.\n\nTrump will easily get 100 million active users due to right-wing believers piling on and believing ANYTHING he says (except when he told them to get the vaccine lol). He'll get another 50+ million from anti Trumpers as well as regular users who just wants to try.\n\nAt $25 billion market cap, and 37 million outstanding shares, DWAC is worth almost $700 per share ($25 billion market cap/$37 million shares).\n\nAt $50 billion market cap, DWAC is worth $1,350 per share. That's well over 1,000% gains from here. Bullish",
        "sentiment": {
            "TextBlob": 0.15347222222222223,
            "NLTK": 0.9847,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9809772372245789
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2021-10-05T09:05:28Z",
        "content": "$MRK $NVAX $MRNA\n\nI seriously don't know why idiots are still touting Ivermectin.  It's like touting hydroxychloroquin when everyone by now knows that shit doesn't work and was only pumped by Trump as one of his lies.\n\nHere's an Ivermectin study in Argentina from last year.  Conclusion:  \"Ivermectin had no significant effect on preventing hospitalization of patients with COVID-19. Patients who received ivermectin required invasive MVS earlier in their treatment. No significant differences were observed in any of the other secondary outcomes.\"\n\nbmcinfectdis.biomedcentral....\n\n================\n\nHere's one of the biggest Ivermectin double blind (image below), called \"Together\" trial (look it up), placebo controlled studies involving almost 1,400 people.  Ivermectin was useless so it was stopped in August, 2021 (just 2 months ago).  677 received Ivermectin.  678 given a placebo. \n\n“We found that it had no effect whatsoever on our primary outcomes,” Edward Mills said, who was co-leading the study.",
        "sentiment": {
            "TextBlob": -0.19523809523809524,
            "NLTK": -0.9498,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9996575117111206
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2021-10-04T09:44:30Z",
        "content": "$MRK Malaysia, Thailand all wants to buy, soon it'll be every country on Earth, including China. Bullish",
        "sentiment": {
            "TextBlob": 0.2,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.985558271408081
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2021-10-04T09:42:08Z",
        "content": "$MRK  Just wait until China buys 1 BILLION doses. Bullish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9992780089378357
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2021-10-04T09:32:38Z",
        "content": "@BuyVTI @Witstock @Holako Yeah I'm confident he's bag holding vaccine stocks, and other therapeutics, or he's short $MRK.  Right, if placebo deaths were 8 and molnupiravir was 5 or 6, then we can say maybe that was just random chance and a higher N number for another trial required.  8 vs 0 is as good as it gets.",
        "sentiment": {
            "TextBlob": 0.15867346938775512,
            "NLTK": 0.8625,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9933886528015137
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2021-10-04T09:23:21Z",
        "content": "@Witstock @BuyVTI @Holako Don't matter.  What matters is ZERO deaths after 29 days vs 8 expected deaths for placebo after 29 days.  Similar adverse effects, 50% reduction in hospitals, and a majority of people who took the placebo stopped taking placebo.   Doesn't take a genius to figure this out.  Good luck bag holding vaccine stocks.  They are still going to be first line of defense, but many vaccine stocks are currently very, very overvalued.  $MRNA probably heading under $100, and similar with $NVAX.",
        "sentiment": {
            "TextBlob": 0.23,
            "NLTK": 0.2325,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.999138355255127
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2021-10-04T09:09:28Z",
        "content": "$MRK \n\nWho wants the pill, and who wants the bill?  Make a decision.\n\n=======================\n\n\"A man whose father died of the virus last fall uses an Excel spreadsheet to organize the outstanding debts. It has 457 rows, one for each of his father’s bills, totaling over $1 million.\"\n\n=======================\n\n\"A COVID-19 patient who suffered a 141-day stay at a local Asante hospital generated a $3 million bill.\n\nThe almost five-month stay in the hospital included time spent on a ventilator, according to Asante Finance Director Heather Rowenhorst.\n\nShe said the patient’s insurance covered $500,000 of the bill, and Asante absorbed the rest. Asante hopes to get at least partial reimbursement from the federal government.\n\nTo protect patient privacy, Asante won’t disclose whether the patient survived the ordeal.\n\nThe $3 million COVID-19 bill is the highest yet that Asante has seen, Rowenhorst said.\n\nBut five-day stays in a hospital can typically generate $50,000 bills, she said.\" Bullish",
        "sentiment": {
            "TextBlob": 0.053333333333333344,
            "NLTK": 0.6059,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9969131946563721
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2021-10-04T07:24:20Z",
        "content": "$MRK \n\nLet's do the math.  Saves lives, prevents hospitalization, ignores variant, similar adverse reactions to placebo (meaning literally no adverse reactions as the adverse reactions were actually from COVID itself), and in fact, more than double who were on placebo \"quit\" taking placebo, meaning this drug actually helped those who were taking it.  No one died after 29 days.\n\n10 million doses by end of year.  That's 3 months.  12 months would be 40 million doses.  But they should be able to ramp this up, so probably about 60 million doses per year.  On top of that, \n\nI've heard the news mention $7K per dose.  $7K x 40 million doses a year = $280 billion revenue.  And that's not including the license agreement with 100 other countries.  Assume the drug goes for $3K, and only 50 million other doses are given to the rest of the world, that's $150 billion in revenue alone.  That's $430 billion potential ANNUAL revenue, not considering a ramp up or more purchases from other countries. Bullish",
        "sentiment": {
            "TextBlob": 0.125,
            "NLTK": -0.4854,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9985709190368652
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2021-10-04T07:06:41Z",
        "content": "$MRK  Death toll this winter will be easily 6-9K deaths per day at its height, given year over year results we're seeing.  FDA going to need all the help they can get in the form of this pill. Bullish",
        "sentiment": {
            "TextBlob": 0.43333333333333335,
            "NLTK": 0.0516,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9990002512931824
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2021-10-04T07:03:05Z",
        "content": "$MRK FDA knows the death and hospitalizations this winter will be deadly dangerous, much worse than last year.  They'll need to get this pill EUA fast to save overwhelmed hospitals and deaths. Bullish",
        "sentiment": {
            "TextBlob": -0.2,
            "NLTK": -0.7717,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9996669292449951
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2021-10-03T00:20:53Z",
        "content": "$MRK CNBC \"CNBC: \"An emergency use authorization from the FDA would make molnupiravir the first oral antiviral to combat Covid. The U.S. has agreed to purchase 1.7 million courses of molnupiravir. White House coronavirus response coordinator Jeff Zients told reporters at a briefing Friday that the government has the option of buying even more doses if the drug gets approved.\"\n\nIt'll get approved since it solves a lot of the problems like lowering hospital stays, reducing deaths, and reducing infection of others. Bullish",
        "sentiment": {
            "TextBlob": 0.25,
            "NLTK": -0.0516,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9862049221992493
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2021-10-03T00:04:23Z",
        "content": "@BuyVTI Vaccine bag holders are furiously trying to bash $MRK. Bullish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": -0.4404,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9996029734611511
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2021-10-02T23:52:30Z",
        "content": "$MRK \nHmmm, looks like molnupiravir along with another antiviral in SARS-CoV-2 infected hamsters reduced the viral load in lungs by 99.999%.\n\nThat's YUUUGGEE! Not only does it save lives and prevent hospitals from being overwhelmed, it reduces spread big time.\n\nRemember, Delta sheds 1,000 times more viral particles than prior variants, which is why vaccines were 90%+ effective against prior variants, but only about 50% effective against Delta at preventing infection because the virus particles overwhelm all the antibodies, which is why boosters were needed.\n\nTo lower the viral load means to lower the R0 value from 6-7 down to a MUCH lower, more manageable number, thus decrease spread.\n\nMost drugs only help the patient who's got COVID.  This drug helps everyone around the infected person by preventing spread by way of reducing viral particles.\n\nFDA approval cometh my friends. Bullish",
        "sentiment": {
            "TextBlob": 0.2111111111111111,
            "NLTK": 0.932,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9978792667388916
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2021-10-02T23:20:27Z",
        "content": "$MRK  FDA approval coming.  If a former commissioner calls it a game changer, then the current one should have a similar line of thinking.  Anything to lower hospitals being overwhelmed, save lives, limit the spread of the virus = big win for humanity. Bullish",
        "sentiment": {
            "TextBlob": 0.06666666666666667,
            "NLTK": 0.8442,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9988011121749878
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2021-10-02T22:54:29Z",
        "content": "$MRK Naysayers/shorters, WHEN (not IF) you develop COVID, are you going to take the pill?  Yes/No?\n\nBashing here much, but I bet you'll be begging your doctors to prescribe the pill for you.\n\nWhen death comes a'knockn', to the pill you'll be a'flockn'.\n\nNews just getting out to the masses about this drug.  Expect a rally over $120 easily.  A lot of Trumptards refuse to take the vaccine but EVERYONE will want this pill and beg for it from their doctors WHEN (not IF) they develop COVID.  We already know from Israel and multiple CDC confirmations that Delta infects the fully vaccinated as well. Bullish",
        "sentiment": {
            "TextBlob": 0.2111111111111111,
            "NLTK": -0.4431,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9984540939331055
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2021-10-01T20:23:50Z",
        "content": "$MRK $NVAX $MRNA Summary:\n\nAs you already know, some people refuse to get the vaccine.  Others had nasty side effects the first shot and refuse to get the second shot.  And yet others have \"legit\" medical or religious reasons for not getting the vaccine.  We need ALL attack vectors we can get against this virus due how how infectious it is.\n\n1. If you want to avoid the hospital about 80% of the time, but still have a chance of death, do only monoclonal antibodies.\n\n2. If you want to avoid death, but OK with hospitalization, take the molnupiravir pill.\n\n3. If you want to avoid most hospitalizations and death, get the vaccine, unless you have underlying health issues (most Americans).\n\n4. If you really want to GREATLY increase your odds of no hospitalization AND no death, get vaccinated, and if you do catch the virus, immediately take monoclonal antibodies AND take the molnupiravir pill.  Your odds of being hospitalized will be extremely low, and probability of death will be almost zero. Bullish",
        "sentiment": {
            "TextBlob": 0.125,
            "NLTK": -0.9889,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9992644190788269
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2021-10-01T19:27:13Z",
        "content": "$MRK $NVAX \n\nLook at this asshat spreading misinformation. This is prime example of fake misinformation online running rampant right now with COVID and everything else.  Fucking Unreal!  His own screenshot shows \"NO DEATHS WERE REPORTED\", yet he claimed 7.3% deaths on the Merck arm.  That 7.3% is the percent of hospitalized on the  molnupiravir arm, while on the placebo arm, 14.1% were hospitalized.\n\nALL his points were all fake and wrong.  I replied with fact checking (see my response screenshot in my own reply here)",
        "sentiment": {
            "TextBlob": -0.10918367346938776,
            "NLTK": -0.9444,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9990689158439636
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2021-10-01T18:33:09Z",
        "content": "$MRK  For those who failed math, here you go:\n\nTypical death rate from COVID is 2%\n\nTotal participants = 775\nDeaths from placebo arm = 8\nDeaths from molnupiravir arm = 0\n\nAll participants UNvaccinated AND had underlying health issues\n\n8/775=1%, or half the expected death rate of the regular COVID death rate.  If 8 other people died from the molnupiravir arm, that'll make 2% death rate total.\n\nIt doesn't take a genius to figure out this drug is going to hit it big.  Unfortunately when you consider the average human being, just imagine the other half that's dumber than average.  They're the ones shorting this LMAO!!!!!!!!!!!! Bullish",
        "sentiment": {
            "TextBlob": -0.071875,
            "NLTK": -0.9827,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9997116923332214
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2021-10-01T17:55:15Z",
        "content": "@nort_lorfer $MRNA went from $30 to $400+ because of COVID my friend.",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.4939,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9977682828903198
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2021-10-01T16:27:20Z",
        "content": "90%+ of those hospitalized are UNVACCINATED.  This will cut that down by 50%, greatly helping our hospital staff.  MANY are considering quitting, and MANY going into the field are deciding NOT to go into the field.  That's really bad news guys.  But with this pill, that will change some of their minds.\n\nThat means someone who's vaccinated AND taking this pill upon becoming positive AND taking antibody treatments too = almost guaranteed to live and very low chance of hospitalization.\n\nVaccines still better than this pill (because vaccines prevent hospitalizations better), but for those reluctant to take vaccines or can't for some medical reason AND even those who takes vaccines, *WILL* benefit from this pill in the form of drastically reducing your chances of death.\n\nPlus pills are easier to manufacture than vaccines.  $MRK is a winner.  People just don't realize it yet.  It's the next $MRNA. Bullish",
        "sentiment": {
            "TextBlob": 0.21216006216006217,
            "NLTK": 0.9411,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9622904062271118
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2021-10-01T16:20:10Z",
        "content": "$MRK Many people failed basic math & can't seem to comprehend, but today's Merck news is one of the biggest in COVID-19 history.  It's up there with Pfizer's initial phase 3 results.  Allow me.\n\n-775 trial participants\n-0 (BIG FAT ZERO) deaths for those who took the pill\n-8 (EIGHT souls) dead who took placebo\n-ALL 775 trial participants were UNVACCINATED\n-ALL participants had an underlying health issue\n-7.3% of those on the pill were hospitalized\n-14.1% of those on placebo were hospitalized\n-Trial in 170 sites, including multiple countries\n-MULTIPLE variants, including Delta\n\n8/775 = 1% death for placebo\n\nU.S. COVID deaths (as of 10/1/21) = 716,867\nConfirmed Infections = 34,438,596\n\n716.9K/34.44 million = 2.1% death\n\nThis means half 775 trial participant deaths were half of the U.S. death rate as expected. If 8 people also died on the pill side, that'd be 2% total for all participants.\n\nVaccination + this pill = COVID becomes manageable & hospitals won't be overwhelmed. Bullish",
        "sentiment": {
            "TextBlob": -0.017948717948717947,
            "NLTK": -0.9847,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9811197519302368
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2021-09-25T23:24:35Z",
        "content": "$NVAX \n\nMy brother is currently fighting for his life in the ICU. He is UNvaccinated. He's in his 40s, doesn't smoke, isn't obese, doesn't have any underlying issues like diabetes.  I don't think he'll survive since he waited 2 weeks before he was forced to present himself to the hospital ER.\n\nIf he had not called to book a regular doctor's visit (after arguing multiple times with his wife over it, who's also sick with COVID at home but hasn't required hospitalization, while caring for their small children) and after learning of his symptoms where he couldn't breath + couldn't even speak, the nurse called an ambulance to his home.\n\nHe's since developed ARDS & AFib, which drastically increases chances of death.  In fact ARDS is THE main cause of COVID-19 deaths.  If he dies, he'll be leaving a widow and small children behind.  Please pray for him.\n\nMy other brother, having seen all this, is defiant as ever, refusing to vaccinate. Both brothers parroted Trump's \"flu is worse\" lie.",
        "sentiment": {
            "TextBlob": -0.1671245421245421,
            "NLTK": -0.9109,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9963985681533813
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2021-09-21T15:01:12Z",
        "content": "$EDSA No need to pump this one guys.  It'll do its own talking from saving COVID lives. Bullish",
        "sentiment": {
            "TextBlob": 0.6,
            "NLTK": -0.296,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.7930623888969421
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2021-09-21T15:00:11Z",
        "content": "$EDSA No brainer buy and hold.  Small market cap, massive reduction in deaths of critical COVID patients = basically guaranteed FDA approval. Multi bagger here. Bullish",
        "sentiment": {
            "TextBlob": -0.08333333333333333,
            "NLTK": -0.1027,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9968873858451843
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2021-09-14T21:53:33Z",
        "content": "$BTC.X \n\nBitcoin charts compared.\n\n2014\n2018\n2021\n\nWanna guess when the next spike will be?\n\nMy guess is it'll continue to sell off into 2023 & possibly late 2023 or 2024 is when it'll do another 1,000%+ run. I'll wait for under $7K, but probably start adding little by little under $10K.\n\nSee the 50% dead cat bounces, signifying a downtrend?  Looks like we just saw a dead cat bounce in Bitcoin recently.\n\nThat's what happens when there's no underlying commodity to prop up its worth. The only thing driving it is the Greater Fool Theory. Zero sum gambling game. Bearish",
        "sentiment": {
            "TextBlob": -0.061363636363636356,
            "NLTK": -0.9195,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9990333318710327
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2021-09-09T18:42:18Z",
        "content": "$HGEN As much as I feel bad for longs who bought double the price from here, I feel worse for shorts who shorted in the low $6s today. They're going to be at 100% loss WHEN it gets back to $12 LOL Bullish",
        "sentiment": {
            "TextBlob": -0.014285714285714266,
            "NLTK": -0.7556,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9997840523719788
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2021-09-09T18:33:52Z",
        "content": "$HGEN ($15 (drop from the highs) + $6 low)/2 = $10.50\n\nThat's the minimum technical bounce (i.e. 50% retrace).  But I suspect that will be the new base before ACTIV-5/BET-B trial is out.\n\nThe FDA didn't deny for poor results.  The FDA wanted more data, which is coming from that trial.  It should be close to finish with results coming out soon. Bullish",
        "sentiment": {
            "TextBlob": -0.11272727272727275,
            "NLTK": 0.474,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.997448205947876
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2021-09-09T16:08:34Z",
        "content": "$HGEN \n\nSeriously, if you are short, congrats. LOCK IN YOUR PROFITS. If you are long, lesson learned. Buy puts next time for protection, and average down. Never sell at the bottom. If you are on the sidelines, this is a great time to jump in. Results for the ACTIV-5/BET-B trial will be out probably before the year is over. The FDA didn't deny it for bad results. They simply want more data because as I PREVIOUSLY warned, the N number wasn't high enough. I would want to see a lot more people. 1,000 patients from TWO different studies will corroborate the first study. Bullish",
        "sentiment": {
            "TextBlob": 0.040902777777777795,
            "NLTK": 0.8303,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.8834509253501892
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2021-09-08T16:13:52Z",
        "content": "Sold some $TZA and $UVXY hedges I got the other day for cheap and bought other stocks like $HGEN $RDHL $INO $EDSA with it.  I thank the Almighty for a great trade and the chance to buy at these levels. Ahhhhmen. Bullish",
        "sentiment": {
            "TextBlob": 0.23750000000000002,
            "NLTK": 0.8779,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.842778205871582
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2021-09-08T01:05:40Z",
        "content": "$DOGE.X There's legit ways to make 500-800% annual returns, safely.  Why anyone would put their hard earned money in gambling this trash is unfathomable. Bearish",
        "sentiment": {
            "TextBlob": 0.10416666666666666,
            "NLTK": 0.4215,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9962769150733948
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2021-09-07T22:39:16Z",
        "content": "$DOGE.X  Any idiots continued to waste money on this trash and now deep under water, not knowing what to do? Bearish",
        "sentiment": {
            "TextBlob": -0.3333333333333333,
            "NLTK": -0.4215,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9996131062507629
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2021-09-07T22:34:08Z",
        "content": "$DOGE.X and $HOOD are both trash.  RH good for trading options because of no options fee, but other than that, not worth much else.  Dogecoin is complete trash.  You might as well pay for my trash.  At least you get something tangible to keep. Bearish",
        "sentiment": {
            "TextBlob": 0.07083333333333333,
            "NLTK": 0.103,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9997099041938782
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2021-09-07T17:28:40Z",
        "content": "$INO $RDHL $EDSA $NVAX \n\nPeople in the health care industry and those about to go into it are wanting out.  Hospitals being understaffed will get worse and worse with COVID, and medical expenses will be going up the roof, including health and life insurances.\n\nWe'll need lots of effective therapeutics and as many vaccines as we can get.  Whichever ones work best, will be standard care and going to the friggen moon. Bullish",
        "sentiment": {
            "TextBlob": 0.1857142857142857,
            "NLTK": 0.8176,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9974865913391113
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2021-09-03T17:17:53Z",
        "content": "@Shadowwatcher You're comparing apples to rocks.  The 1918 flu was transmitted to all countries basically by soldiers being transported to/from the war.  It's R0 is not that high.  It's a little higher than the seasonal flu's 1-2, but nothing like Delta at 6-7.  That exponential growth is a HUGE difference.  It's like compounding the S&P 500 gains at average 10% per year vs $UPRO at 25% a year.  In the longer run, 1% difference (1 R0) makes a HUGE difference.\n\nThis is basic math man.  Look.  The numbers do not lie.  Experts say the exact same thing I said, that even with a 100% effective vaccine, we'd need 90% of the population vaccinated to slow down Delta below R0 of 1. \n\nThese are my calculations.  Watch what the experts say (next post).  SAME SHIT AS what I'm saying, and I came to the conclusion long before I started seeing experts saying it.\n\nThe INFECTIOUSNESS (not the deaths) is the real problem. That eventually leads to more mutations & deaths.",
        "sentiment": {
            "TextBlob": 0.0953858024691358,
            "NLTK": 0.1579,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9367437958717346
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2021-09-03T04:20:30Z",
        "content": "$NVAX $EDSA $MRNA $RDHL $INO \n\nInteresting.  Statistics says the flu kills less than 1/10th of 1%, or about 0.0009% of the infected, & that COVID has killed more people in ONE year than the flu has killed people in the past TEN years, combined, suggesting people SHOULD know someone personally who died of the flu. Yet, my Twitter poll (6 days left) suggests COVID has killed more than the flu, in people's entire lifetimes. So much for \"flu is worse\".\n\nAnd long COVID appears to affect about half COVID survivors.\n\nJust recently reported is potential kidney damage to COVID survivors, even if it wasn't severe (i.e. you stayed home and didn't require oxygen).\n\nWe'll need vax boosters every 6+ months & drugs for life. That's assuming a more infectious/deadlier variant than Delta DOESN'T appear. Since we're bombarded with cosmic rays all the time, 700K infections a day x 10 billion virions = 7 QUADRILLION times the virus can mutate PER DAY. \n\nPER DAY.\n\n2.5 QUINTRILLION since pandemic started. Bullish",
        "sentiment": {
            "TextBlob": 0.02982456140350877,
            "NLTK": -0.9883,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9995988011360168
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2021-09-02T09:31:41Z",
        "content": "I bet on the virus b/c human stupidity WILL continue to spread it.  This pandemic will go on for our lifetimes due to how infectious Delta is. \n\n500K+ infections on average per day X ~500 days since the pandemic X 10 billion virions = 2.5 QUINTRILLION chances for mutation.\n\nCOSMIC RADIATION + 2.5 QUINTRILLION virus replications = 100% GUARANTEED MUTANT VARIANTS.\n\nyoutube.com/watch?v=i15ef61...\n\nJust a matter of time before new variant with mutated spike proteins like Lambda (which evades antibodies... antibodies useless against it) & as infectious as Delta.\n\nNever bet against science & math.  You'll lose every single time.\n\nMy plays:\n\n$NVAX (small market cap vs. $MRNA)\n$INO (late vaccine play.  Extremely small market cap. Vaccine can withstand room temp for a year & 98 degrees F for a month, can be given to entire globe b/c most don't have refrigeration)\n$RDHL (Results released soon).  5-10x bagger possible\n$EDSA (Results released soon.  TINY market cap at $70 million!)  100x bagger possible Bullish",
        "sentiment": {
            "TextBlob": -0.10733766233766234,
            "NLTK": -0.2244,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9970669150352478
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2021-09-02T01:35:20Z",
        "content": "@micklockwood @Tony428428 There's no helping people when they choose death. You can drag a dying cow to water, but you can't make it drink to save it's life.  It's like even if we paid flat Earthers to go on a $SPCE spaceship into orbit so they can see the Earth as round, they'll come up with some crazy conspiracy theory that the windows were CGI screens. Not kidding, read up on flat Earther websites\n\nThese clowns who failed basic math and science, math/science rejects/dropouts, are the ones who are dying.  Even on their death beds, they refuse to believe they have COVID and yell at nurses and doctors that they have some other disease. \n\nThe dumb will die off.  For those who believe in God, this is God's plan, just like how God killed off entire older generations of Israelites in the deserts of Egypt, and only allowed their descendants to reach the Promise Land.  The dumb will die & there's NOTHING we can do to stop it. At least humanity can regroup & fix global warming afterwards. Bullish",
        "sentiment": {
            "TextBlob": -0.1642156862745098,
            "NLTK": -0.9892,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9992827773094177
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2021-09-01T20:53:27Z",
        "content": "$TSLA \nChip problems?  What chip problems?!?!  No problem!  Just increase car prices.  Record sales for autos with or without chips.\n\nBuying opportunities for $TSLA $NIO $LI $XPEV (the latter which has explosive growth) Bullish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": -0.891,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9991433620452881
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2021-09-01T20:37:03Z",
        "content": "I bet on the virus b/c human stupidity WILL continue to spread it.  This pandemic will go on for our lifetimes due to how infectious Delta is. btw, NEW VARIANTS ARE OUT! Every month, new variants out. Just a matter of time before one that has mutated spike proteins like Lambda (which evades antibodies... antibodies useless against it) & as infectious as Delta. Then we're royally [insert past tense cuss word]. Might as well make money before we all die.\n\nNever bet against science & math.  You'll lose every single time.\n\nMy plays:\n\n$NVAX (small market cap, compared to $MRNA)\n$INO (late vaccine play.  Extremely small market cap.  Can do 1,000% gains from here especially b/c vaccine can withstand room temp for a year AND 98 degrees F for a month, meaning can be given to the entire global population b/c most don't have refrigeration)\n$RDHL (Results released soon).  5-10x bagger possible.\n$EDSA  (Results released soon.  Small ass market cap in the $70 million only!)  100x bagger possible Bullish",
        "sentiment": {
            "TextBlob": -0.10614718614718614,
            "NLTK": -0.8513,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9982605576515198
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2021-09-01T20:27:49Z",
        "content": "$EDSA  Small ass market cap.  When this moons, it'll moon way over $100.  No brainer put some money in this and watch what happens. Bullish",
        "sentiment": {
            "TextBlob": -0.25,
            "NLTK": -0.6908,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9972862005233765
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2021-09-01T20:26:54Z",
        "content": "$RDHL \n\nTO DA MOON!\n\nMore variants out. Bullish",
        "sentiment": {
            "TextBlob": 0.5,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9989711046218872
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2021-09-01T20:18:43Z",
        "content": "$INO \n\nNew variants are out. New variants will be out indefinitely every few months. Vaccines + theuraputics will make you filthy rich. Bet on the virus because human stupidity will ensure its spread. Bullish",
        "sentiment": {
            "TextBlob": -0.13603896103896104,
            "NLTK": 0.5106,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9979301691055298
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2021-08-31T20:39:50Z",
        "content": "@Bullrun1971 Up to you.  This is how I'm playing it:\n\na. $RDHL Buy on the dip when it goes blow $10.  When it dips low, I also buy 1-2 $10 calls for next year's expiration.\n\nb. $NVAX I assess charts daily.  Buy when in the $220s, and sell covered calls when it hits the $240s.  When it goes back into the $220s or low $230s, I buy back the covered calls for cheap to lock in free money.  Rinse and repeat. Bullish",
        "sentiment": {
            "TextBlob": 0.1,
            "NLTK": 0.2263,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9982478618621826
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2021-08-31T20:35:14Z",
        "content": "$INO Market cap too low. Once phase 3 is complete with results, which are expected to be good, this puppy will head into the double digit billions for market cap. \n\n$10 billion market cap / 210 million shares = $47+ price per share. \n\nNVAX is 17 billion market cap, and MRNA is $160 billion market cap to put this into perspective.\n\nCOVID isn't going away. I predict this pandemic to go on for our lifetimes. We'll need a vaccine arms race and COVID therapeutics to prevent hospitals from being overwhelmed multiple times a year AND all the deaths, which is coming this fall/winter, fast. Bullish",
        "sentiment": {
            "TextBlob": 0.12857142857142856,
            "NLTK": 0.6705,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9981784820556641
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2021-08-31T17:51:47Z",
        "content": "$RDHL Market cap is key, kids.  At 46.72 million outstanding shares, $10 is only $467.2 million market cap.  If the drug is effective, you're looking easily at double digit billions in market cap.  Let's assume $10 billion market cap.  That's $10 billion/50 million shares (assuming the company dilutes some to get some cash to start the sales effort) = $200 price per share, or 2,000% returns.\n\nMath and science are real guys.  The science of this virus, the mathematical probabilities of this virus with dumb idiots downplaying and disrespecting this virus spreading it ever more,  leading to more mutants, and the math of the low market cap of this company, are all real. Bullish",
        "sentiment": {
            "TextBlob": 0.10192307692307692,
            "NLTK": 0.8658,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9914504885673523
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2021-08-31T15:22:19Z",
        "content": "$RDHL and $NVAX  will moon bigly.\n\nCOVID is here to stay, with nastier and nastier variants coming out each month. The ONLY options are a vaccines arms race and COVID therapeutics to prevent hospitals being overwhelmed and a shiz ton of deaths.\n\nThis winter, I expect the surge to 500K+ new daily infections and deaths in the 7-10K daily range at peak.  99% of people out there seems to think COVID will magically disappear in April like con man Trump lied about.  I've got news for you.  This pandemic is going to last our lifetimes because of how infectious Delta was.  And more mutant variants are on the way, in just months.\n\n$RDHL working on a COVID pill that supposedly reduces hospitalization stay and mortality. Phase 2/3 out shortly. If effective, the market caps it only in the low hundred millions, it'll rocket into the double digit billions.  Easy 10-100x bagger.  At least throw $100 into it.  You could see $10K in a few years. Bullish",
        "sentiment": {
            "TextBlob": 0.11131313131313132,
            "NLTK": -0.5267,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9968023300170898
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2021-08-31T15:07:25Z",
        "content": "$RDHL  10-100x bagger, this one.  Market cap way too low.  If drug is effective, market cap will be in the billions overnight.  Simple math to figure out. Bullish",
        "sentiment": {
            "TextBlob": 0.19999999999999998,
            "NLTK": 0.25,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9995959401130676
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2021-08-31T03:19:28Z",
        "content": "@jobe \n1. With Delta being so infectious, we need ALL the vaccine types technology can afford us.  We need all the firepower we can get.\n\n2. I agree IF $INO candidate is effective, being able to withstand room temperature for a year+ AND 98 degrees F heat for a month is a gift to humanity since many countries do not have refrigeration, especially in remote places.\n\n3. Foreign particles is most likely something someone screwed up during the manufacturing process.  We see this in everyday goods, especially from China.  That's why when the FDA approves something, they try to ensure if the manufacturing QA exists.  That's why $NVAX has not applied for emergency use yet.\n\n4. DNA is robust enough to take out all the variants without need a weakness booster?  What credible research link do you have?  The fact Delta can break thru PREVIOUSLY NATURAL INFECTED IMMUNITY means no DNA vaccine is robust enough to take out all the variants.\n\nFurthermore, Lambda has ALTERED/MUTATED its\n\n(1st reply)",
        "sentiment": {
            "TextBlob": 0.15961538461538463,
            "NLTK": 0.9369,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9734391570091248
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2021-08-30T18:59:46Z",
        "content": "$PTON \n\nOnepeloton website has received more and more hits since Delta started destroying those who downplay and disrespect it. Last year around this time, the hit was around the 200 mark. Now it's already almost triple that, near 600. You know what that means for year over year revenue, right? Take a look at website hits for gym stocks. They started trending down since July when Delta broke out. This winter, peak infections per day will most likely hit half a million or more. \n\nThat means death rates will spike up as hospitals are forced to pull the plug on life support, to ready for the next COVID patient. People will quickly realize this pandemic is going to last our life times from those downplaying the virus and disrespecting it and spreading it to others. Worst part isn't the deaths, but it's all the infections WILL lead to more deadly mutants, in just months. I guess dum dum science rejects haven't learned yet.\n\nHumanity lost when Delta emerged. The Pandemic will last forever. Bullish",
        "sentiment": {
            "TextBlob": 0.06984126984126983,
            "NLTK": -0.9421,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.998601496219635
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2021-08-30T18:56:53Z",
        "content": "Vaccine stocks like $NVAX and $MRNA as well as stay at home $PTON will continue to go up as this pandemic has only just begun.  I project this winter's new cases per day will speak to well over half a million, and new daily deaths will approach 6-7K per day.  I would not be surprised to see 10K deaths.\n\nCaleb Wallace's last words in this video \"I care more about freedumb than I care about... YOUR personal health\".\n\nThere we have it folks.  Selfish man, got his wish granted to him from the coronavirus.\n\nwwlp.com/video/anti-mask-ac...\n\nThis is the text from Jessica Wallace's GoFundMe page, to pay for her husband's COVID medical bills.  It eventually turned into paying for his funeral, and for her finances since she's pregnant...  What a selfish man.  He didn't care to protect himself for himself, and he didn't care about other people's health, including his own family's. Bullish",
        "sentiment": {
            "TextBlob": 0.034292929292929285,
            "NLTK": 0.882,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9987825751304626
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2021-08-30T18:48:09Z",
        "content": "$NVAX \n\nNatural selection at work. Those who downplay and disrespect this virus will pay for it. The virus does not care. The beauty of science is it doesn't care if you believe or not. It's still true. Like wild fire with global warming, the more dumb people downplay and disrespect this virus, the faster it'll spread and mutate into deadlier forms.\n\nThis pandemic, my friends, has only just begun.\n\nktla.com/news/nationworld/3...\n$MRNA\n$PTON Bullish",
        "sentiment": {
            "TextBlob": 0.0964285714285714,
            "NLTK": -0.9178,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9671915173530579
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2021-08-27T20:45:10Z",
        "content": "$GREE \n$100 next week.  Shorts tried to manipulate the close LOL. Bullish",
        "sentiment": {
            "TextBlob": 0.4,
            "NLTK": 0.5473,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9992361068725586
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2021-08-27T16:38:58Z",
        "content": "$HOOD \nYou all know what a downtrend is, right?\n\nEveryday new bag holders jump into HOOD. What they don't seem to understand is the stock always starts off green, and then sells off. In other words, this is a downtrend. Don't mind the daily moves. Pay attention to the trend. That's more important. And the trend is currently down, for the next year as Doge gamblers lose their life savings and quit gambling one after another. \n\nHOOD will be under $20 by end of year with the rate they are losing these gambling customers. The real customer base is much, much smaller. You're better off changing all your big bills into $1 bills and burning your money. At least you'll save on heating bills. Bearish",
        "sentiment": {
            "TextBlob": 0.015095147907647908,
            "NLTK": 0.3597,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9977676868438721
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2021-08-26T22:46:28Z",
        "content": "$INO \nRecap of the case for a 10x-100x+ bagger here.\n\n1. The coronavirus is with us forever, like the measles, flu, chickenpox etc. People's downplaying and disrespecting of the 1st coronavirus led it to mutate into the highly infectious Delta variant, capable of breaking through fully vaccinated and previously infected people. This simply means more mutated variants on the way.\n\n2. We cannot make enough vaccines currently to even slow down this virus. It's just not possible. Also, the more vaccine candidates there are, the higher the probability of highly effective ones. Vaccines stand to make hundreds of billions going forward.\n\n3. Stable at room temperature for a year and 98 degrees F for 1 month is YYUUGGEE. That means it will be the vaccine of choice to vaccinate the entire planet since refrigeration is not available in remote & tropical places.\n\n(PART 1) Bullish",
        "sentiment": {
            "TextBlob": 0.0804861111111111,
            "NLTK": 0.5984,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9983306527137756
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2021-08-26T20:01:33Z",
        "content": "$HOOD Lower highs, lower lows = dead cat bounce downtrend.  See you guys below $40 next week.  You had to chance to get out.  Can't say you weren't warned. Bearish",
        "sentiment": {
            "TextBlob": -0.1,
            "NLTK": -0.7708,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9915674328804016
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2021-08-26T19:38:57Z",
        "content": "$HOOD Allah, Jehovah, Buddha or whatever deity you believe in, gave you the opportunity to sell out your trapped bags.  You didn't heed the warning and accept the gift.  You will soon find yourself in the $30s as $DOGE.X sells off back to the 20 cents and then teens level since the bulk of Robinhood's revenue came from Doge trash coin gamblers.  Worst part?  Both are going lower. Bearish",
        "sentiment": {
            "TextBlob": -0.39999999999999997,
            "NLTK": -0.0936,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.999370276927948
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2021-08-26T19:33:12Z",
        "content": "$HOOD \nCompany already warned, TWICE, that Q3 will be pathetically low in revenue because $DOGE.X gamblers are leaving, as that's what makes up the bulk of their revenue.  Dogecoin did a dead cat bounce, and then started selling off from it.  You dumb clowns know what a 50% retrace is, right?  I swear, some of you should not be allowed near the stock market for your own financial safety.\n\nWeb analytics of website hits (which includes app calls to the site) confirm massive loss of customers as well.\n\nBuying $HOOD now is like buying $TLRY at the height of its pump and dump. Bearish",
        "sentiment": {
            "TextBlob": 0.05133928571428571,
            "NLTK": -0.9062,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9996927976608276
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2021-08-26T19:25:34Z",
        "content": "$HOOD $DOGE.X \n\nTrash Bearish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9975869655609131
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2021-08-26T17:28:45Z",
        "content": "Wow Robinhood website hits (which comes from apps making direct calls to the website as well as desktop users going on the website) really do match up to this $DOGE.X.X trash coin.  No wonder Robinhood said most of their revenue came from this trash.  $HOOD really is overvalued trash right now.  Dogecoin doing a 50% technical bounce, and will be heading back lower.  Only morons are buying now.  Smart traders and trapped bag holder longs are dumping.\n\n  learntotradethemarket.com/f... Bearish",
        "sentiment": {
            "TextBlob": 0.04999999999999999,
            "NLTK": -0.4215,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9991809725761414
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2021-08-26T16:21:18Z",
        "content": "If you're stupid enough to buy $HOOD and $DOGE.X on this dead cat bounce (smart people are selling on this bounce), here's something that might help you in the future, if you can read.  Learning how to read charts is one of the most important things you can learn, both as an investor and trader.  Best times to get in, when to get out, etc.\n\nOf course, gamblers who prefer to lose money just FOMO buy, and sell for a loss, or they watch 1,000% gains turn into massive losses.  Some people really should not be allowed near the stock market.\n\nlearntotradethemarket.com/f... Bearish",
        "sentiment": {
            "TextBlob": 0.1285714285714286,
            "NLTK": -0.7033,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9912142753601074
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2021-08-26T16:18:02Z",
        "content": "Buying $HOOD and $DOGE.X is like paying real money for trash. Most of Robinhood's revenue came from DOGE, and DOGE, any intelligent person knows, is worth nothing because there's nothing of value to support it. Literally, go into the nearest dumpster, pick up a dirty, smelly garbage bag, and pay the owner $1,000 for it. It's that absurd. Thing about bubbles is that they ALL CRASH eventually. Someone's gotta bag hold though. Is that going to be you?\n\nBTW, I'm selling my trash for $1,000.  Any future homeless want to buy it????  I'll give a 5% discount to the first 5 people. Bearish",
        "sentiment": {
            "TextBlob": 0.11875000000000002,
            "NLTK": 0.2479,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9994316697120667
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2021-08-26T16:15:47Z",
        "content": "OK, 'fess up. Any idiots got trapped holding the $HOOD bag over $50 again? Did you not learn your lesson losing money from the $70s and $80s? LMAO!!!!!!!!!!!! Company warned of Q3 massive revenue losses and yet people don't learn. Amazing. Some idiots should not be allowed near the stock market.  The company warned $DOGE.X worthless trash coin transactions made up the bulk of its revenue.  DOGE is currently doing a 50% dead cat bounce and heading back down, as is $BTC.X . Bearish",
        "sentiment": {
            "TextBlob": -0.05811965811965813,
            "NLTK": -0.9673,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9992007613182068
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2021-08-25T17:49:58Z",
        "content": "$NVAX \n\n1. This virus is here to stay. Delta is infectious as F.\n\n2. The more right winged morons downplay and disrespect this virus (as well as left winged morons who think they're completely immune after taking a vaccine & start going out maskless and no longer social distancing), the more this virus will spread and mutate into even deadlier variants.\n\n3. The only options are: more vaccine boosters bi-annually or annually and therapeutics to save lives. There is no other way.\n\n4. $NVAX grossly undervalued, & heading to the freaking stars (skipping the moon). Bullish",
        "sentiment": {
            "TextBlob": 0.03179563492063491,
            "NLTK": -0.8039,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.998884379863739
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2021-08-19T01:18:46Z",
        "content": "$HOOD \nThe same gamblers buying this trash are the same gamblers Robbing Da Hood warned about: \"We experienced strong growth in new customers during the first six months of 2021,\" the filing said. \"We do not know whether, over the long term, cohorts comprised of these new customers will have the same characteristics as our prior cohorts. To the extent these new customers do not grow their cumulative net deposits or trading frequency on our platform to the same extent as new customers that joined in prior periods, our ability to expand and grow our relationship with these customers will be impacted.\"\n\nIn other words, this stock will head below $20 because the gamblers who made up the bulk of Q1 and Q2 earnings for 2021 are not long term, serious customers who actually fund their accounts, as you can see from the interest Robbing Da Hood earned was similar between 2020 and 2021.\n\nSEE YA SUCKERS BELOW $20 BY END OF YEAR Bearish",
        "sentiment": {
            "TextBlob": 0.059307359307359295,
            "NLTK": 0.7642,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.997322142124176
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2021-08-19T00:46:40Z",
        "content": "$HOOD \nAnalysts expect Q3 to be $575 million, more than Q2, with an EPS of 0.05 LOL!!!!!!!!!!!  Wait until they completely destroy that by reporting only like $200 million revenue, with a big net loss.\n\nWeb analytics confirm massive customer losses starting in June of this year, going into July, with just a blip back up from the $48K bitcoin dead cat bounce I previously already predicted.\n\nThis is going under $20 by year end. Bearish",
        "sentiment": {
            "TextBlob": 0.08484848484848485,
            "NLTK": -0.9146,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9996411800384521
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2021-08-19T00:37:16Z",
        "content": "$HOOD \nWho bought over $60?  How about $70 or $80?  C'mon, fess up.  You won't see that price again.  Robinhood IPO'd on the false premise of \"lots of users\" but admitted on July 19th these users are basically gamblers who are not like prior long term growth customers.  Longs got pumped and dumped by Robbing Da Hood, who promptly announced they'd be selling more shares at the height of the idiotic FOMO chasing not long ago above $80 LOL! \n\nImage: by Anna Golubova, for Kitco News, July 19, 2021 (a month ago).\n\nIn Robbing Da Hood's defense, they DID warn.  It's just that FOMO gambling longs did not do any due diligence LOL!!!!!!!!  Even the idiots who kept buying after hours were extremely dumb and deserved losing their money. Bearish",
        "sentiment": {
            "TextBlob": 0.009027777777777765,
            "NLTK": -0.8672,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9996767044067383
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2021-08-18T21:10:44Z",
        "content": "$HOOD \nThe company warned TWICE now of Q3 customer losses, I warned, and web analytics confirm.\n\nThe only people buying now are gamblers and idiots who haven't done a shred of due diligence, and weak shorts covering.  The company's big customer bump in Q1 from meme stocks and crypto frenzy trading, as well as Dogetrashcoin all quit and left.  They IPO'd based on this pump and dump. \n\nQ3 appears to be flat year over year or barely up. In fact, it hit a 52-week low for users accessing Robinhood's website (which includes the RH app because apps make calls to the same website).  The only reason it went up a little was due to Bitcoin doing a dead cat bounce to $48K as I previously predicted.  Bitcoin will crash back down.  RH users will dwindle.\n\n$20 by year's end. Bearish",
        "sentiment": {
            "TextBlob": -0.12410130718954247,
            "NLTK": -0.9623,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9997815489768982
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2021-08-18T21:05:23Z",
        "content": "$HOOD \nCompany warns (AGAIN). Note the word 'CONSIDERABLY'.\n\n\"For the three months ended September 30, 2021, we expect seasonal headwinds and lower trading activity across the industry to result in lower revenues and considerably fewer new funded accounts than in the prior quarter.\"\n\nThey lost customers from Q1 to Q2.  They will lose even more customers in Q3.  Web Analytics confirm it.\n\nFull DD here:\n\ntwitter.com/bobdoleyahoo/st...\n\nWill be under $20 by end of year. Bearish",
        "sentiment": {
            "TextBlob": 0.19772727272727275,
            "NLTK": -0.8316,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9997001886367798
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2021-08-12T20:44:59Z",
        "content": "$WISH Good thing I warned my Twitter followers of the blood bath, and bought puts.  Their numbers were worse than even I estimated.\n\ntwitter.com/bobdoleyahoo/st... Bearish",
        "sentiment": {
            "TextBlob": 0.14999999999999997,
            "NLTK": -0.3182,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9997109770774841
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2021-08-12T17:36:17Z",
        "content": "$COIN Still perplexed about the selling? Educate yourself.  So many trapped longs from analysts pumping the stock yesterday with upgrades when the company AND I already warned you.  When the company warns, listen.\n\nstocktwits.com/BobDole_Yaho... Bearish",
        "sentiment": {
            "TextBlob": 0.2333333333333333,
            "NLTK": -0.8166,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9968950748443604
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2021-08-12T17:21:58Z",
        "content": "@FromPenniesTOmillions\n$COIN deep red today, well below right before earnings.  Amazing it was upgraded by so many analysts yesterday.  Bitcoin will head back under $10K.  It already approached the $48K I predicted for a dead cat bounce.  I was right when I called the $3K lows a few years ago.  I'm pretty confident of my calls b/c Bitcoin has no backing like gold, so it simply trades based on charts.\n\nBut hey, as long as someone makes money in either direction, that's great.  Making money isn't about bag holding.  It's about knowing when to buy and when to sell.\n\ntwitter.com/bobdoleyahoo/st... Bearish",
        "sentiment": {
            "TextBlob": 0.19795918367346937,
            "NLTK": 0.8735,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.959097683429718
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2021-08-11T04:31:31Z",
        "content": "$COIN \n\nHere's some basic math for you guys.  Coinbase makes money from transactions.  Web analytics confirm users and transactions dropped off since mid June, and well into the 3rd quarter.  The company warned the exact same thing, corroborating web analytics, that July was a dismal $57 billion in total transactions, as compared to 1 month averages of $112 billion in Q1 and $154 billion in Q2.\n\nQ3 is on track to be only a fraction of Q1 or Q3, and in fact, Coinbase warned worst case scenario, Q4 2021 will be identical to Q3 2021.\n\nIt's clear users left Coinbase midyear.  You know that gut feeling where you wish you'd sold the day prior?  Get ready for a blood bath all week as traders all dump due to a really negative outlook.  Most smart traders already dumped on the run-up to earnings. Bearish",
        "sentiment": {
            "TextBlob": -0.010044642857142858,
            "NLTK": -0.8481,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9996906518936157
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2021-08-11T01:01:43Z",
        "content": "$COIN \nCoinbase month of July (Q3) trading volume = $57 billion (for 1 month).\n\nQ1 total trading volume = $335 billion or $112 billion trading volume per 1 month.\n\nQ2 total trading volume = $462 billion or $154 billion trading volume per 1 month.\n\nSUMMARY:\n\nQ1, 1 month = $112 billion average\nQ2, 1 month = $154 billion average\nQ3, 1 month = $57 billion\n\nAs you can see, it's HALF that of Q1 and 1/3 that of Q2.  Massive user loss in Q3 and massive transaction loss = i.e. lost revenue/profit.  This is corroborated by web analytics showing website hits went down drastically starting in mid June.\n\nRemember, the company already warned. You can't sue them when they warned.\n\nGet ready for a blood bath tomorrow.  Bag hold at own risk. Bearish",
        "sentiment": {
            "TextBlob": 0.014814814814814814,
            "NLTK": -0.8271,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9995248317718506
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2021-08-10T22:25:33Z",
        "content": "$HGEN \n\nBy now, if you have not figured it out, this virus is here to stay.  With each infection, the virus has the probability to mutate into a new deadlier variant.  700K infections a day x 10 billion virions (virus particles) at the height of infection = 7 QUADRILLION chances for the virus to mutate, per day.\n\n7 QUADRILLION CHANCES. PER. DAY.\n\nMultiply that by day after day.  THAT is why we have new variants all the time.\n\nThe more the public is downplaying and disrespecting the virus, and the more there's spreading of mis/dis-information, and vaccine hesitancy, the more infection, mutations and deaths there'll be.  The Delta variant is the direct result of human stupidity, especially those who reject math and science.\n\nWith the Delta variant breaking thru previously infected people as well as fully vaccinated people, virtually almost everyone is now an incubator for the virus to continue mutating.  The only thing left to do is therapeutics to lower deaths.  That's $HGEN. Bullish",
        "sentiment": {
            "TextBlob": 0.07900432900432901,
            "NLTK": -0.7738,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9992827773094177
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2021-08-10T22:18:27Z",
        "content": "$HGEN $NVAX \n\nJanuary, 2020, I warned of this pandemic and gave accurately striking figures of future deaths when clowns were claiming \"the flu is worse\". This virus is here to stay.\n\nAll you need to know is this:\n\nQ: Is the virus infectious?\nA: Hell to the yes! The Delta variant is as infectious as chicken pox. 1 infected person at a party or entering the room will infect 6-7 others.\n\nQ: Is the virus going away?\nA: Hell to the no! The public is downplaying and disrespecting the virus, spreading mis/dis-information and this virus around faster than alcohol at a frat party. Poorer countries have no means to combat this & will be incubators EVEN IF rich countries are all vaccinated.\n\nQ: Does antibodies for natural immunity and vaccines go down over time?\nA: YES, after 6 months, there's significant reduction in antibodies. After 12 months, even more. The only way to increase antibodies is to take booster shots every 6-12 months, and that's assuming the virus doesn't mutate, which IT WILL. Bullish",
        "sentiment": {
            "TextBlob": 0.0404040404040404,
            "NLTK": -0.7777,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9991176724433899
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2021-08-10T22:07:20Z",
        "content": "$COIN Remember, stocks trade FORWARD LOOKING.  Stocks don't care about the past.  If a company posts a zillion dollars, but warns in their outlook, the stock will tank.  On the other hand, if a company's earnings sucked, but they have a great outlook due to an upcoming catalyst, the stock will rally big time.  The company already warned.  Take your cue.  Don't bag hold for the lose. Bearish",
        "sentiment": {
            "TextBlob": 0.06000000000000001,
            "NLTK": -0.169,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9747876524925232
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2021-08-10T22:04:01Z",
        "content": "$COIN \nWeb analytics confirming users and transactions dropped off after mid June in a downtrend after Bitcoin tanked, with July being a low, just as the company warned in their outlook.  Not only that, I've previously predicted Bitcoin would do a 50% technical bounce to the $48K level, which is typical of ALL downtrends, including what Bitcoin did in 2018.  It'll take a little over a month to reach recent lows again, and then Bitcoin will head down to the $10K level by next year.\n\nBitcoin does these 1,000% runs, sells off 85-90%, bases for about a year, and then rallies 1,000% again, rinse and repeat.  Very predictable in the longer trend if you know what you're looking at.  $COIN will be below $100 by next year with people leaving crypto until the next 1,000% run-up again. Bearish",
        "sentiment": {
            "TextBlob": -0.07202991452991453,
            "NLTK": -0.5994,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9995344877243042
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2021-08-10T22:00:32Z",
        "content": "$COIN \nThe company warned:\n\n\"In July, retail MTUs and total Trading Volume were 6.3 million and $57.0 billion, respectively, as crypto asset prices and crypto asset volatility declined significantly relative to Q2 levels. August month-to-date, retail MTUs and Trading Volume levels have slightly improved compared to July levels but remain lower than earlier in the year. As a result, we believe retail MTUs and total Trading Volume will be lower in Q3 as compared to Q2. \"\n\nQ1, 21'\nMTU: 6.1\nTrading Volume: $335 billion\nAssets on Platform: $223 billion\n\nQ2, 21'\nMTU: 8.8\nTrading Volume: $462 billion\nAssets on Platform: $180 billion\n\nMonth 1 (July) of Q3, 21'\nMTU: 6.3 million\nTrading Volume: $57 billion \n\n(As you can see the trading volume of $57 billion in the month of July is SIGNIFICANTLY less than 1/3 of the $335 and $462 values from prior quarters)\n\nThe company warned \"As a result, we believe retail MTUs and total Trading Volume will be lower in Q3 as compared to Q2.\" Bearish",
        "sentiment": {
            "TextBlob": -0.037037037037037035,
            "NLTK": 0.0396,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9993191957473755
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2021-07-26T18:53:48Z",
        "content": "$RIDE OK, finished reading the SEC filing. To me, this is another form of an ATM offering. The benefits of an ATM offering is a company can wait until the stock price is much higher to sell, thus getting the most money, for the least amount of shares. Also, with a traditional ATM offering, you're at the mercy of the broker or agent who's doing the selling. \n\nWith this, the company is in full control and since they know their own internal workings best, if they know they have good insider information that the stock will explode, they can simply wait for good news, then direct this hedge fund to buy shares at higher prices.  The company wins, shareholders win (less dilution, at higher prices), AND the hedge fund also wins because they are guaranteed a 3% profit immediately.  This hedge fund has nothing to lose.  This is some good shit guys. Loading up here.\n\nBest example of high share price ATM selling is $GME where management got the most money with the least amount of shares. Bullish",
        "sentiment": {
            "TextBlob": 0.30358974358974355,
            "NLTK": 0.9921,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9870088696479797
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2021-07-24T06:33:56Z",
        "content": "$CEMI LOL so many posts on random shit.  How about focus on their $25 million loss in 2020, and $4.5 million loss in Q1, 2021.  That's the real issue and the root problem for why they had to concoct this pump and dump on shareholders. Bearish",
        "sentiment": {
            "TextBlob": 0.16,
            "NLTK": -0.8388,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.999213457107544
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2021-07-24T06:01:59Z",
        "content": "$CEMI    LET'S GET ONE THING STRAIGHT:\n\nThis shit show was not the work of shorts.  It was the company concocting this pump and dump scheme with what I'm confident are fake purchase orders that will be conveniently \"terminated\" by both parties soon, along with trapped longs from months and years ago dumping smack on you new bag holder clowns (greater fools on the GREATER FOOL THEORY).  And you won't know because their SEC filing states they are NOT OBLIGATED TO UPDATE YOU AFTER THE PR DATE.\n\nGet it right.  Shorts simply jumped on the bandwagon.\n\nShocked?  Try reading the SEC filings sometimes and connecting the dots of this company's massive losses.  Their only option was to dump and dump, or face bankruptcy in a few mere months. Bearish",
        "sentiment": {
            "TextBlob": -0.022230710466004583,
            "NLTK": -0.9599,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.99956876039505
            }
        },
        "image_url": ""
    },
    {
        "username": "Losing2Winning",
        "timestamp": "2021-07-24T05:54:11Z",
        "content": "@JennySingh I thought about playing the dead cat bounce too, but this company is way too shady.  If they get halted like $WORX for fake terminated purchase orders, it's going to suck big time.  $WORX was halted for like 3 months.\n\nThere's better and safer plays out there.  Full Stop.  Period.\n\nAlso, if you are in options when this trash gets halted, you can't do anything if you're a seller of premium.  If you're a buyer of premium, you can exercise at any time before expiration, but depending on what the halt reason was and the outcome, you'd be gambling in the dark.\n\nIf you buy or sell debit/credit spreads, you'll be in a world of hurt because one leg (the one you buy) is exercisable by you.  The sell leg is exercisable by the other party.   The sell leg will result in your broker forcing you to pay to buy trash stocks or something. Bearish",
        "sentiment": {
            "TextBlob": -0.046875,
            "NLTK": 0.2144,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9995459914207458
            }
        },
        "image_url": ""
    }
]