[
    {
        "username": "MLinv",
        "timestamp": "2023-06-21T16:14:37Z",
        "content": "$BTC.X A week after I posted at 27k 👇🏽 BTC would go down first to grab liquidity at 24-25ks, it did it textbook, and back up after. Here we are ≈20% higher already at ≈30K🧠 Remember: 5K ago FUD was all over the place with nonsense “news” just to shake out and steal bitcoins by Smart Money. Textbook movement, study and learn✍️  and enjoy your gains if you got in it with me.",
        "sentiment": {
            "TextBlob": 0.15978835978835979,
            "NLTK": -0.2808,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9929954409599304
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-06-20T20:16:08Z",
        "content": "$TSLA Last April at 163.29 I posted 140s-160s would be my next accumulation area and so I’m holding 153 avg. End of day my sell limit got executed at 274.50 and sold 50% for ≈79% gains. Still holding the rest for +300-320s. Beautiful start of the week💰 \n\n$arkw $arkq $ARKK",
        "sentiment": {
            "TextBlob": 0.2833333333333333,
            "NLTK": 0.743,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.5449076294898987
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-06-17T09:17:43Z",
        "content": "$ETH.X (4H CHART) I'm not convinced after the rejection at ≈1770 near the 21DEMA as first attempt, the short term low is in yet.  \nAnother lower low shakeout \"may be\" on the horizon Smart Money may be aiming to grab liquidity lower at Fib 2.618 as well to form a \"W\", which would be nice to average in some more, before my ≈2100s next target range. Hence probability based protecting gains: sold 50% of my 1630 avg for 7.6% gains at 1755.  \n- Still volume divergence  \n- StochRSI already overbought and bearish divergence   \nWill scale back in and average down more if my Fib 2.618 forecast appeared to be correct, otherwise may scale back in later at higher prices averaging up higher.  \n* Forecasted path is not timeline related, for price target range purposes only.  \n \nTo be continued..",
        "sentiment": {
            "TextBlob": 0.11043650793650794,
            "NLTK": -0.5037,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9988924860954285
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-06-17T05:22:00Z",
        "content": "$BTC.X 2nd of June at 27K I warned there will be another swift shakeout move (E) to 24-25k coming before back up. A week later the FUD narrative was Binance and $coin to justify it. It makes no sense as technicals are leading and any narrative Smart Money may can come up with to make it seem like it matters. If not for Binance and Coin the move down still had happened and then they would e.g. say it’s because of the FED or China etc. I’m advocating avoiding any “financial news”. It’s a Smart Money tool to mislead you while they accumulate at cheaper prices. Stick to the chart’s liquidity ranges, and adjust accordingly. What is negative today may suddenly be positive tomorrow, prime example is Blackrock’s FUD in 2017👇🏽anyone investing and trading in crypto know these examples are endless🧠\n\n$bito $arkk $ETH.X",
        "sentiment": {
            "TextBlob": 0.02225428892095558,
            "NLTK": -0.608,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9981708526611328
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-06-16T17:53:40Z",
        "content": "$ETH.X Picked up the shake out yesterday:! There’s no illusion greater than fear: thinking will not overcome fear, but actions will 😌 probably turned out to be I bought near the exact shake out bottom✅ let’s see next few weeks how this played out.",
        "sentiment": {
            "TextBlob": 0.12999999999999998,
            "NLTK": -0.2771,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9968992471694946
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-06-16T17:44:25Z",
        "content": "$PBTS 👀 maybe today is our day chop chop",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.986240565776825
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-06-16T09:52:50Z",
        "content": "$SPY (QUARTERLY CHART) Add on to previous Monthly chart: almost filled the 2022 2nd Quarter Candle in confluence with Fib 0.786 resistance and fierce rejection should probably expected after today. \n \nWill update longer term SPY forecast end of month. \nGood luck all, choose wisely and have a nice weekend! \n \n$QQQ $ARKK $IWM $SPX",
        "sentiment": {
            "TextBlob": 0.3261904761904762,
            "NLTK": 0.807,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.898504912853241
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-06-16T09:47:17Z",
        "content": "$SPY (MONTHLY CHART) Add on to my post yesterday. Not recommendations, just posting logic perspective  to contemplate as the consensus @Stocktwits experience FOMO because of the parabolic move up last weeks = not in harmony with relative declining Demand volume. \n- April 2022 candle open of 444.11 has not been tested yet, could be the final destination \"wick\" for Smart Money to dump Supply on volume. \n- Today's not only 2nd Quadruple Witching, but also first 6M of trading  2023; Smart Money's Rebalancing for 2nd half of the year \n- ATM at Fib 0.786, which is usually from Psychological perspective the consensus FOMO range, but after usually retests of Fib 0.618~0.5 should be expected. (OR go short when the short term peak is confirmed) \n- SPY is too far away from home base, meaning: the 21WEMA (407)has not been retested with at least a \"wick\". EMAs are weekly based. \n- 55WEMA = 403 \n- Monday markets are closed \n- In the comments also Quarterly perspective \n \n$QQQ $ARKK $IWM $SPX",
        "sentiment": {
            "TextBlob": -0.03582251082251082,
            "NLTK": 0.4061,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.999255359172821
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-06-16T05:48:34Z",
        "content": "$ARKK Co-Founder of StockTwits @HowardLindzon did an interview with Forbes in 2011. Read the link in previous post. It’s a prime example why you need to look out for stocks in Accumulation patterns to gain maximum ROI over time. Look out for any tickers the consensus is bearish about and if they are in a long lasting Accumulation you know where Smart Money is positioning themselves long in. Chasing runners or those that have ran up for many years means you’re already late to the party. Crash parties nobody wants to attend! \nThe consensus will say those parties are for misfits. Nothing wrong with being a misfit, a rebel, the round pegs in a square whole: Einstein, Jobs, Gates, Bezos, Zuckerberg, Musk…. \nCathie Woods has organised the latest decade long party🧠 after the first hang over it’s only getting started.\n“Wave III”: few understand. You want to understand: read back in the link what I elaborated for ARKK +40% ago🫡  last January\n\nstocktwits.com/MLinv/messag...\n$ARKG $arkw $arkq $ARKF",
        "sentiment": {
            "TextBlob": 0.02208994708994709,
            "NLTK": 0.9193,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9779662489891052
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-06-15T10:58:58Z",
        "content": "$ETH.X in for a swing trade 1630 avg. target ≈2100s",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9921212196350098
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-06-15T10:55:39Z",
        "content": "$ethx In for a swing trade 1630 avg. target ≈2100s",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9910474419593811
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-06-15T04:03:33Z",
        "content": "Thanks @howardlindzon and let this interview with you in 2011 be a reminder to anyone @stocktwits why you need to “learn the language early” when you mentioned back then already $aapl $amzn $cmg and $lulu \nTrue Vision!\n\nforbes.com/sites/katestalte...",
        "sentiment": {
            "TextBlob": 0.184375,
            "NLTK": 0.7901,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.8375091552734375
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-06-14T19:58:03Z",
        "content": "$SPY This week is Quadruple Witching, therefor not expecting an expected correction starting until Friday. Today is just noise too. Could possible be Fib 2 at 441s is the target Smart Money is aiming for dragging the FOMO consensus in before they start dumping supply on volume and a correction starts. Waiting for the weekly close for more clarity. This screenshot was posted last March as it’s trading in the Supply Liquidity Range, link to my March post:  \n\nstocktwits.com/MLinv/messag...\n$qqq $iwm $arkk $SPX",
        "sentiment": {
            "TextBlob": 0.10238095238095239,
            "NLTK": 0.5256,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9990830421447754
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-06-14T17:37:03Z",
        "content": "@TechnicalLearner @fvbusiness Compare this intra-weekly $SICP to the previous one I posted on June 9 in this thread, it look like it's trying to breakout as the StochRSI is rising clearly as well. For June's volume is rising: \nWeek 1: 365K \nWeek 2: 386K \nWeek 3: at the moment of writing already 337K with 2.5 days to go + atm trying to break that trend line.",
        "sentiment": {
            "TextBlob": -0.03333333333333332,
            "NLTK": 0.743,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9396857023239136
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-06-14T17:30:08Z",
        "content": "@TechnicalLearner @fvbusines \"They\" continue accumulating shares $SICP it would be interesting to see what happens IF it's able to break out above 1.51. ATM it's above the down sloping trend line. See next reply",
        "sentiment": {
            "TextBlob": 0.14074074074074075,
            "NLTK": 0.5994,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9917671084403992
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-06-14T17:27:08Z",
        "content": "@TechnicalLearner @fvbusiness $SICP It remains interesting, all the bigger buys, see next reply too",
        "sentiment": {
            "TextBlob": 0.16666666666666666,
            "NLTK": 0.4019,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.8947739601135254
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-06-14T13:44:47Z",
        "content": "$auud averaged down at 0.532 from 0.56 to 0.546 avg as it hit also on the daily the 21DEMA. It might fill the whole gap to 0.47 as a next scale in target range. For now waiting it out.",
        "sentiment": {
            "TextBlob": 0.011111111111111106,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9974923133850098
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-06-14T13:35:14Z",
        "content": "$auud entered for a short term wing 0.56 avg 4H hit the 55EMA. Let’s see.",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9947612881660461
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-06-14T12:47:39Z",
        "content": "@Hookedontonics Don’t know if you ever saw my all time $SPX chart. But these are the Fib targets over time for the UTAD ending of  highest degree Wave V $spy before mayhem breaks out. \n\nstocktwits.com/MLinv/messag...",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.999269425868988
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-06-14T06:15:03Z",
        "content": "$pbts Not near my desktop to post my in-depth chart but I read a lot of whining. So open this screenshot from my phone. You can clearly see the bullish divergence (i.e. accumulation) on the 4H. Read back in this thread also my in-depth chart. Patience.",
        "sentiment": {
            "TextBlob": 0.012500000000000004,
            "NLTK": 0.296,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9983795881271362
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-06-13T18:42:18Z",
        "content": "@petohml @Taynee88 @BULLSEYE2005 @fracas  \nUpdate to my original post earlier today \nHere my $IFBD 4H chart  \n- EMAs are based on the DAILY, so atm trading  between 21DEMA and 55DEMA ≈ Between Green Fib 0.236-0.382 \n- 4H StochRSI Bullish Divergence \n- Rejected yesterday after wicking into Green Fib 0.5 (as expected) hence waited for an entry after the expected pullback. \nThe green Fib is measured from February high to the 0.93 low in May. \n- IF yesterday was the A-leg on high volume up and thus a Change Of Character (CHoCH), then today's declining volume B-leg down, and IF the prices is able to overcome 3.04 then the C-leg target would be yellow ≈Fib 1.618 for my swing, atm trading above the \"Accumulation Trading Range\" (BUAC) \n- Also could be filling the daily Gap at Green Fib 0.786 ≈ Yellow extension ≈ Fib 1.786-2.272 \n- Move higher is not timeline related, for indicative purposes only. My avg is 1.72. \n- No recommendation to buy or sell, stick always to your own risk management.",
        "sentiment": {
            "TextBlob": 0.040429292929292926,
            "NLTK": -0.7506,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9994232654571533
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-06-13T16:59:11Z",
        "content": "@TechnicalLearner @fvbusiness $SICP \n\nAccumulating on low volume continuous.",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": -0.2732,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9989455342292786
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-06-13T13:32:30Z",
        "content": "$IFBD In for a swing at 1.72 avg",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9880434274673462
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-06-13T04:21:18Z",
        "content": "$spy Add on to this thread: ATM at Fib 1.786 in the Supply Liquidity Range as pointed out last March I said ≈428 as that is Fib 1.618. It exceed higher to Fib 1.786 and maybe 2 is in play as well. But the risk is to the downside from here as nothing goes up in a straight line. Let’s see how this week evolves. $spx $arkk $iwm $qqq",
        "sentiment": {
            "TextBlob": 0.15,
            "NLTK": -0.1406,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9953633546829224
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-06-13T04:02:24Z",
        "content": "$SPY I have posted ≈428 as the target, with a margin of safety as the Supply Liquidity range is wider as you can see in my chart below. Atm it’s just ≈1.3% higher into the Supply Liquidity Range (SLR). I have seen people which posted down to 360s and in December calling for a crash down to new lows, now turned bullish🤦🏽‍♂️ The writing is on the wall for probably at least a short term correction as everything is overbought. Typical buy the rumour sell the news behaviour. I’m just waiting for it where this intra top will finish in the SLR. Cash is also a position.\n\n$ARKK $IWM $QQQ $SPX",
        "sentiment": {
            "TextBlob": 0.01357323232323232,
            "NLTK": 0.0258,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9970160722732544
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-06-09T18:40:02Z",
        "content": "$SICP (WEEKLY chart) Update to this thread. As I am only able to sell and not buy, still holding 1.22 avg. Overall in Accumulation, this week slightly higher volume than last week. Needs to break the 8WEMA at 1.51, if so expecting it to move to fill at least the 4s gap, but the 9s gap is not ruled out as the 21WEMA is there as a stronger resistance area. \nThere's no bankruptcy no filling for a Chapter 11 or 7. All nonsense rhetoric. So far there's buying activity OTC, most likely Smart Money, as most retail cannot trade at OTC. Let's see if a breakout is coming soon and IF so what would happen next. As I sold 50% of my 1.22 avg at 2.27 for 86% gains, I have all the patience in the world how the other 50% I'm still holding is going to play coming time. \n \n@TechnicalLearner @noblame @fvbusiness",
        "sentiment": {
            "TextBlob": 0.1260989010989011,
            "NLTK": 0.6616,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9962180256843567
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-06-09T17:29:41Z",
        "content": "$pbts The chart I posted 👇🏽 remains valid regardless of the split. The data remains the same: so nothing has changed only you got less shares. Just ranging and accumulation so far in the 0.05-0.06 range or atm 1.55. Many wicks down (shake outs) were bought up on volume directly. The price hasn’t really changed today although you see -15% down it has been trading earlier this week and last week at this price too. If you can’t stand the heat you shouldn’t be in the kitchen of high Beta tickers like PBTS. Just volume is needed: so far there’s none and just algos in control. \n\nstocktwits.com/MLinv/messag...",
        "sentiment": {
            "TextBlob": 0.05247863247863248,
            "NLTK": 0.5279,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9992735981941223
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-06-09T14:48:50Z",
        "content": "$SPX $SPY Anyone following me and reading this. Read below why followers don’t say always everything. When an account post negative opinions only calling others out bragging how great he/she is, but don’t post any logic analysis and TA why; you should be very skeptical. You should never act on an opinion only, always check a track record of posts for any credibility. The avg down department is always all over the place daily in the same tickers. Those that really make gains, just post in a thread once in a while and refer back to previous post so you the reader can easily judge for yourself if there’s any credibility to take the analysis in consideration. I’m never calling others out but this conversation👇🏽the whole  thread below is very telling. \n\nBe positive towards others agree to disagree rather than posting just negative sour nonsense many times in a day nobody cares about egos. Be open to others perspectives but stick to your own risk management always!\n\nHANW!\n\n$qqq $iwm $ARKK",
        "sentiment": {
            "TextBlob": 0.08456589706589707,
            "NLTK": 0.4418,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9822929501533508
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-06-09T14:38:28Z",
        "content": "@fvbusiness @OldFngGuy @TechnicalLearner My TA is shit when you posted back to 470, I posted solid TA reasoning and chart why to 350s. You know more than anyone on Wallstreet lol: these statements are very telling. Go cry in your basement. No one makes money if they went long when you posted back to 470s. More than a year they would have been averaging down while missing out on opportunity costs. Those hedgefund billionaires surely listened to your 11 January 2022 it would go back up to 470 soon. What a joke 🤣 enough time waste replying to this nonsense. You’re exposed now continue whining in your basement to your 10K followers $spx $spy",
        "sentiment": {
            "TextBlob": 0.11296296296296296,
            "NLTK": -0.8014,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9973827004432678
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-06-09T14:28:26Z",
        "content": "@TechnicalLearner @fvbusiness @OldFngGuy $spy $spx ahh wait I see now: OldfngGuy is from the average down department all over the place everyday calling others out. Look at his rants to others. This post from January 11th didn’t age well when you posted back to 470 which never happened. While I already posted already with just charts in 2021 it would go down to 350s and why I and stayed the course ever since. Same as since 350 I posted it would go back up. You could have made big money going just short and then long at 350s and compound rather than just averaging down for months, calling everyday since then V-shape. Sure my TA doesn’t work. Lol. Track records are very telling here on StockTwits. I post charts and not nonsesne opinions like you. You’re not an investor or trader. Just someone posting too many opinions and negativity on a daily basis boosting your ego with just…. Many followers. Who cares? calling me out that actually made the money in the mean time. Mic dropped! Ciao!",
        "sentiment": {
            "TextBlob": 0.04725260416666667,
            "NLTK": 0.6677,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9962155222892761
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-06-09T12:06:52Z",
        "content": "@OldFngGuy rode $tsla all up. And exit on was on the nose too. I can post endless charts and the gains I made out of it. Yet you reply to me I’m random? Check my profile for any credibility. People that post only opinions on StockTwits without showing their actions are random. I at least can show which action I took while others need to work in an office for a salary, I’m just enjoying freedom in my life and trade and invest both ways making money rather than using StockTwits to vent emotions. Have a nice day!\n\nstocktwits.com/MLinv/messag...",
        "sentiment": {
            "TextBlob": -0.009374999999999994,
            "NLTK": 0.92,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9808838367462158
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-06-09T12:01:22Z",
        "content": "@OldFngGuy Then come April: I posted $tsla to accumulate in the 150s more as it was going higher. I just post all my actions backed up with charts and the gains that come with it, incl. Links to previous post. Rather than just posting opinions. Read April’s post 👇🏽 also on the nose after December’s entry. Time is money: I make it both ways. Not bagholding. \n\nstocktwits.com/MLinv/messag...",
        "sentiment": {
            "TextBlob": 0.19444444444444445,
            "NLTK": 0.3612,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9950109720230103
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-06-09T11:57:30Z",
        "content": "@OldFngGuy $tsla last December on the nose. Scaled out gains near the highs as posted at +1200 pres split. Shorted down, then entry long last December. How are you doing? 👇🏽\n\nstocktwits.com/MLinv/messag...",
        "sentiment": {
            "TextBlob": -0.021111111111111115,
            "NLTK": 0.34,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9991899132728577
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-06-09T11:30:06Z",
        "content": "$spy Complacency is the greatest enemy of excellence….just wait for it…. if you look closely you can see it coming.. don’t let it happen to you 🆘🚨\n\n$QQQ",
        "sentiment": {
            "TextBlob": 1.0,
            "NLTK": 0.1779,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9929310083389282
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-06-08T21:45:17Z",
        "content": "$PBTS\nsec.gov/edgar/browse/?CIK=1...",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9969326257705688
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-06-08T21:37:23Z",
        "content": "@Sly007 In this latest link below to my post of April 2023: I argued why to scale in $tsla at 140-160 range for next swing trade move up and it’s doing so last weeks. But also argued why 2000 makes sense on the longer timeframe based on just Fibonacci and Elliott Wave logic: coming near the same conclusions as Cathie. Tesla will go down first more when this B-leg ends. Yes 2000 is extremely high, but market’s psychology will cause high beta’s to be extremely overvalued stocks or extremely undervalued in bearish markets. This 2000 target has nothing to do with Fair Value ≠ Market value. The market price is just what anyone wants to buy a stock for and fomo will cause extremes again by then. It doesn’t matter what you as an individual personally think of it. All what matters is what the market psychology does in that next bubble. Read 👇🏽\n\nstocktwits.com/MLinv/messag...",
        "sentiment": {
            "TextBlob": 0.1273202614379085,
            "NLTK": 0.8402,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9968648552894592
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-06-08T20:20:01Z",
        "content": "@Sly007 and here $SQ last post of March where I pointed out the shake out while the uneducated consensus  thought Hindenburg was the cause for a crash that didn’t come as I argued👇🏽\n\nstocktwits.com/MLinv/messag...",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": -0.5267,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9985923171043396
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-06-08T20:16:54Z",
        "content": "@Sly007 and here the link for $SQ early 2022 where I pointed out to still wait for the 50s as start of accumulation range: instead of buying long at 80s already. \n\nstocktwits.com/MLinv/messag...",
        "sentiment": {
            "TextBlob": 0.025,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9990363121032715
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-06-08T20:09:22Z",
        "content": "@Sly007 here read also my $SQ post back in 2021. Next reply I will show you the forecast after as well\n\nstocktwits.com/MLinv/messag...",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.2732,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9992425441741943
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-06-08T19:40:39Z",
        "content": "$PBTS Volume starts coming in, can we finally move back up to the targets, we deserve this after this already long wait..chop chop",
        "sentiment": {
            "TextBlob": -0.016666666666666666,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9990752935409546
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-06-08T19:33:54Z",
        "content": "@Sly007 Then last April when everybody again was talking about much lower for $TSLA I said no, just a lower time frame B-leg down and then after back up higher to finish the C-leg up atm already at 234. Read this post including comments with more charts. Yet no news made me decide the movements based on just probabilities.  Read here post of April 2023👇🏽\n\nstocktwits.com/MLinv/messag...",
        "sentiment": {
            "TextBlob": 0.1324074074074074,
            "NLTK": -0.7783,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9995368719100952
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-06-08T11:15:20Z",
        "content": "$QBTS (DAILY chart) No position as it broke out earlier than I was expecting. I was tracking it since 0.56 since March 2023 so missed opportunity: cannot catch them all. \n- Yellow line 21 / Blue 55 are EMAs based on the WEEKLY chart. \n- Over the whole chart now trading at White extension Fib 0.5 \n- Green Extension hit Fib 1.618 accumulated on it = also support on the 21WEMA before moving higher on volume. \n- Bottom to peak in this W-shape Accumulation = equal distance for the breakout target 1 (arrows) (times 2 for target final Fib 2.618 target range) \n- So far Fib 2.414 rejected on the nose. Could still run higher into: Green Fib 2.618 ≈ White Fib golden ratio Fib 0.618 ≈ 55WEMA has never been tested before: therefore stronger rejection should be expected. \n-StochRS Bullish divergence was indicative of this move as since march slight HH, price still LL \n- Retracement down could be as deep as previous resistance of the Accumulation Trading Range. \n@fvbusiness  \nTo be continued..",
        "sentiment": {
            "TextBlob": 0.005555555555555557,
            "NLTK": -0.7421,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9990965127944946
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-06-08T10:25:27Z",
        "content": "$AQST @fvbusiness @Sly007 add on some notes to the specific A&E Pattern for your any of your considerations. I got no position, just tracking the price action for a possible entry later on. Hopefully you understand what I just posted as the price will not just break through every Supply Liquidity area in a straight line regardless of any news. Psychologically sellers are to be expected at the Liquidity ranges / depending on the total data in that specific Supply range especially at the overall downtrend slope.  \nOn the long haul: IF it's able to break through the 20.70 ATH the first next measured move Fibonacci resistance range is Fib 1.272 for then the next consolidation peak to be expected next. (This is not visible in my chart but Fib 1.272 ≈ 53.74)",
        "sentiment": {
            "TextBlob": 0.044444444444444446,
            "NLTK": 0.1779,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9954895377159119
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-06-08T10:09:42Z",
        "content": "$AQST $AQST (WEEKLY Chart) @fvbusiness @Sly007  \n Forecasted path not timeline related: for indicative price targets only. \nTechnically theory textbook movements: \n- Went down in a textbook ABC along the Fibs meaning: ATH to red A is equal distance length B to C ≈ Fib 1.272 to finish the correction down so far. \n- Wave 1-2 comes in different patterns here in a A&E pattern. \n- After C volume came in and price moved up in Wave 1 to textbook C to B Fib 0.382 on the nose. \n- Broke out on volume after above the box the 21 & 55WEMA (blue line) and thus a retest back down soon should most probably going to be expected to form B and confirm the breakout before a move up higher. \n- StochRSI overbought: statistically everytime it did a rejection back down happened, so taking the rest in consideration as it is atm in next \"Supply liquidity range\" at next Yellow Fib extension 0.5 (measured from C to B) ≈ Green Fib 1.272 (measured from Wave 2-1) with a C target over time wicking into the downtrend.",
        "sentiment": {
            "TextBlob": -0.00328282828282829,
            "NLTK": -0.743,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.998950719833374
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-06-07T13:49:14Z",
        "content": "$ARKk How are we doing here? I’m 3x (3ARKK)  leveraged ≈60% up so far from my 36.26 avg 💰 Remember all the negative “news” a month ago? Clear example why you should avoid any news: Smart Money positions themselves and so move up as forecast came in. Back then many started doubting, but I posted that I would stay the course as rotation was clear based on my TA no matter the FUD unless invalidated👇🏽. Use the chart to learn✅ I look forward reading others were not fazed nice andere in solid gains based on my chart💸\n\n$ARKG $ARKK $ARKQ $ARKW",
        "sentiment": {
            "TextBlob": 0.14603174603174604,
            "NLTK": -0.52,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9980905652046204
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-06-07T04:34:52Z",
        "content": "@Bodhi_Trader I have only posted a chart for RIVN last March and so far going as forecasted👇🏽 but no position in it also not traded it. Inverse H&S could be for a swing trdlade but overall no reason to go long until confirmation closing above the 55WEMA or when a “Spring” appears. Now it’s just ranging. Take a look what I posted back then for $RIVN\nstocktwits.com/MLinv/messag...",
        "sentiment": {
            "TextBlob": 0.0071428571428571435,
            "NLTK": -0.6808,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9993546605110168
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-06-06T23:06:16Z",
        "content": "@Mikedevo @TywinLost @Kornie7  I have been 3x leveraged $arkk in 3ARKK avg 36s as argued again last April backedup with charts why. Read back my posts in the link or check my profile. I know Kornie and Tywin also were in it before this run. No risk for us with our low averages and higher targets coming. Certainly it will not move up in a straight line, but in lower degree waves. Already scaled out 46% gains: so check the chart👇🏽\n\nstocktwits.com:443/MLinv/me...",
        "sentiment": {
            "TextBlob": 0.11071428571428572,
            "NLTK": -0.25,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9965102076530457
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-06-06T22:21:29Z",
        "content": "$COIN How many people made money today and locked in (some) quick gains after seeing my chart?👇🏽 I’m just curious so click like if you did buy this textbook shake out on highest volume since February 2nd 💸 $ARKK",
        "sentiment": {
            "TextBlob": 0.18333333333333332,
            "NLTK": 0.6983,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9798633456230164
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-06-06T13:19:13Z",
        "content": "$COIN My post of yesterday as add on to the chart posted. Let’s see how volume develops next 3 days.",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9877253174781799
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-06-06T13:14:50Z",
        "content": "$COIN (Weekly Chart) Update to my last post of March. Yesterday first move down to fill the gap at 57.03, but on the daily there was anoter gap left at 53.17-50.47 also to finish the E-leg in a spring within this intra-accumulation range, which I argued yesterday would be another scale in target. Nothing has invalidated my post of last March. Hence still holding avg at 59.74 but will add more once market opens. \n- Remember my $ARKK post? (click 🔍 to search), Then also double bottom in the 34s as a final shake out.  \n- Overall Fib 0.618-0.786 retracement (yellow Fibs) \n- Green Fibs remain the higher target. \n- Don't get shaken out: Smart Money will use anything in their power to steal shares: FUD news today and yesterday. Avoid the news, Stick to the chart unless invalidated. \n- Invalidation of a higher move will be a weekly close below \"yellow ST in B\" \n- Weekly StochRSI bullish divergence \n- Declining volume on the move down is net positive too = consolidation. \n \n$ARKW $ARKF $BTC.X",
        "sentiment": {
            "TextBlob": 0.06212880686564897,
            "NLTK": -0.5524,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9979342222213745
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-06-06T12:35:27Z",
        "content": "@TechnicalLearner Nice what a shake out indeed for $coin. Gaps filled now. ABC move down yesterday A down intraday then B up and now C premarket down in equal length. Expecting it to go back up from here. Let’s see.",
        "sentiment": {
            "TextBlob": 0.07619047619047618,
            "NLTK": 0.2732,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9535902142524719
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-06-06T04:42:07Z",
        "content": "@Nick1971 Todd $ault is repeating old news from last November 2022 pretending to be new news yesterday. Misleading potential new buyers, with non relevant 200M revenue. The losses have gone up significantly in the meantime: revenue ≠ profit, yet he’s pretending revenue matters🤦🏽‍♂️ or what about the (again) “to be announced next week” dividends 3 weeks ago? Ever since total silence. \nAnything Todd is involved in like $muln $alzn $imhc et al. have similar penny charts 📉  and dilution like there’s no tomorrow. Not any serious CEO is depending on posting daily “news” on his Twitter. If you look at his likes on Twitter: it’s only about auto racing. He talks the talk for years but don’t walk the walk. Most successful companies that deliver value on the long run barely post news, just deliver. \nWallstreet veteran? Not any proof for that either. He has no shame, which was already obvious if you look at his appearance: no self control. It’s a con man. \n\nAI is going to be his next buzz word.",
        "sentiment": {
            "TextBlob": 0.10321969696969698,
            "NLTK": 0.4424,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9973658919334412
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-06-05T17:21:42Z",
        "content": "@noblame @fvbusiness @TechnicalLearner $SICP OTC they can manipulate the price easily. But big buys are not unnoticed.",
        "sentiment": {
            "TextBlob": 0.17777777777777778,
            "NLTK": 0.1779,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9907938838005066
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-06-05T17:07:35Z",
        "content": "$coin add on to my earlier buy at 58.89 as that daily gap got filled at 58.91: also the 4H gap at 57.03 of May 26th is filled✅\n\nAveraged down after my 58.89 from 61.60 avg to 59.74 👇🏽 chart for the higher targets.\n\nRisk: the May Monthly open at 53.17 ≈-8% lower could be another shake out wick to grab liquidity there in that range: if so will add more. \n\nstocktwits.com/MLinv/messag...",
        "sentiment": {
            "TextBlob": 0.14206349206349206,
            "NLTK": -0.6124,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9990822076797485
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-06-05T16:02:05Z",
        "content": "$BTC.X Surely the consensus is forced thinking it’s the FUD Binance news, where I already posted last week the move down was in the chart and on the way as the E-leg. Prime example the narrative FUD is created to back up such swift move after the actual move was already in the chart last week to take out liquidity lower. Read back including the comments for the weekly chart as well. Avoid any news, stick to the charts👇🏽🧠\n\n$spy $iwm $arkk $qqq",
        "sentiment": {
            "TextBlob": 0.004938271604938264,
            "NLTK": -0.6447,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9993088245391846
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-06-05T15:37:09Z",
        "content": "$COIN gap filled bought in for a seperate trade 58.89",
        "sentiment": {
            "TextBlob": 0.4,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9985814094543457
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-06-05T12:16:41Z",
        "content": "$ARKK I argued 2 weeks ago that the \"Cathie missed out on $NVDA  gains\" story, (which is at the moment all over the place) is misleading as the owns it at $ 4 (!!!) already since 2014: missed out on gains LOL. In her latest interview with Josh Brown last Friday, she explains in-depth why she still owns more NVDA than most asset management firms (!!!) in a concentrated way, but not in the Flagship ARKK. \nAlso why she sold \"a part\" and allocated GAINS into $ROKU $TDOC & $U . It's a prime example that most news outlets parrot one another without doing any DD. The rest of this interview is also worth watching \n \nyoutube.com/watch?v=1DT_70X...",
        "sentiment": {
            "TextBlob": 0.5109374999999999,
            "NLTK": 0.8417,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9176060557365417
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-06-02T22:09:12Z",
        "content": "$spy Wave 5 in this Leading Diagonal (trendline Target ≈428s) hit as forecasted for this UTAD✅\nDouble top, expecting a short term correction into mid June for indexes after this bull trap last days that wrecked all the early shorts that where all over the place when I posted early March it still would go up higher. Back then the consensus remained bearish based on nonsense “news FUD”, and now the consensus is turning bullish🤦🏽‍♂️ \nThe bullish divergence in the post of March👇🏽, was an indication it would go higher to ≈428 target range mentioned last December 2022 already (read back through previous posts). There has been already bearish divergence formed last days. Whether a “Spring” is going to come remains to be seen, but starting early next week is definitely a correction back down on the way at least into mid June🧠 and when that happens the “news” will form a narrative why after as always. Stick to the charts always!\n\nTo be continued💰🥂\n\n$IWM $QQQ $SPX $ARKK",
        "sentiment": {
            "TextBlob": 0.03080808080808081,
            "NLTK": 0.4102,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9992938041687012
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-06-02T17:23:09Z",
        "content": "$arkk As I’m 3X leveraged in 3ARKK scaled out today since my position was sized up bigger than I was planning initially, so de-risking and scaled out 30% at 41.86 and secured +46% gains✅💰 Will compound gains in other tickers I’m looking at. But holding the rest 36.26 avg. for higher targets over time as per my TA. \n\nHave a nice weekend!",
        "sentiment": {
            "TextBlob": 0.175,
            "NLTK": 0.7609,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.7874627709388733
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-06-02T12:30:02Z",
        "content": "@Lth123 This thread you’re replying in was is the higher timeframe chart. Last April I posted a shorter timeframe for the any swing trade moves for $TSLA\n And yes lower to come overtime as this is just a higher degree corrective B-leg up (or lower degree wave C Into as far as I argued in the post in the link👇🏽\n\nstocktwits.com/MLinv/messag...",
        "sentiment": {
            "TextBlob": 0.15,
            "NLTK": -0.4939,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9987624883651733
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-06-02T10:19:09Z",
        "content": "$PBTS Premarket high already +38% from 0.052 to 0.072. I would very much welcome a Friday runner. Although 1:30 RS approved, it doesn’t change the forecast, as it would only adjust the price in the chart as the overall data remains the same. Delisting FUD made no sense as argued 2 months ago already. RS was expected so also nothing new about that. Stick to the chart. \nFib 0.618~0.786 remains my first scale out target range, though volume is needed which may come in if it breaks above the 55DEMA, read back my previous post for more in-depth TA👇🏽",
        "sentiment": {
            "TextBlob": 0.13164141414141414,
            "NLTK": -0.1166,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.99802565574646
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-06-02T10:02:47Z",
        "content": "$PATH (WEEKLY Chart) On my watchlist since April 2022, but didn't take any actions on it yet: just letting the chart develop. \nIn Accumulation way below Cathie's averages and moving back up higher in the Trading Range.  \nThere is relative high volume, yet the price (candles) are not in harmony, meaning: for a breakout you want to see Volume in Harmony with price action = large green candles instead of narrow ranging candles with many wicks. This indicates Smart Money is likely not ready to breakout of the Trading Range anytime soon + High Beta tickers usually ends in a \"spring\" (triple bottom) \n- Broke again above the 21WEMA (yellow line) in this (a) leg. \n- 55WEMA (blue line) has never been tested before: expecting a rejection there to form a lower degree (b) back on the 21WEMA move (where I may consider a scale in entry for a swing trade)  \ni.e. ≈15s to Fib 1.618= +50% ROI. \n- At C expecting a stronger rejection ≈ Fib 1.618 \n- StochRSI Bearish divergence. \n \n$ARKK $ARKF $ARKQ $ARKW",
        "sentiment": {
            "TextBlob": 0.04714285714285714,
            "NLTK": -0.891,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.995491087436676
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-06-02T08:28:10Z",
        "content": "$btc.X (Weekly chart) Add on to previous daily chart in this thread. Did retest the 55WEMA for support, but not yet the 21WEMA. The weekly forming a clear Distribution atm at the SOW phase. The overall wave 5 Upthrust (within this large Accumulation phase B)  I’m not near my desktop so for my in-depth chart read back this link. There I pointed out the “leading Diagonal” 👇🏽\n\nstocktwits.com/MLinv/messag...",
        "sentiment": {
            "TextBlob": 0.013945578231292522,
            "NLTK": 0.6428,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9992795586585999
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-06-02T08:22:47Z",
        "content": "$btc.X (Weekly chart) Add on to previous daily chart in this thread. Did retest the 55WEMA for support, but not yet the 21WEMA. The weekly forming a clear Distribution atm at the SOW phase. The overall wave 5 Upthrust (within this large Accumulation phase B. I’m not near my desktop hence screenshot from my phone, but for my in-depth chart read back the link below to my post of April. There I pointed out the “leading Diagonal”and so far still going as forecasted👇🏽\n\nstocktwits.com/MLinv/messag...",
        "sentiment": {
            "TextBlob": 0.024702380952380955,
            "NLTK": 0.6428,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9991160035133362
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-06-02T07:50:41Z",
        "content": "$BTC.X (Daily Chart + Weekly chart in the reply) I’m swing trading both sides of the trade and locking in (partly) gains accordingly. Overall in a low volume ABCDE correction on declining volume to probably shake out and wick one more time into low 25Ks to grab liquidity and wick into/retest the 21WEMA (atm at 25.8K see therefore in the comment/reply for the weekly chart). Overall I’m expecting short term correction in the markets into mid June, starting early next week. D could be a double top wick before E, which would be a swift move.\nInvalidation = if E would breakout on volume above B (+29.8K)\nRSI has already Bullish divergence, though usually ending in an unexpected shake out, as a stop loss raid and lure in shorts. \nTarget at 32-33K is a bit on the safe side as it may extend on exuberance into mid 34-37K as a terminal Upthrust. Read back through previous post to read back my HTF chart posted last April.",
        "sentiment": {
            "TextBlob": 0.05833333333333334,
            "NLTK": -0.128,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9973057508468628
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-06-01T17:06:17Z",
        "content": "@fvbusiness Yes already last December when everybody at 370s was posting it would already crash down to new lows, I posted not going to happen anytime soon and it will go back up higher into 420s over time. And my last update in the link below for $spy was early March at 380s when again I reiterated with a clear chart why it would go higher into +420s\n\nstocktwits.com/MLinv/messag...\n$spx $arkk",
        "sentiment": {
            "TextBlob": 0.07564534231200898,
            "NLTK": 0.2023,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9991599321365356
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-06-01T16:34:41Z",
        "content": "$arkk Add on to this thread: in the link my last updated HTF chart for ARKK in April. So far as expected still playing out on the way to the 55WEMA coming weeks. \n\nstocktwits.com/MLinv/messag...",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.2023,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9984716773033142
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-06-01T16:28:01Z",
        "content": "$ARKK 5 January 2023, you read an in-depth analysis with multiple charts for ARKK first in this thread below. Then the consensus was full of negativity. Now I read here and there also those some “news outlets” that were back then bearish amongst so called “analysts” turning slightly bullish. Intelligent people stick to the charts and base decisions on what Smart Money most probably does with logic reasoning well ahead of the consensus for the best Risk/Reward setup.\nThe daily noise is for amateurs and haters and for the “smart people, wise guys” that always talk the talk, but don’t walk the walk. ARKK on the way to wick into the 55WEMA coming weeks. I’ll post my latest updated chart for ARKK I posted few weeks ago in the comments for if you have missed it💰\n\n$ARKG $ARKG $ARKQ $ARKW",
        "sentiment": {
            "TextBlob": 0.2241269841269841,
            "NLTK": 0.217,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9926250576972961
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-05-31T18:59:58Z",
        "content": "Hi,\n\nI was really planning to stay away from StockTwits, but I will give it a last try. Thanks all for the nice comments which I just read. Encouraging and appreciated!\nTo protect myself from any negative Nancies: I’ll block anyone whining to me directly. No more nonsense discussions, especially if it’s not about the ticker of my post. Also no more “wise guy” negative replies as it doesn’t add value to the StockTwits community: I don’t care about your irrational gut feelings & weird gifs. All what matters to me is advanced TA thus LOGIC. So make notes if you’re learning advanced TA and you missed $PLTR for instance: below this post is my latest “on the nose” call/sniper avg (5.98) as a prime example why I always refer back to previous posts entries/exits, so you as the reader see: I’m not acting like those nonsense pump/dump accounts. In contrary to all that spam many times a day same tickers while changing their minds often: I don’t. Be open to learn🧠 so your ROI becomes more solid💰",
        "sentiment": {
            "TextBlob": 0.11287878787878788,
            "NLTK": -0.8882,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.995539128780365
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-05-31T18:27:24Z",
        "content": "$PLTR 8 November 2022 you read it here first when I posted my PLTR TA at 7.07 that it goes lower and to wait to scale in below Fib 1 (below 6.38) and if you did like me (5.98 avg) then you would have been up a whopping +140% already. I remember the irrational whiners back then talking about nonsense price targets at 1-3, while I pointed clearly out based on logic the Wyckoff Accumulation back then. And yet after this massive move up now everybody is a bull, when back then the emos were all over the place. Just sold 50% of my position at 14.60. The rest are free shares💰✅ \n@Hookedontonics this was a classic example🧠 \n\n$arkk $arkf $arkw $Arkq",
        "sentiment": {
            "TextBlob": 0.11458333333333333,
            "NLTK": 0.1531,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.999160885810852
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-05-29T08:16:48Z",
        "content": "@jamesmolloy271 @lau_jj9 add on to previous reply $mvis weekly closed 2 consecutive weeks above the 55WEMA, but still inside the Trading Range. The last time it was trading and closing above it was before October 2021. December 2022’s attempt failed and now closed 2 consecutive weeks above it. So could be 1.82 was the low but no confirmation until closing above the Trading Range.",
        "sentiment": {
            "TextBlob": -0.08666666666666666,
            "NLTK": -0.872,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9866513013839722
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-05-29T08:10:07Z",
        "content": "@jamesmolloy271 @lau_jj9  Thanks. If your read back my post here 8’ this $mvis thread of January 11th I pointed out it needs to reclaim the 55WEMA which it did last 2 weeks as it closed above it on rising Demand Volume so could be 1.82 was the low. But still Ranging inside a clear defined Trading Range so no confirmations yet until breakout above the range. \n\nstocktwits.com/MLinv/messag...\n\n.",
        "sentiment": {
            "TextBlob": 0.025,
            "NLTK": -0.0643,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9855747222900391
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-05-27T16:26:27Z",
        "content": "@Target_Trader Sure I’m still long $blde 3.93 avg since October I scaled in a position. Read back link below. Atm below my avg. however I scaled out some gains already at 5.06, which I always do for whatever ticker I’m going long in. Just securing always some gains to scale back I. Lower again. But will scale back in more once I’m out of some other swing trades in which I used my money for. Also RSI bullish divergence on the weekly: price made new lows, while RSI didn’t✅. BLDE is in accumulation with a wide range. Nobody is really talking about it: which is what you want. Could be the spring at 2.5s but no confirmation yet. \nAnyway Cathie’s avg is 11.12 so significant gains to be made \n\nstocktwits.com/MLinv/messag...",
        "sentiment": {
            "TextBlob": 0.11553030303030304,
            "NLTK": 0.6907,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9945085644721985
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-05-27T14:25:46Z",
        "content": "$ARKK Read my latest post for facts about NVDA rather than the misleading “she missed out on gains” narrative that’s all over the place atm as she bought already at $ 4 (!!). Missed out on gains lol. As I also mentioned earlier today Cathie approaches everything from Relative % gains to be made or R/R perspective. Cathie mentioned also to Bloomberg “relative valuations” to her criticasters about NVDA. The same mindset I have as a TA: i.e. opportunity costs. Read👇🏽\n\n$arkq $arkf $arkw $ARKG",
        "sentiment": {
            "TextBlob": 0.2635416666666667,
            "NLTK": 0.5972,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.998478353023529
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-05-27T14:04:54Z",
        "content": "$arkk last add on to this thread. I see many people spreading Cathie missed out on NVDA. Mentioned in previous post it’s so relative as she scaled those GAINS back into other tickers. The fact for NVDA only: she bought $NVDA at $ 4 (!!) in 2014 already and yes scaled out a big stakes in the +130-140s but still a whopping ≈34X. So she missed out on an extra 3X from then, while in the meantime already positioned in the next NVDA’s. All over the news the wise guys with their small pennies only focussed on the now keep on spreading one side of the story caring only about likes from their many followers while living an average life. Not being wealthy, just all day on Twitter posting trash without doing DD🧠\nClear example how misleading the news especially Twitter FUD is by sharing one side only.\nAlways look back up any data for what Cathie actually did, as ARKK is the only one (!!) being fully transparant. Here her decent comments, not fazed by any critics.   \n\nyoutube.com/watch?v=d_Rafet...",
        "sentiment": {
            "TextBlob": 0.07395833333333333,
            "NLTK": 0.377,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.998648464679718
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-05-27T13:34:58Z",
        "content": "$arkk Add on to this thread, (read back) as I mentioned Cathie was already accumulating AI stocks in 2017. Not now when the hype has arrived. The story she “missed” out on 1 ticker NVDA gains is relative. Yes she has been scaling out NVDA prior to the latest run, yet still held stakes: started scaling out more NVDA last 2 days. When out in January rotating in other tickers meanwhile that have much more % upside potential than $NVDA has. She did the same with $tsla years ago by selling off other tickers that ran and bought more TSLA eventually it gained relative in % the most.\nAtm over 90% (!) allocated in tickers using AI proprietary data. \nBut as always directly the “news” focusses only on the short term story that she sold too early, by leaving out other AI tickers she bought in return for months in the meantime. Every hype of the last years: ARKK has reported about it years prior to when it hit the consensus. But that doesn’t sell so not mentioned.\n\nresearch.ark-invest.com/dee...",
        "sentiment": {
            "TextBlob": 0.1056818181818182,
            "NLTK": 0.5635,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9966868758201599
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-05-27T11:56:24Z",
        "content": "@JHSSSS @rsmracks  I posted  in-depth TA for $NVDA 8 posts ago on my timeline, so check that post there or use the 🔍",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9977909326553345
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-05-27T07:29:51Z",
        "content": "$arkk Market ≠ a Reel Economy and is 6-9 months ahead. Yes recession FUD matters to the reel Economy but is already priced in the market. Yet the “news” as always continues spreading FUD and you question why markets kept rising since October when the “crash coming” was all over the news? Stop following any news! Stick to the chart, volume & data! \nSmart People are always screaming from the sidelines when the hype has arrived, always talking due to irrational thinking, but actually don’t say anything i.e. “the consensus”.\nIntelligent people have the ability to control their emotions by application of sticking to logic, facts, data & stats: “the contrarians”\n\nCathie bought personally $ 100K Bitcoin at $ 250 each not when the hype was there; bought Tesla 2016 when nobody believed it would succeed; mentioned AI in 2017 already & has positioned 90% (!) of ARKK’s holdings into tickers using AI with proprietary data: not when AI is suddenly all over the “news”!\nFacts🧠\n\n$IWM $QQQ $XBI $SPY",
        "sentiment": {
            "TextBlob": 0.1111607142857143,
            "NLTK": 0.4592,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.995406985282898
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-05-26T13:39:31Z",
        "content": "$PBTS (WEEKLY chart) Update to my last post of May 17th. I clearly pointed out that it needs to break the weekly above the 55DEMA. Then it did not and closed below, although in a bullish inverted hammer. \n- Money Flow Index (MFI) = Bullish divergence which occurs when the price changes to a new lows, whereas, the MFI indicates a higher low showing a boost in money flow. This implies that selling pressure is decreasing, and buyers are about to take over control. \n- Hence the many shake out wicks last days (stop loss raids) \n- Obviously to run it needs volume. \n- Last attempt on rising volume it got rejected at GREEN Fib 0.5. \n- Last days back down on declining volume = net positive = consolidation. \n- Next attempt to break the 55DEMA I expect price to wick into \"D\" target at minimum:  read back previous post where I pointed it out on the lower timeframe chart. \n- Historically PBTS ran fast up after the weekly closed above the 55DEMA \n- Red areas are liquidity resistance ranges.",
        "sentiment": {
            "TextBlob": 0.027656565656565654,
            "NLTK": -0.5574,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9992269277572632
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-05-25T20:44:59Z",
        "content": "@SugarButt @Kornie7 So $arkk held the 21DEMA at 38.35 on the daily. It just got to my attention that there’s a holiday on Monday in the US and markets are closed?  RSI is flagging. 41 weekly close  from here is +7%. That seem unlikely if Monday markets are closed. However pre and after hours it could go back up like yesterday when it went up 2% from 39.21 to 40. Monday it also managed to go up during regular hours on the daily from 38.73 to 40.76 = 5.2%. \nRead back this thread with some more charts as the 4H could be just an ABC move down on declining volume which ended in a doji the last 4H. The move up was on rising volume. \n55DEMA  38.10 could also be tested as another shake out wick down though. Let’s see tomorrow whether the weekly close is outside the downtrend as a confirmed breakout, as it failed so far on the daily. To be continued.",
        "sentiment": {
            "TextBlob": -0.03006535947712418,
            "NLTK": 0.0516,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9984686970710754
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-05-25T16:15:59Z",
        "content": "$PHB.X add on the chart",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9907480478286743
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-05-25T16:14:45Z",
        "content": "$PHB.X Entered at 0.7 avg this China crypto swing trade, with first PT ≈1.17 anticipating a move up soon as last week on high volume it moved up from 0.6 to 1 so Smart Money /whale(s) have been loading upfront probably. Last days declining volume retraced back down. See weekly chart in the reply.",
        "sentiment": {
            "TextBlob": 0.06696145124716554,
            "NLTK": 0.541,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.996801495552063
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-05-25T13:01:34Z",
        "content": "$ARKK Yesterdays’s post at 38s: you may think I’m from the future?🧙🏽‍♂️🎯 expecting ARKK to close strong on the weekly ≈+41s \n\n$IWM $SPY $XBI $qqq",
        "sentiment": {
            "TextBlob": 0.4333333333333333,
            "NLTK": 0.5106,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9874910116195679
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-05-25T12:19:44Z",
        "content": "$NVDA Add on to chart below. Those that understand and entered the “Shake outs” last December, (crashed down like-20-30% on the daily like $TWLO or $ROKU did for instance) and then within weeks back up 40-80%. “News” was super bearish for them back then. \nNow the other way around is an Upthrust (UT). A massive run, higher and higher. Exceeding previous ATH, even gaps up. It’s an inverse shake out. “News” is super bullish using the AI hype this time. Smart money needs exit liquidity, for sure consensus is creating it here reading through the endless bullish NVDA posts. Nothing wrong with NVDA: but the market doesn’t move on the long run on hype or earnings or whatever noise. The news for sure uses it to lure you in. Be wise and study what I posted below about NVDA. It may extend higher still, but my point is you should be trying to be on long run on the correct side of any positions you are about to scale into or out from. Risk/reward is all that matters at the end!\n\n$ARKF $ARKK",
        "sentiment": {
            "TextBlob": 0.10220143613000754,
            "NLTK": 0.9569,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9943543672561646
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-05-25T08:22:43Z",
        "content": "@Katarina84 @tctranfo @stocktwits Correction I meant $PHB.X not PhD*",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9982835054397583
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-05-25T08:21:52Z",
        "content": "@Katarina84 Nice and welcome. Also entered $phd.x (no @stocktwits thread yet @tctranfo could you please let the tech team create a thread for it?) I entered at 0.7 with ≈1.17s as a first target. As China crypto will be hot next week due to Hong Kong opens trading again in June so be ahead of the consensus. Just take a look at that chart as well. “They”  (Whales/Smart Money) probably have been loading already upfront as you can see on the high volume spike last week and consolidation on declining volume last days. So entered at 0.7 avg.",
        "sentiment": {
            "TextBlob": 0.21499999999999997,
            "NLTK": 0.8834,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9586966037750244
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-05-25T08:05:38Z",
        "content": "$NVDA (WEEKLY CHART) Due to a bug in the mobile app charts may be blurry, have had contact with StockTwits they are aware of this issue busy fixing it soon (see previous post yesterday on my profile). \nRead on desktop: still HQ \nTA: \nI exited NVDA at BC-range, but have been tracking the chart ever since without any new positions. So far textbook Distribution unfolding. Waiting for confirmation to go short as R/R for any long entries is becoming more bearish at this stage, because: \n- New HH after hours, probably creating exit liquidity for Smart Money, supported by \"great AI news\" = exuberance phase, whereas Consensus FOMOs in.  \n- i.e. Expanded Flat / Upthrust action (UT): \n- StochRSI Bearish Div❌ \n- Last year's move down supported by rising volume✅ \n- Move up divergence on declining volume: price up, volume declining = net negative overtime❌ \nRemember $ROKU 's double V-Top when I posted my exit back then \nLink to another NVDA chart: \n \nstocktwits.com/MLinv/messag...\n$ARKF $ARKK $ARKQ $ARKW",
        "sentiment": {
            "TextBlob": 0.09356146499003642,
            "NLTK": 0.9127,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9992949962615967
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-05-25T05:49:07Z",
        "content": "@SwingTradeToronto @Jinxis @Kornie7 I don’t agree on “no one has a clue”: it should be the “consensus” has no clue. This move up for $nvda is just a short squeeze and will become exit liquidity in an exuberance double top (Expanded Flat) on declining volume on the weekly = volume has no harmony with price action = divergence. Sure the FOMO consensus will want to buy this because of all the “great news” while Smart Money is selling to them. Open this screenshot: enough said. Let me remind you of $ROKU double top. This will become a great short when I got my confirmation.",
        "sentiment": {
            "TextBlob": 0.24209183673469387,
            "NLTK": 0.9153,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9995842576026917
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-05-24T22:05:52Z",
        "content": "$PEPE.X Scaled in Pepe today for a swing trade at 138 avg to ≈+260s as my first scale out target.",
        "sentiment": {
            "TextBlob": 0.25,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9924644231796265
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-05-24T21:26:44Z",
        "content": "@BuddyleeOnStocks Correct about $UFAB the filling👇🏽\n\nstocktwits.com/MLinv/messag...",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9984863996505737
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-05-24T21:21:20Z",
        "content": "$ENG 1 month ago and +60% later apparently I bought the bottom with a sniper entry when my limit buy to go long at 0.31 avg was hit. Now already 0.52 after hours💰. Read back my TA here why👇🏽\nSidenotr: On the mobile app the charts are blurry. Read it on the desktop for HQ and zoom in to see the details. I Have had contact with StockTwits already and they are aware of this bug and will roll out a fix for the app sooner than later. (See my timeline with a reply about it earlier today from Dev. team).",
        "sentiment": {
            "TextBlob": 0.03571428571428571,
            "NLTK": -0.1027,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.998689591884613
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-05-24T20:38:11Z",
        "content": "$ARKK Read the screenshot: as expected recovery started for ARKK at 2PM (see the 4H) after successfully backtesting the breakout last Monday + closed a green hammer candle on the daily while fearmongering the weak hands last 2 days✅ Expecting a solid +41 weekly close by Friday.\n\nWeekly chart link👇🏽\n\ntwitter.com/mlinv_/status/1...\n$spy $iwm $xbi $QQQ",
        "sentiment": {
            "TextBlob": -0.002777777777777774,
            "NLTK": 0.2263,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9722024202346802
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-05-24T17:54:00Z",
        "content": "$spy Since last year you could have read it here first in my charts👇🏽 as the consensus thought it would crash for new lows in December when I argued: No it’s going up higher! And I have stayed consistent in my posts, never being fazed by all the daily noise and the usual stoploss raids. I reiterated this again last March. Many doubt as they prefer to act on irrationality rather than sticking to logic. But as expected so far going as forecasted. 420s already hit. Smart Money always needs to get the consensus on the wrong side of the trade as they need to create liquidity to buy from or sell into. \n“The most hated Rally” LOL 🤦🏽‍♂️\nIt’s also a textbook news cycle all over again. Avoid the “news” noise or use it as a contra indicator at best.\n\n$iwm $arkk $qqq $XBI",
        "sentiment": {
            "TextBlob": 0.1360676088617265,
            "NLTK": -0.3583,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9990028738975525
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-05-24T16:33:12Z",
        "content": "$ARKK Add on what I wrote earlier today. Posted my last update Weekly chart about ARKK on Twitter yesterday. Due to a bug that on mobile charts on ST become blurry. Just a backtesting the breakout as argued below. \n\ntwitter.com/mlinv_/status/1...",
        "sentiment": {
            "TextBlob": -0.041666666666666664,
            "NLTK": -0.4404,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9996547698974609
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-05-24T16:11:15Z",
        "content": "$ufab add on to previous post, 1H chart: took out the first PT at 0.45 resistance when I sold 50% of my avg 0.33 at 0.43. My next scale out target would be the ≈0.58s if it gets there today.",
        "sentiment": {
            "TextBlob": 0.02777777777777778,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9980119466781616
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-05-24T16:00:55Z",
        "content": "$ufab Sold half with a sell limit at 0.43. For a ≈30% profit. Just got back at my desktop and apparently after it fully retraced back down after hitting first resistance again back at 0.28s which I wasn’t expecting. Still holding the other 50% at 0.33 avg for higher targets though. Great stock for swing trading with such volume.",
        "sentiment": {
            "TextBlob": 0.08207070707070707,
            "NLTK": 0.7906,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9427093863487244
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-05-24T14:33:44Z",
        "content": "$UFAB It was not my best entry 2 weeks ago, but maybe getting paid today then. Breakeven now.",
        "sentiment": {
            "TextBlob": 1.0,
            "NLTK": -0.2924,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9980675578117371
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-05-24T14:29:54Z",
        "content": "$arkk Just a backtest after breakout was to be expected🥱. After 2PM markets will be recovering if not sooner and probably closing green. The weekly is all fine. Just low volume supply dump.  \n\nJust shake outs across the board “timed” as usual. It’s just rotation $spy first time rejected at 420s as well but will go higher too. Debt ceiling nonsense or FED minutes doesn’t matter to markets, although the “news” is trying to believe you it does. It’s not like only the US is investing in US stocks only.  “They” will come up with any negativity to affect your emotions. Just stick to the chart, backtests after breakouts are to be expected. $IWM $xbi",
        "sentiment": {
            "TextBlob": 0.040740740740740744,
            "NLTK": -0.9491,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9967466592788696
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-05-17T13:25:57Z",
        "content": "$pbts Add on one more comment for now\nto my PBTS thread here with charts.\nPut the PBTS  chart on the 4H during regular hours first 4H +10M last 4H 23.8M for 2 days in a row. IF today again then it would result in 3 white soldiers on the daily with a Fib 1.618-2 target (D) as pointed out in my charts. So keep that volume on watch on the first 4H candle today.",
        "sentiment": {
            "TextBlob": 0.14285714285714285,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9933395981788635
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-05-17T11:38:46Z",
        "content": "@Rasto2020 You’re welcome. Yes the float back in May was 78M when the spike happened on 276M volume on June 9th so 3.5 times the float. Now the float is 837M so that means 2.9B shares on the daily if such a spike occurs.\nFrom the accumulation in February-May 2022 $PBTS extended from the low of 0.2518 to Fib 2.618 (1.6s) which was = Fib 0.618 on the total chart and after started ranging (consolidating) for many weeks before it hit the final target at +2s  at Fib 0.786 as pointed out in my post last year. \n\nMeasured from the low of 4.7s last days a Green Fib extension to 2.618 in my chart is exactly where it broke down in September 2022 below the 55DEMA in my chart at 1.40s. So to get there it needs to break through the first 3 “Supply liquidity ranges” which can only happen on extremely high volume mathematically. In confluence with white Fib 0.618. \n\nExtremely volume spikes are triggered by algos when specific technicals are triggered and become self-fulfilling prophecy so to speak.",
        "sentiment": {
            "TextBlob": 0.07044973544973544,
            "NLTK": 0.2263,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9977211356163025
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-05-17T10:53:13Z",
        "content": "$PBTS Add on to my Weekly and daily chart. Here a link previous successful Swing trades with 0.3167 avg and scaled out all at +2s as pointed out back then in 2022 and in 2021 1.02 and scaled out all at 1.7-1.8s.  \nRead back in the link  why I argued Fib 0.786 at +2s was the final exit in the summer of 2022. Nothing to do with dilution as the crash back down lower was to be expected as I argued back then. Good luck reading, if not interested just skip this post. \n \nstocktwits.com/MLinv/messag...",
        "sentiment": {
            "TextBlob": 0.07523148148148147,
            "NLTK": -0.1174,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9985582232475281
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-05-17T10:45:42Z",
        "content": "$PBTS (Weekly Chart) Higher Timeframe chart as add on to yesterday's update.. \nI've swing traded PBTS multiple times last 2 years and exited twice near the highs successfully (read back in the comment/reply to last years Swing trade post) \n- This is a weekly chart, the yellow line is based on the daily and is the 55DEMA (on the weekly ≈ 13WEMA). \n1. Every time it closed the weekly above this line, it ran up quickly. \n2. Atm closed yesterday above the 55DEMA already, weekly close is what matters \n- To move through all the \"Liquidity Supply\" resistances, it needs massive volume. Due to dilution since September the float has expanded massively and therefore it needs +100M volume for a big run, otherwise those ranges will be solid resistance/scale out PTs (Fibs). \n- Daily volume rising Demand volume✅ \n- Weekly StochRSI bullish divergence✅ \n \nSide note: if my chart is blurry in the app, open it on the desktop: ST is already aware of this bug (see my previous post on my profile) \n \nGL all!",
        "sentiment": {
            "TextBlob": 0.049999999999999996,
            "NLTK": 0.745,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.999041736125946
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-05-16T21:47:22Z",
        "content": "$pbts add on to my PBTS thread with charts and explanation. This move up was expected as argued in my chart, and so we got it at 17M volume confirmation on the last 15m candle only. That is not retail buying on such volume. 🧠 Read the thread if you missed it.",
        "sentiment": {
            "TextBlob": -0.025,
            "NLTK": -0.5719,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.998121440410614
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-05-16T21:38:23Z",
        "content": "@sudmoh @Sam1381 @EZMoneyBull $nvta Yes, but I’m totally not worried and see opportunities coming up as there’s still declining volume on the weekly and bullish divergence on the weekly RSI, which is prior to a larger trend shift, usually on a higher timeframe it ends with a stoploss raid, shake out wick down. Price makes new lows while StochRSI makes higher lows.\nIf a deep wick down happens retracement could go as deep as Fib 1.618 at 0.8s so not a POS: opportunities probably coming soon. Just wait for volume confirmation.\n\nRead this post 👇🏽 in the link below as well if you want to understand how Smart Money is able to “steal shares” this in confluence with the Ending DiagonalI I pointed out in my chart. \n\nstocktwits.com/MLinv/messag...",
        "sentiment": {
            "TextBlob": 0.08662818662818662,
            "NLTK": 0.9118,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9957937002182007
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-05-16T18:07:48Z",
        "content": "$SDC Zoom out on the daily and so far it’s going for a full retracement. Possibly even  a shake out wick below ATL. But the declining volume ≠ in harmony with price action. \nIf no shake out still waiting for a confirmation for a double bottom  (Eve) here to end this wave II. This screenshot is not SDC but as an example. \nSince March 2023 it’s also been in clear Accumulation and today breaking below this range. Averaged down as my limit buy just hit anyway at 0.36 from 0.51 avg to 0.41 avg. as if you zoom out: it is at previous Quarterly chart “open of the body” of the inverted hammer🧠 Again: shake out wick lower could still be but R/R is bullish looking at my previous post Quarterly chart👇🏽",
        "sentiment": {
            "TextBlob": 0.014646464646464642,
            "NLTK": -0.2732,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9959757924079895
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-05-16T17:18:01Z",
        "content": "$PBTS Add on to my 5minutes ago posted Wyckoff Acc. chart. Here the Spring development for a probable A&A schematic.",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.998080849647522
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-05-16T17:11:11Z",
        "content": "$PBTS  (Daily Chart) \n- StochRSI Bullish Divergence= higher lows, shake out price making lower lows on declining volume for the retest.✅ \n- Confirmation of A&A shake out pattern if it breaks above 0.0786 ≈ Above Fib 1. \n- Yellow line is based on the weekly chart and is the first major resistance 21WEMA = in confluence with Fib 1.618-2 range. \n- Forecasted path not timeline related, for indicative purposes only \n- Read also my previous post for in-depth understanding how a shake out develops and why. \n- In the reply an add on example schematic for an A&A Double bottom pattern.",
        "sentiment": {
            "TextBlob": 0.03598484848484849,
            "NLTK": -0.7845,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9970627427101135
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-05-16T16:29:24Z",
        "content": "$pbts Open this pic: A&A Accumulation pattern formed on the daily with two wick downs (stoploss raids) on volume. Confirmation of the pattern breakout above 0.0786 @fracas No Eve because the double bottom is too sharp already and if it was an A&E it’s usually without another sharp wick down like yesterday happened.",
        "sentiment": {
            "TextBlob": -0.08194444444444444,
            "NLTK": 0.0772,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9984726309776306
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-05-16T16:15:13Z",
        "content": "$PBTS 1 day and +30% later and even +50% since the shakeout/stoploss raid 4.7s low yesterday, can we finally really run on volume already? So done with this ticker chop chop!",
        "sentiment": {
            "TextBlob": 0.08333333333333333,
            "NLTK": -0.3382,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9992400407791138
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-05-16T15:11:12Z",
        "content": "$nvta Being a criticaster is the easy way what most do on StockTwits. Like posting a frenzy of opinions multiple times on a daily basis. I find such a waste of time.\nIn contrary I prefer sharing logic TA that may help out others that are able to understand it by just posting my own actions: no recommendation to buy or sell. If you find my actions useless, that’s alright. Just skip my posts. The credibility can be read on my timeline. Also for NVTA my locked in gains on swing trades have been very telling like when I posted I locked in a part of the swing at 2.93 as that was back then the pivot point. I added around Christmas during heavy FUD and 4 weeks later sold a part 2.93 while others where waiting 💰. Take advantage of such volatility if you’re able to read charts. Stick to the weekly candles and volume. Because based on gut feelings many didn’t sell thought it would run 3.5-4s already.  \nThose that share and add value are able to compound and multiply rapidly. Opportunity costs🧠",
        "sentiment": {
            "TextBlob": 0.1574074074074074,
            "NLTK": 0.9108,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9971871972084045
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-05-16T12:12:20Z",
        "content": "@Nick1971 Hopium Nick, could be a “spring” though after this long accumulation. \nHowever $ault has been Misleading retail consistenyly. It's all in the nuance of his words like \"currently\", \"not in \"2022\", \"foreseeable future\" while the writing of another R/S was on the wall. Millions off Revenues don't mean anything if there's no profit and losses going up. All tickers he is involved with $muln $alzn $MICS down the drain. There’s even no proof Todd has ever worked on Wallstreet, what he likes to claim.\nSame with “currently no dilution” at 2 $ only to found out later that 2 weeks after he posted that he started diluting the shareprice. It wouldn’t surprise me when he mentioned closing the ATM in X days last February and the price moves up to 0.15 that he then dumped most of the last part of the ATM. Divdidend cancelled, dividend approved etc, all repetitive  nonsense for many years.\n\nUnbelievable he walks (& flies lol) around without any security. \n\nNew lows now PM 0.067 already.",
        "sentiment": {
            "TextBlob": 0.05401812240047534,
            "NLTK": -0.8093,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9993222951889038
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-05-15T21:33:28Z",
        "content": "@sudmoh @EZMoneyBull @Sam1381 \n\nSudmoh: If you doubt my TA for $NVTA because you’re affected by some daily noise that’s alright. Then just don’t look at it simple as that, just skip my posts. \nHowever it makes no sense to use my account name in your posts here if you cannot reply in a respectful and serious way. I just scrolled through your account and you post daily just opinions only. It’s so easy to mock other people while not adding any value here yourself but just opinions on StockTwits. Grow up or get blocked next time. Agree to disagree, but at least substantiate why you think differently backedup with your own analysis🧠",
        "sentiment": {
            "TextBlob": 0.06458333333333334,
            "NLTK": -0.7201,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.998603880405426
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-05-15T15:48:50Z",
        "content": "I’m aware of it for many years but those who are not: read this decent article about how Smart Money manipulates and how they “steal” shares by executing stoploss raids, making quick profits from both sides of the trade.\n\nFor instance look at $pbts today at 10:25 EST for a latest prime example that I saw on my screen live happening.\n\ngriproom.com/fun/how-a-stop...",
        "sentiment": {
            "TextBlob": 0.30009276437847865,
            "NLTK": 0.8807,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9912779331207275
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-05-12T20:36:26Z",
        "content": "$DXY Last July 2022 was my last post for DXY but in 2021 and 2022 I reiterated that it would go up dramatically. So you read it here first that ≈114s was going to be the peak and so it hit that Target on the nose and down as expected🧠. Now just going shortly up to ≈103-105 as a short counter move, but much more downside into the 90s coming = then high Beta $arkk up. Will update DXY and ARKK charts over the weekend. I just read back my Wyckoff TA back then, read it and learn👇🏽to be continued!\n\n $IWM $QQQ $SPX",
        "sentiment": {
            "TextBlob": 0.07544444444444445,
            "NLTK": -0.4992,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.727386474609375
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-05-12T20:12:14Z",
        "content": "$ARKK (Daily chart) backtest held✅ $DXY was up today going to ≈ 103-105 hence ARKK down in line with this backtest that held. Expecting thedollar will continue going down sooner than later. Will update my DXY and ARKK charts over the weekend. 🧠",
        "sentiment": {
            "TextBlob": -0.07777777777777779,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9978646636009216
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-05-12T16:39:38Z",
        "content": "$ARKK (4H chart) possibly 37.37 is the magic number today for a bottom to wick into the previous downtrend and the 21DEMA. This candle’s open has not been filled with a wick which is… 37.37also RSI on the 4H completely oversold, maybe total recovery end of day let’s see 😤",
        "sentiment": {
            "TextBlob": 0.11904761904761905,
            "NLTK": 0.0772,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9978556036949158
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-05-12T14:58:34Z",
        "content": "@SwingTradeToronto link again ( seems not working the previous one ?) to my last $pypl post in 2021 and so far going as foreseen. \n\nstocktwits.com/MLinv/messag...",
        "sentiment": {
            "TextBlob": -0.022222222222222216,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9992923736572266
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-05-12T14:42:34Z",
        "content": "@Kornie7 $ARKK Rejected on the nose at the 144DEMA (red line) after it broke out of the downtrend on volume. Now doing a back test probably the 21DEMA. Could still be closing the weekly in a “2nd white soldier”.",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": -0.7269,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9988259673118591
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-05-12T14:31:15Z",
        "content": "@SwingTradeToronto $TWLO has still a gap at 26.71-28.59, and also not any confirmation that 41 was the bottom yet. The Distribution lasted more than 1.5 years from summer 2020 to February 2022. Then the mark down to 41 last November. And so if this is the Accumulation \"Trading Range\" now formed early part at 41-79.70 then wicks below 41 could be expected below the range. as it's now near ST_in_B \nBecause usually Distribution time  = Accumulation time and so possibly more than a year to go in this range. So great for compounding money, while trading the range until confirmation of next uptrend (SOS)",
        "sentiment": {
            "TextBlob": 0.14944444444444444,
            "NLTK": 0.659,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9956988096237183
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-05-11T21:08:27Z",
        "content": "@EZMoneyBull @Sam1381 April 1st was my last $NVTA update and so far just still going as I posted\n\nstocktwits.com/MLinv/messag...",
        "sentiment": {
            "TextBlob": 0.05,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9981076717376709
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-05-11T18:02:02Z",
        "content": "@Kornie7 $arkk probably tomorrow closing in a full green candle like last Friday as a “2nd White soldier” if next week with OPEX the 3rd is formed and after we’re good to go to the targets mentioned in my previous posted ARKK charts",
        "sentiment": {
            "TextBlob": 0.07592592592592591,
            "NLTK": 0.6597,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9863706827163696
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-05-11T18:00:04Z",
        "content": "$ARKK intra week though @Kornie7 open this pic. Possible 2nd white soldier in confluence with a break out above the 21WEMA. See next reply what I mean",
        "sentiment": {
            "TextBlob": -0.044642857142857144,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9211381673812866
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-05-11T17:55:48Z",
        "content": "@ManiDiamante $ufab open this 4H screenshot. Also RSI is uptrending. Could be a C&H though the handle retraced a bit deep, if you take the daily candle in consideration as I replied in previous replies and the confluence of the “Re-Accumulation after decline” I will wait it out until tomorrow.",
        "sentiment": {
            "TextBlob": -0.041666666666666664,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9620427489280701
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-05-11T17:51:48Z",
        "content": "@ManiDiamante $Ufab Seems to be on the 15min in “Re- accumulation after decline” add that to the confluence with the “morning star doji” on the daily (so far atm). This part could be the Handle forming of the Cup. See next reply",
        "sentiment": {
            "TextBlob": 0.03333333333333333,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9938197731971741
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-05-11T17:34:23Z",
        "content": "$SICP Something doesn’t add up with this large amount of sold puts for Opex next week. \n\nOut of nowhere Suspended… however in my experience usually a delisting follows after a statement like: “Ticker X will be delisted in X trading days” and then shorts are able to cover in those days and many traders trade these high volatile last days as well. But with SI we suddenly got suspended so far without any opportunity to both sides of the trade atm. \n\nExample if it goes OTC then still decide to hold on like with Luckin Coffee for instance in 2020 dropped to $1, got delisted and went to OTC, and after LKNCY 30X since those lows to 30s. Atm it’s still trading at 20s. \n\nIf you got any serious information to clarify, let me know.",
        "sentiment": {
            "TextBlob": 0.08909523809523812,
            "NLTK": -0.6426,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9987169504165649
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-05-11T17:15:46Z",
        "content": "@ManiDiamante $Ufab seems not over yet. The daily forming atm a “morning star” above the 55DEMA, so tomorrow probably up as Friday’s shorts also usually cover. What’s your avg?",
        "sentiment": {
            "TextBlob": -0.08333333333333333,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9947143197059631
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-05-11T16:19:38Z",
        "content": "@noblame  Yes I saw that news for $SICP , I never have experienced it before. I have traded stocks that were going bankrupt, so officially announced with chapter 11 or 7. Then usually they trade 2 more or weeks or so on the regular exchange and having some “exit pumps” as shorts need to cover. But in this case it’s going to get delisted because of compliance issues. This means it’s going OTC. I have no experience with this, and if and when we are able to sell our shares before that? Anyone else can answer?",
        "sentiment": {
            "TextBlob": 0.31,
            "NLTK": -0.2047,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.999707043170929
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-05-11T15:02:58Z",
        "content": "@DigitalDataNomad here the $META chart I posted 31 October 2022. Atm exceeding into Fib 0.618 range and in the exuberance phase most likely as the StochRSI is way overbought with a double top with slight divergence like June 2021 prior to the peak at September 2021. Will update Meta chart end of month again, after monthly close is in.",
        "sentiment": {
            "TextBlob": 0.1388888888888889,
            "NLTK": 0.5106,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9674240946769714
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-05-10T22:56:25Z",
        "content": "$SICP Last March I locked in 86% gains after I sold half of my position at 2.27. Still holding 1.22 avg the other 50%, atm halted since after hours👀  though it could last as long as 10 days. Many sold outs with a strike price at +10 at OPEX next Friday May 19th. In that range is also the 21WEMA near Fib 0.786 situated as pointed out in my charts. Let’s see what the halt is about. \n\nnyse.com/trade-halt-current",
        "sentiment": {
            "TextBlob": 0.03229166666666668,
            "NLTK": 0.2263,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9978349804878235
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-05-10T21:54:39Z",
        "content": "@Limey42 @Tintweezl $si isn’t on the Nasdaq, it’s on the NYSE. Here the link\n\nnyse.com/trade-halt-current",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9976577758789062
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-05-10T18:07:30Z",
        "content": "$UFAB in at 0.33 for a trade",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9954332113265991
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-05-10T13:03:02Z",
        "content": "$ARKK Remember, if you’re lucky you read it in my posts first: “Rotation”. And soon when it’s much higher the news will form the narrative risk-on, while the rug pull over time is then coming on the horizon. Nothing to do with CPI/PPI, last April when ARKK at 35s I read some big followed accounts posting bearish for ARKK and new lows coming, and now those same accounts suddenly turned into doubt and later on into bullish. No need to mention any names but probably you noticed it too. Remember: without charts to back up any statements made: it’s all just opinions! \n\nIn contrary therefore the rotation chart I posted was very telling as well as the declining volume I pointed out in my ARKK updates while it was on the way down in April from 40s to 35s! Timing tops or bottoms is useless but try being at the right side of the trade and make your money within the overall movement is best for your overall R/R. Stop calling people out and be positive and open to learn!💸💰\n\n$IWM $QQQ $SPY $XBI",
        "sentiment": {
            "TextBlob": 0.10464418622313358,
            "NLTK": 0.929,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9982312321662903
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-05-09T12:00:57Z",
        "content": "$PLUG Target range just hit premarket, ≈-52% down since I posted mid January Plug had much more downside to come within the overall Wave 4 correction. And so it just wicked into Fib 0.5 and so far bounced directly on volume when it entered the “Demand Liquidity 2 range. Waiting for the weekly close 👀",
        "sentiment": {
            "TextBlob": 0.09074074074074073,
            "NLTK": -0.7146,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9948773980140686
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-05-04T22:37:08Z",
        "content": "@Cash4freedom @cash4freedom @Vanlej04 @Kornie7 @IK17 $ARKK",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9810189604759216
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-05-04T22:36:22Z",
        "content": "@Vanlej04 @Cash4freedom @cash4freedom @Kornie7 @IK17 \n\nAdd on to yesterdays “Inverted hammer” I posted in this thread. Today $arkk got a textbook follow up as it wicked above the 8DEMA after rejection yesterday which lead to the inverted hammer. Early sign the double bottom for “B” has been set and move to ≈55WEMA is on the way. No confirmation yet, tomorrow will be more telling.",
        "sentiment": {
            "TextBlob": 0.15,
            "NLTK": -0.8442,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9918604493141174
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-05-04T16:45:52Z",
        "content": "$si 👀",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.8801432251930237
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-05-04T14:57:24Z",
        "content": "$ARKK Rotation: even without the “relative strength chart” I posted yesterday👇🏽, you can see it as ARKK is up 2.4% while SPY made lower lows in the pull back after 417. And so ARKK shows clearly relative strength. $IWM will catch up soon too\n\n $QQQ $SPY $XBI",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": -0.6477,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9957447648048401
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-05-04T13:33:24Z",
        "content": "$SHOP (WEEKLY Chart) Left Distribution February 2022 To find support at \"A\" between Fib 0.382-0.5. Therefore the higher timeframe correction lower to end Wave II is unlikely over and it's in a Redistribution so Smart Money may scale out higher overhead Supply. \n- Still in the Corrective B-leg up, moving higher near ≈ Fib 0.5-0.618 nearing previous support of the Distribution Range for a possible negative retest. \n- Usually C ends near Fib 0.618-0.786 Range. \n- StochRSI bearish Divergence \n- Divergence in Volume: price moves up on declining volume \n- No position, just monitoring the SHOP for a possible short over time, once B is confirmed. \n \nTo be continued.. \n \n$ARKK $ARKW $ARKF",
        "sentiment": {
            "TextBlob": 0.02317460317460318,
            "NLTK": 0.2002,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.99897301197052
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-05-04T12:06:59Z",
        "content": "@minimalist Here I explained it in-depth from different perspective, but all straight TA. Again FA is for a buy out or taking private. However Fair Value ≠ Market Value and so assets are under- or overvalued. Latest clear example was Twitter. Trading undervalued and then Elon bought it out much higher and took it private. Without Elon Twitter would have been still trading along the technical patterns within the specific wave it was in when it was trading at the market. Here the link to $ARKK higher timeframe with multiple charts. \n\nstocktwits.com/MLinv/messag...",
        "sentiment": {
            "TextBlob": 0.16666666666666666,
            "NLTK": 0.9468,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9980931878089905
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-05-03T21:35:14Z",
        "content": "@Kornie7 @atom_trader not only $PACW also $WAL 👋🏽",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.991020143032074
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-05-03T20:51:45Z",
        "content": "$ARKK (Daily chart) Smart money \"Rotation\" like I posed last week. Today more visible if you were following the intraday action, but in this chart clearly curling up: out of $SPY and $QQQ which are usually ahead first in the move up. But in the meantime they're rotating money into higher Beta assets in which $XBI is highest and therefore leading today and ≈ 5.9% up from yesterday's 79.73 close.  \n \n$IWM & ARKK curling up supported by volume: weekly close will be more telling for these indexes.",
        "sentiment": {
            "TextBlob": 0.1512987012987013,
            "NLTK": 0.8793,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.8301184177398682
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-05-03T20:10:38Z",
        "content": "@IK17 The inverted hammertoe $arkk was supported by Volume, so could be final shake out yes. But no confirmation until it breaks back above and closing above the 8DEMA as per the previous pic.",
        "sentiment": {
            "TextBlob": -0.03333333333333333,
            "NLTK": -0.1655,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9832040071487427
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-05-03T20:09:18Z",
        "content": "@IK17 I was expecting $ARKk it move back up a rejection at first attempt of the 8DEMA and so it did on the nose. \nThen it closed a bit ugly at 34.77 as it was better to have a close above 34.90, however it was an inverted hammer, with a very long wick up. Breaking the 8DEMA would be bullish confirmation, but I prefer overall to stick to the weekly close which will be more telling by Friday.",
        "sentiment": {
            "TextBlob": 0.04277777777777778,
            "NLTK": -0.3506,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9993133544921875
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-05-03T18:10:50Z",
        "content": "$ARKK $SICP That article is from November 2022! Get your facts straight, and Fool shouldn’t be relied on anyway! The only source is ARKF. @Estelleporsche here the link NO more SI\n\nark-funds.com/wp-content/up...",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": -0.6723,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9980384707450867
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-05-03T15:45:54Z",
        "content": "$SICP $ARKK didn’t buy Silvergate and has no position in it. Stop Posting factual wrong information and stick to the disclaimer of @Stocktwits",
        "sentiment": {
            "TextBlob": -0.5,
            "NLTK": -0.7579,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9997434020042419
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-05-02T22:07:37Z",
        "content": "$pbts Add on to previous “daily chart”, as I forgot to mention it: “A” got rejected as expected at first attempt at the 21DEMA to make a B-leg down after. \nB could also be  lower to fill the gap at 5.68-5.85 on the daily, but not necessarily, as on the 4H after hours that was filled already🧠",
        "sentiment": {
            "TextBlob": 0.02847222222222222,
            "NLTK": -0.4118,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9994814991950989
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-05-02T21:53:12Z",
        "content": "$pacw My sniper entry day trade today made me decide to be taking a pause until next week, as this week is overall really noisy due to the FED nonsense. Unless any targets are hit for other swing trade tickers I’m still in atm: no more new swing trades for me. I want to get out first of some longer time frame swing trades like $arkk $pbts $coin and $SICP to mentioned a few I’m still in, for more just scroll through my timeline. Although I’m not really into time as that is just a dimension, some trades take unfortunately a bit more time than I was actually anticipating. \nHowever no invalidations yet, just many shake outs after shake outs volatility across the board, but still holding all for my targets pointed out in my charts until further notice💰",
        "sentiment": {
            "TextBlob": 0.049147727272727273,
            "NLTK": -0.6183,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9984128475189209
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-05-02T21:22:17Z",
        "content": "@Cash4freedom @Kornie7 @Vanlej04\n$arkk on the daily TD8+9 printed, usually prior to a larger trend change. Could wick down below 34.81 to shake out still though, but the weekly close counts and I’m expecting volume should be coming back in this week. To move it violently, Smart Money needs liquidity, and that can be created by both longs as shorts. SM needs the consensus at the wrong side of the trade. Today they might have triggered more stoplosses  + at the same time lured in more shorts that are expecting it to crash down only so Smart Money moves it up the other way so shorts then need to cover to make it run more violently. This is just speculating, but just an example why at important pivot days indexes move very dramatically. In this way it may seem that”the news” mattered, while in fact SM just gets enough liquidity to make a big move of which they can profit from. Let’s see Fridays weekly close.",
        "sentiment": {
            "TextBlob": 0.03962301587301588,
            "NLTK": -0.7003,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9807369709014893
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-05-02T21:08:52Z",
        "content": "$PBTS Post 2/2 Daily chart: \n- StochRSI uptrending not overbought yet, after the clear shake out last week supported by high volume. \n- Not wicked into those 2 daily bodies yet ≈ Fib 1.618-2 for the overall C-leg as a first lower degree target.  \n \nTo be continued.",
        "sentiment": {
            "TextBlob": 0.07285714285714286,
            "NLTK": 0.5826,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9770386815071106
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-05-02T21:03:29Z",
        "content": "$PBTS  Post 1/2: update to my post last week with 2 charts. \n \n2H chart: Probably an Inverse H&S, but confirmed if it breaks above the clear neckline. \n- StochRSI oversold and again about to cross after this lower degree b-leg today (low volume pullback) after it finished the right shoulder yesterday. \nThis all within the larger C-leg with Fib 1.618-2 as the first minimum targets ≈ lower degree Fib 2.618-3 ≈ 0.12-0.14s \n- Overall high volume in this range, shake out after shake out to absorb the shares from weak hands. \n- See reply for the the daily chart",
        "sentiment": {
            "TextBlob": 0.06313186813186812,
            "NLTK": -0.8047,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.992609441280365
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-05-02T17:40:44Z",
        "content": "Also don’t “over trade”: what I often see here is people making great gains but then only to give it all back by entering the same ticker again ending up in heavy losses, because of an obvious wrong bias: this makes you lose more money than necessary. Better lock in the gains, walk away from the market, or move money to other tickers on your list that didn’t run yet, or are red on low volume etc: of course always based on the overall chart setup. The point is that many people “over trade”. Patience is a virtue: today for instance (see my timeline) I day traded very quickly in 30min $PACW with 35% gains. I posted my chart why I was successful doing so and no more trades for today. Compounding returns more and more quickly over time: just take a part of a move, lock in gains at your target, then wait for another opportunity whereas R/R is net positive. A shake out bounce trade like PACW is very effective if you understand the VSA on such low timeframe. Reflection is the key to growth🧠",
        "sentiment": {
            "TextBlob": 0.17588664421997754,
            "NLTK": 0.9695,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9359744191169739
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-05-02T16:35:39Z",
        "content": "$ARKK @Vanlej04 @Kornie7 @Cash4freedom No No, broken means closing the WEEKLY below it. I don’t count for shake outs on the daily. And @cash4freedom I never posted not to add, because I added myself at 35s as posted. However the low of B was 34.81 and today was 34.84 so technically not “wicked below it yet” and thus not broken! Also very low volume day across the board right “on time” with the FED FUD nonsense. This is how Smart Money manipulates you, meaning: IF it goes back up in a hurry tomorrow you might think it’s because of the FED, while it doesn’t matter on the weekly. \nIf the volume was high it would be counted as a sell off, but that’s not the case here. Always check volume: going down on low volume means: divergence in volume and price action🧠\n\nSidenote to Vanlej04 you should not use line charts ever. Stick to candles to read it correctly. 4H at minimum. You posted it broke down while it did not yet!",
        "sentiment": {
            "TextBlob": 0.05846153846153846,
            "NLTK": -0.9387,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9968529343605042
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-05-02T16:20:45Z",
        "content": "@Target_Trader I’ve no position yet at $chgg like I also posted when I posted this chart. I’m Waiting it out first to decide my targets after. However good sign is it has Highest volume here on the daily since February 7th, so let’s see how the daily candle ends first.",
        "sentiment": {
            "TextBlob": 0.24,
            "NLTK": 0.4939,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9813306927680969
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-05-02T16:01:04Z",
        "content": "$pacw Lastly an add on: the shake out when I bought: see the pin bar and the volume that came in at that specific candle🧠 as a classic shake out. Just for the quick day trade only and my target was the gap at 7.06 so it spiked above it and I sold at 7.22. Just as an example for anyone studying charts for very quick day trades with big gains potential. Will log out now and see after market closed how this day ended here. Good luck traders!",
        "sentiment": {
            "TextBlob": 0.1553030303030303,
            "NLTK": 0.7345,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.7011886835098267
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-05-02T15:52:00Z",
        "content": "$PACW And 30 minute later out, at 7.22 fast & furious is how I like it. Classic shake out, she also chart posted in the thread why and when I bought. It might go up higher but cannot watch the markets for the rest of the rest of the day. So limit sold at 7.22 37% gains! Good luck here",
        "sentiment": {
            "TextBlob": 0.2758333333333333,
            "NLTK": 0.8832,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.7797906398773193
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-05-02T15:38:30Z",
        "content": "@fvbusiness check also the volume spike on the 5min where they bought the shake out up. The candle ended in a pin bar, this is how they do it quickly. $PACW",
        "sentiment": {
            "TextBlob": 0.3333333333333333,
            "NLTK": -0.1779,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9938310384750366
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-05-02T15:13:19Z",
        "content": "$PACW just bought 5.33. Let’s see",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.5623720288276672
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-05-02T10:11:25Z",
        "content": "$CHGG (Monthly Chart) Last post was already May 2022: read back link below. CHGG has been in a downtrend ever since Wave I ended in 2021 and it left Distribution. Nothing goes down in a straight line so swing traded it a few times. Last time was May 2022 when I posted at 15s \"a bear trap as the volume was extremely low\". Thus scaled in another swing trade at 15s and then scaled out some  ≈26% gains next day (!) and scaled out the rest, closed position at 26s ≈73% when 55WEMA was rejected (EMAs weekly based) + Monthly StochRSI made a lower high \nWhat's next? \n- ABC 2014-2016: C ended near Fib 1.786 retracement. \n- Therefore C's \"Accumulation Range\" might be starting near ≈8-9s ≈ Fib 1.786 ≈ 0.786  \n- Volume has been gradually declining on the monthly \n- After & premarket also extremely low volume relatively to 3.2M avg. Smart Money takes it down, shaking out weak hands as a first overall \"Selling Climax (SC)\" \n- No position yet: on watch 👀 where high volume comes in \n \nstocktwits.com/MLinv/messag... \n \n💸",
        "sentiment": {
            "TextBlob": 0.00825727513227513,
            "NLTK": -0.8513,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9995474219322205
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-04-29T10:33:29Z",
        "content": "$ARKK Has been lagging, but in contrary to all the FUD in the “news” and on StockTwits posted by uneducated people: it’s just really normal, as Smart Money rotates from large cap; to mid cap; to small cap. Of course the “news” doesn’t tell you so, but the volume (smart money) spread  has been declining on the weekly, -53% lower than March. TA is leading, the news will follow A F T E R to backup any movements. \nTherefore I expect the next leg up in May to be led by high Beta stocks and the FOMO consensus as usual will be chasing at higher prices, while the contrarians have been positioned already waiting to scale out at the targets mentioned to that same FOMO consensus. \nContrary mindset, patience is a virtue: nothing of my forecast has been invalidated, the only thing that changed is more whining in April about ARKK lagging other indexes while the volume was net positive. A move down backed up by relatively higher volume would have been concerning🧠 charts👇🏽\n\n$ARKF $ARKG $ARKQ $ARKW",
        "sentiment": {
            "TextBlob": 0.07775412858746192,
            "NLTK": 0.2861,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9925063252449036
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-04-28T21:45:15Z",
        "content": "$SICP Add on to the monthly the weekly Chart: \n- Last week seems to be still Accumulation inside a wedge formation, after it bounced on significant volume from 1.1s to 2.45 \n- Forecasted path not  timeline related, just for indication IF it breaks above 2.45 along the Fibs, so far could be a wave LTF Wave 1-2 as 2 wicked into blue retracement Fib 0.786, but closed above it. \n- Weekly StochRSI bullish divergence, as it broke out already, while price wicked down to Fib 0.786 below the range to 1.23, but closed the weekly inside the range again at 1.35 today. \n- As the consensus expects it to crash down further (due to the high short interest), Smart Money in the meantime seems to be accumulating the shares sold by the weak hands. \n-HTF target wicking into the 21WEMA ≈ White Fib 0.786 which is based on the break down from the peak 24.71 from the bearish Rising Wedge formation ≈ Green Fib 0.5 based on the whole chart. \n- Market Value ≈ Fair Value: due to psychology FUD severely undervalued.",
        "sentiment": {
            "TextBlob": 0.01120082815734989,
            "NLTK": -0.8945,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.998439610004425
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-04-28T21:23:23Z",
        "content": "$SICP (Monthly Chart) Probably a Morning Star pattern on the monthly \n- Since the Capitulation last March, ever since it has been in Accumulation: see link below for previous charts. \n- Possible higher target remains the 21WEMA (EMA is weekly based) ≈ Fib 0.786 where also the previous support line of the channel is located, which would be usually, at first attempt, acting as resistance range due to the confluence of several factors: Fib 0.786, inefficiency of the open of the large red capitulation candle \n- Sold 50% last week of March at 2.27 as posted and thus still holding 50% risk free at 1.22 avg for the possible higher target. \n- In the reply the Weekly chart \n \nstocktwits.com/MLinv/messag...",
        "sentiment": {
            "TextBlob": 0.05662202380952381,
            "NLTK": 0.5994,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.998625636100769
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-04-26T14:30:26Z",
        "content": "$ARKK added at 35.63 averaged down from 37.94 to 36.26. \n\n$ARKQ $ARKW $arkf $arkg",
        "sentiment": {
            "TextBlob": -0.15555555555555559,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.99622642993927
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-04-26T12:46:54Z",
        "content": "$BTC.X  26-27ks was another obvious swing trade buy range. Getting paid again after closing my previous 30.7k short at 27.2K and turned it into a long with 32-33ks as target💰. Link for higher timeframe charts. \n\nstocktwits.com/MLinv/messag...",
        "sentiment": {
            "TextBlob": 0.006666666666666665,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9988442659378052
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-04-25T19:59:26Z",
        "content": "$PBTS my buy yesterday at 0.062 is going to save my day in the midst of this overall trashy market day!💸",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.5411,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9645938873291016
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-04-25T15:45:56Z",
        "content": "$CXAI Lol, this never happened to me: after that massive move last week I had another buy limit pending this time at 6.06 and also missed that one today 😤 Just opened my desktop to see it up +67% again!  Against all odds missed this twice🤣 Congrats to those who bought in at the 6s yesterday! Will continue following it for now to see how this plays out next days!",
        "sentiment": {
            "TextBlob": 0.16,
            "NLTK": 0.7119,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.999165415763855
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-04-25T06:30:49Z",
        "content": "$ARKK In previous ARKK post Fib 0.786 was not included. But 36/35s could be this shake out low to hit the previous downtrend slope as a retest for support and to fill the liquidity inefficiency at the open (35.60) of the 3rd weekly candle of last March. \n \n \n$ARKW $ARKG $ARKF $ARKQ",
        "sentiment": {
            "TextBlob": -0.05555555555555555,
            "NLTK": -0.1059,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9991257786750793
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-04-24T20:43:12Z",
        "content": "$si 4H chart add on to previous charts in this thread. Triggered SSR tomorrow on purpose? Let’s see.",
        "sentiment": {
            "TextBlob": -0.16666666666666666,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9956828355789185
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-04-24T18:06:16Z",
        "content": "$pbts Just saw in my chart I made a typo: 8 May 2022 = 8 May 2023*",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9891417026519775
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-04-24T18:03:29Z",
        "content": "$PBTS (Weekly chart) Atm holding 0.082 avg: I had a pending limit buy at 0.062 which was just hit today. \n \nIt could be a shake out, not certain though until back inside the Trading Range. \nHowever last year it needed to be compliant 11 July 2022 so before I scaled in a 0.3167 avg. \"They\" bought it up quickly within 2 days from 0.38 to 1.67 broke out above above both the 21/55 WEMAs! \nAfter closed it 10 consecutive days above 1. Before that move a shake out to 0.26 occurred. \n \nMay 8th is the next deadline to trade 10 consecutive days above $1 or they could file for an extension. IF 0.055 +Fib 1.618 retracement was the shakeout then Fib 0.786 is exactly $ 1. Still 14 days to go below both the 21/55WEMAs. \n \nLast year scaled out my 2nd Swing trade 0.3167 avg at +2s  (read back in the link below), while also trading it several times within the 1-1.5s during those weeks as posted. \nIn that chart in the link I also added my first Swing trade from $ 1s to$  1.8s in October 2021.  \n \nstocktwits.com/MLinv/messag...",
        "sentiment": {
            "TextBlob": 0.03913690476190476,
            "NLTK": -0.8227,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9966294169425964
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-04-24T16:08:17Z",
        "content": "$PBTS Wow buy limit that was pending since December hit at 0.062 avg down from 0.1423 to 0.082 avg. Could be a shake out, wasn’t expecting it would really fill it. Let’s see.",
        "sentiment": {
            "TextBlob": 0.04814814814814814,
            "NLTK": 0.4767,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9970080256462097
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-04-24T09:56:29Z",
        "content": "$TSLA Add on to previous post: Monthly Chart perspective \n \nCathie's 2000 forecast by 2027 would be in line with the HTF Wave V target ≈ white Fib 4.414 ≈ Green Fib 2 range. \nHowever, the Fib extension needs to be measured from where the C-leg ends to end overall corrective HTF Wave IV, to get a more precise Fib range target over time. \nSo for now I'm just focussed on the short term B-leg Swing trade within the overall downtrend. \n- Last month was on declining volume as can be seen from the weekly chart, and also here on the monthly. Expecting higher volume to come back in again like like January once the LTF B retracement is finished at ≈140-160 to start the C-leg. \n- Declining volume from the weekly chart perspective is, clearly visible on the monthly volume bar. \n \nTo be continued.. \n \nark-invest.com/articles/val...\n$ARKK $ARKW $ARKQ",
        "sentiment": {
            "TextBlob": 0.07361111111111111,
            "NLTK": 0.7717,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9991637468338013
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-04-24T09:06:42Z",
        "content": "$TSLA Add on to previous post: \nHigher Time Frame chart. TSLA is still in an overall HTF ABC down, after it left Distribution. Nothing goes down in a straight-line. \nAt the moment still within the HTF B-leg (C) and the LTF (B) down. \nSo be aware this is most likely still a counter move within the overall downtrend wherein Smart Money slowly scales out again at higher targets, while scaling out gains near the overall downtrend (Supply>Demand) until probable Fib 0.618-0.786 retracement where Accumulation happens (Demand>Supply) near the uptrend (See next comment for monthly chart). Probability higher first to absorb more Supply liquidity, but overall still expecting over time to end the HTF ABC near the ≈40-70 range into Demand Liquidity Range 2/3 (Fib 0.618-0.786). where also the overall uptrend is located. To measure those lower targets, first need to see how far into the higher Supply Liquidity ranges it's going to extend. \n \n$ARKK $ARKW $ARKQ",
        "sentiment": {
            "TextBlob": 0.0900352733686067,
            "NLTK": 0.0129,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9969987869262695
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-04-24T08:50:20Z",
        "content": "$TSLA (WEEKLY Chart) Update to my post last December:  \n- Read back in the link end of this post. \n- Read comments HTF chart. \nSo far still going as anticipated. After the higher timeframe \"Impulse\" A-leg correction last December, I scaled in for a short term intra-wave trade and locked in gains within this overall \"Corrective\" B-Leg wave in January. After it went another ≈30% higher to 217s, but I moved TSLA gains into other tickers with +100% ROI trades as posted back then. \nNow looking to scale back in another swing trade with +80% ROI potential, because: \n- Impulse 0-A = Fib 0.5 extension range ≈ 217 \n- Correction (A)-(B) on declining volume✅ so far Fib 0.382 retracement, but there's a gap below near Fib 0.5 retracement (≈147). \n- EMAs based on the monthly: \n*21MEMA = 221.25 \n*89MEMA = 135.90 = Fib 0.618 retracement (Deeper c) \n- The overall Impulsive C-leg extension into Green Fib 0.618-0.786 range ≈+300 \n- Weekly StochRSI Hidden bullish divergence \n \nstocktwits.com/MLinv/messag...\n$ARKK $ARKW $ARKQ",
        "sentiment": {
            "TextBlob": 0.01813725490196078,
            "NLTK": 0.5859,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9972723126411438
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-04-23T00:48:42Z",
        "content": "$OCUL  If you have read my post at OCUL then also do read again in the comments my replies to @lilcapman I lookedup this account’s profile after he/she called me a pumper. I’m obviously not acting like a pumper as all my posts are just my own actions only based on logic, backed up by TA and always when I lock in gains/losses. Just lookup my account and timeline for credibility and gains locked in for any ticker I have posted about or make use of the 🔍 to search through previous posts if any. Real pumpers are usually long time bagholders like Likcapman posting multiple times a day every day in the same ticker only. Always stick to your own risk management and especially never rely on what opinions based accounts post on StockTwits. Just read through the comments in this post as a prime example👇🏽",
        "sentiment": {
            "TextBlob": 0.10757575757575756,
            "NLTK": -0.4253,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9961387515068054
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-04-23T00:32:57Z",
        "content": "@lilcapman $OCUL Open this screenshot. You posted 20/10/2021 at 11s you thought the bottom was in and yet 2 days later it dropped to 6s. Enough said. The only pumper here is you. Better spend your time wisely and learn to read a chart, it wills save you time and money from just bagholding. All my posts are based on just logic in contrary to your irrational posts.",
        "sentiment": {
            "TextBlob": 0.19999999999999998,
            "NLTK": 0.7579,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9928722381591797
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-04-22T23:49:56Z",
        "content": "@lilcapman   Ah I see and understand your sour reply: you’re a bagholder at $ocul and that’s why you are posting on a daily basis many times a day in this thread. Sure you don’t need any TA to make any decisions, you just average down on your feelings at 5.88 only to see it drop another -56% to 2.57 after. Better be humble and open to learn knowing when to position rather than just buying because this post obviously is very telling among many others I just read while searching your account. All my posts at least are backed up by charts always incl my entries and exits. Same with your 8 resistance which is total nonsense as there were no stocks trades at 8-10 hence the gap.",
        "sentiment": {
            "TextBlob": 0.08296296296296295,
            "NLTK": -0.1779,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9986752867698669
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-04-22T14:37:11Z",
        "content": "$OCUL Add on: Fib 0.618 over the total chart  = Fib 1.618 on the pattern.",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9979421496391296
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-04-22T14:33:31Z",
        "content": "$OCUL (Weekly chart) Has been on my wachlist since May 2022 when I noticed a possible Adam forming. Ever since forming a textbook A&E + C&H and so I entered  6.14 avg yesterday. \n- Held the 55WEMA for support while forming the cup on declining volume ✅ \n- Weekly closed on significant higher volume✅ \n- Over time the distance of the Adam pattern = distance of the C&H ≈ Fib 1.618-2 \n- Near Fib 1.618 is also the first next block of sideways data  \n- Weekly StochRSI Higher High and broke out with more room to run✅ \n- IF it breaks out of the Cup, usually a backtest happens after near Fib 1.272, however not necessarily due to the gap. \n- Forecasted move is not timeline related, for indicative purposes only \n- In the comment the total chart for more perspective",
        "sentiment": {
            "TextBlob": 0.12926470588235292,
            "NLTK": -0.296,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9971057772636414
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-04-22T10:27:01Z",
        "content": "$ARKK Add on Weekly chart again, EMAs are monthly based:  \n- 21MEMA (Yellow) \n- 55MEMA (Blue) \n- They crossed lately \n- StochRSI bullish divergence \n- Target remains +50s into the 21MEMA which hasn't been retested yet for a probable first time rejection. \nIf 29s was the bottom for this overall WAVE II correction last years, remains to be seen, but still expecting to revisit \"ST in B\" again IF it first gets to my target pointed out in-depth in the other chart posted. \n \nTo be continued.. \n \n$ARKG $ARKW $ARKQ $ARKF",
        "sentiment": {
            "TextBlob": 0.009375000000000001,
            "NLTK": -0.3071,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9979409575462341
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-04-22T10:01:55Z",
        "content": "$ARKK (Weekly chart) Update to my previous post last February, when I argued ARKK is still in an overall \"Corrective\" wave 4 back up which has a \"C-leg\" target ≈Fib 0.382 (left in my chart). Read back the link below if you didn't yet. There you can read my total chart forecast. No recommendation to buy/sell, just my actions: forecast not timeline related, for indicative PTs over time only! Despite chopiness still holding a swing trade 3X leverage 37.94 avg. because: \n \nPROBABLE C Fib 1.618 based on TA theory: \n0 to A ≈ B to C  \ni.e. Distance 0 (29) to A (45) = Distance B (34) to C (≈53) = Fib 1.618 extension✅ = Monthly 21MEMA (blue line) ✅ = into Supply Liquidity Range (double top) \n- Retracement A to B was yellow Fib 0.618✅ \n- W1 = Green Fib 0.618 ✅  \n- W2 on declining volume = White Fib retracement 0.5-0.618 & Green Fib 0.236 \n- W1-W5 ≈ LTF Pink Fib 4.618 =  HTF Green Fib 1.618 \n- Weekly StochRSI Higher Highs \n- Comments another chart \n \nstocktwits.com/MLinv/messag...\n$ARKQ $ARKG $ARKW $ARKF",
        "sentiment": {
            "TextBlob": -0.006140350877192984,
            "NLTK": -0.6114,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9993166923522949
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-04-22T06:58:06Z",
        "content": "$btc.x Add on to previous post about the Weekly RSI making a Higher High while holding so far the 8WEMA at 27K  \nIt may wick down to the 55WEMA 25.7K  though as another shake out. For now already positioned at 27.2K\n\nTo be continued.",
        "sentiment": {
            "TextBlob": 0.03755555555555556,
            "NLTK": -0.1779,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9929071664810181
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-04-22T06:41:16Z",
        "content": "$btc.x Update to previous post. As I pointed out in previous posts, I locked in 75% gains on the way up, then  I started accumulating a short in the +30ks. Short term after my post a healthy short term correction back to the 55DEMA happened last days, but still expecting BTC to wick higher to ≈+32-33k Supply range. Consequently I locked in gains already of my short at 27.2K for 12%💰 it may wick down a bit lower to ≈26ks but R/R I already started accumulating a swing trade at 27.2K avg. Because back up higher within the leading diagonal for an higher “Upthrust” is still in play short term as the RSI is already totally oversold on the Daily, but on the Weekly a higher high. \nRead back my previous post incl. comments for higher timeframe forecast👇🏽 as I’m still expecting after the higher Upthrust, BTC facing a deeper retracement after. But just not yet!\n\nSo avg 27.2K and may scale in more if it goes down a bit deeper but already positioned. To be continued. \n\n$ARKK $IWM $QQQ $SPY",
        "sentiment": {
            "TextBlob": 0.07645555555555554,
            "NLTK": 0.7385,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9972620010375977
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-04-21T07:08:47Z",
        "content": "@Kornie7 I’m about to enter $tsla for another swing for the C-leg higher but not yet. Will post charts over the weekend🧠✍️",
        "sentiment": {
            "TextBlob": 0.25,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9743089079856873
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-04-21T06:23:14Z",
        "content": "@Kornie7 @Vanlej04 @Cash4freedom @stockwitsflare I’m having $TSLA on watch ever since I exited my last swing trade which was then the “A-leg”.  It’s still on my watchlist for another swing trade to higher targets after this “B-leg” correction is done. So far TSLA had retraced mid March to Fib 0.382, but I think it’s an Expanded Flat correction atm and so possible retracing back down to Fib 0.5 to fill a gap. But I Will post a chart over the weekend when the weekly close is in, so check my timeline by then. \n\n$ARKk at the moment is sideways on declining volume shaking out as many weak hands as possible. As long as there’s no invalidation ARKK is lingering on at the # 6 Creek👇🏽 Hence I replied yesterday to you all here: sideways action (corrective moves) takes more time then a move up or down. Impulsive moves (up/down) are swift in time, while the consensus then is waiting it out and FOMOing in while the R/R ROI is already done. \n\nWill update after OPEX and the weekly close is in.",
        "sentiment": {
            "TextBlob": 0.045925925925925926,
            "NLTK": -0.7579,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9946836829185486
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-04-20T16:56:59Z",
        "content": "$BZFD (4H Chart) Add on to the weekly chart. \n- Broke the white trending support slope \n- Wicked into Fib 0.941 \n- 4H StochRSI oversold and accumulation since mid March \n- Volume came in \n- Probably a shake out operation (spring) to get rid of the weak hands to end Z \n- Breaking above the 21WEMA (yellow line = 1.41 based on the weekly chart) would confirm my thesis. \n \nTo be continued",
        "sentiment": {
            "TextBlob": -0.075,
            "NLTK": -0.7964,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9907180666923523
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-04-20T16:52:15Z",
        "content": "$BZFD (Weekly chart) Limit buy hit at 0.69 as this potential wave 2 has unfortunately a deeper retracement: deeper than I was anticipating, but as posed previously: I will scale in a position on the way back down, based on the premise that 0.63 (closed candle) is still the bottom.  \nUsually lowest retracement is Fib 0.786, Accumulated since mid March (see comment for 4H chart) \nHowever  Fib 0.941 was hit today. Averaged down from 1.4 avg to 0.98 avg. \n \n- Probably a shake out operation as volume came back in, not confirmed yet, needs to go back up next days, so will see. \n- But Filled the last inefficiency of the open of the green hammer hammer candle at 0.68. \n- Weekly StochRSI bullish divergence: price made a lower low, but StochRSI has higher low so far. Also the StochRSI on the 4H is completely oversold. \n \nWave 3-4-5 are not timeline related, just for indicative price targets over time along the Fibs. \n \nLet's see how the weekly candle will close tomorrow.  \n \nstocktwits.com/MLinv/messag...",
        "sentiment": {
            "TextBlob": -0.03816425120772947,
            "NLTK": -0.9224,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.999254047870636
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-04-19T22:29:14Z",
        "content": "$ENG (Monthly chart) I have swing traded ENG many times as posted before. Last significant swing trades were in early 2021 with 2.01 avg: scaled out gains at Fib 0.786 8-9s +325% and the A-B move for +70% gains. Ever since it is down -90%. However great opportunities arising here again. \nI have patiently been waiting until today for another long position, because: \n- 2.5 decades long Accumulation forming \n- Triple bottom: crosses the dotted trend line for the 3rd time (1996/2013/2023) which could turn again in just another wick down on the Monthly candle. \n- Monthly StochRSI Bullish Divergence: Price makes lower lows, StochRSI makes higher lows + B to C = on declining volume✅ \n- How deep the shake out / retracement C is going to be remains to be seen, limit buy triggered end of day at 0.31 avg. If it goes lower to the 0.2s will expand position, if not I'm again already positioned as Risk/Reward is bullish over time. \n- Will update again if the weekly has more clarity \n \nstocktwits.com/MLinv/messag... \n \n.",
        "sentiment": {
            "TextBlob": 0.1626068376068376,
            "NLTK": 0.8718,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9957981705665588
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-04-19T17:54:05Z",
        "content": "$SICP Add on to previous very short term option bet by someone. Looking at the volume spikes  today Smart Money is loading. The option bet doesn't have to play out, but it's peculiar to say the least considering the \"Large inflow\"",
        "sentiment": {
            "TextBlob": -0.00761904761904762,
            "NLTK": 0.3031,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9734724760055542
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-04-19T17:48:13Z",
        "content": "$SICP Open this screenshot: yesterday someone sold a put with a $ 7.5 strike price coming Friday👀. Read back previous of my Weekly and 4H charts below as well:\n- Last week ended in an inverted hammer on volume\n- 4H chart you can see that Fib 2.618 for the possible Alternative C-leg is near 7.5🧠. Let’s see this plays out on OPEX.",
        "sentiment": {
            "TextBlob": -0.011111111111111108,
            "NLTK": 0.431,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9984073042869568
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-04-17T15:56:26Z",
        "content": "@philli1025 @fvbusiness Congrats! Yeah just take your part of the gains you target and compound it elsewhere. I usually don’t want to be in low liquid trades like $wint , as you have seen without volume it was mostly just 4-6 for 1.5 months since I scaled in here. But also posted end of Q1 why the move on volume by Smart Money likely was coming this Q2👇🏽🧠",
        "sentiment": {
            "TextBlob": 0.09285714285714286,
            "NLTK": 0.8268,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9970439076423645
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-04-17T15:35:47Z",
        "content": "$WINT Took much longer than anticipated but was worth the wait! Great start of this week! Limit sold 50% at 18.10 for 167% Locked in gains. Holding the other 50% of my 6.77 avg  for higher targets💸",
        "sentiment": {
            "TextBlob": 0.33999999999999997,
            "NLTK": 0.9133,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9900946021080017
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-04-17T07:39:14Z",
        "content": "$SICP (Weekly Chart) Add on to last weeks 4H post. \n- Last Week closed an Inverted Hammer on volume👀 \n- StochRSI oversold about to cross \n- 21WEMA 16.72 = Near previous support of the channel \n- 55WEMA 47.15 = Near previous resistance of the channel",
        "sentiment": {
            "TextBlob": -0.029166666666666664,
            "NLTK": 0.4019,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.999395489692688
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-04-15T06:39:17Z",
        "content": "$ARKK April’s In The Know with Cathie Woods. She discussed fiscal & monetary policies, economic indicators, market signals and innovation.\n\nyoutube.com/watch?v=CvRq_o6...\n$arkg $arkf $arkq $arkw",
        "sentiment": {
            "TextBlob": 0.2,
            "NLTK": 0.3818,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9679083228111267
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-04-14T14:47:23Z",
        "content": "$ARKK What have you done for me lately…?! The constant shake outs are getting boring here in this range, but continue holding my 3x long leverage.  Have a nice weekend all..  Ooh, ooh, ooh, yeah …😉🎶",
        "sentiment": {
            "TextBlob": -0.11250000000000002,
            "NLTK": 0.6996,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9909311532974243
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-04-14T11:01:50Z",
        "content": "$CXAI👀 Was on my watchlist for a while and had buy limits pending at 1.12-1.16. Unfortunately cannot get them all at the best prices so I totally missed on this one! But my sincere congrats to all who are in it or are trading it and are making insane gains! Just continue following it from the sidelines in the meantime! But what a rocket to 69 PM!",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.8715,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.8911041021347046
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-04-14T10:34:15Z",
        "content": "@DigitalDataNomad Additional $BTC.X chart: a more in-depth different perspective from trend line POV. \nAs you can see nearing long term support/resistance (orange) trend line and thus rejection to be expected in confluence with this exuberance yellow channel at FIRST attempt. Same with downside exuberance in Jun/Nov when it entered the outlier of the yellow channel",
        "sentiment": {
            "TextBlob": 0.075,
            "NLTK": -0.6705,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.54446941614151
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-04-14T09:27:13Z",
        "content": "$BTC.X (weekly chart update)  \n- I posted bottom last November (see the link)✅ : despite the FTX FUD Drama \n- Last March I reiterated more upside into the Supply Range (≈31-33ks)✅: despite all the banking FUD drama  \n \nHowever now in contrary to the FOMO consensus: \n* Nearing the end of the Leading Diagonal= minor Redistribution❌ \n* Double top StochRSI❌ \n* Up on declining volume❌  \n* Greedy news/FOMO❌ \n- Whether a spring as a last shake out remains to be seen, but for now based on previous arguments BTC is most likely in the latter stages of the Upthrust move expecting a move down next weeks \n- Accumulating short @ Fib 1.618 ≈31-33K \n \nstocktwits.com/MLinv/messag...\n$ARKK $SPY $IWM $QQQ",
        "sentiment": {
            "TextBlob": 0.08055555555555553,
            "NLTK": -0.4202,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9993019104003906
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-04-13T21:57:42Z",
        "content": "$SICP (4H chart) Update to my last post of March 31st in the link below. As posted back then \n- Sold 50% of my 1.22 avg at 2.27. \n- And still holding Risk free  the other 50% at 1.22 avg as no invalidations yet. \n- Invalidation would be a daily close below 1.05. \n \n- Assuming 1.05 was the low and a final shake out due to the high volume spike after back to 2.45 (A) For every seller is a buyer🧠 Smart Money loaded up on high volume here at 1.05 \n- Subsequently retracement after (B) to Fib 0.618-0.786 on declining volume (consolidation) \n- Then at B volume came back in and broke the overall downtrend + after a backtest last Wednesday to flip resistance into support✅ \n- IF it breaks above A, then minimum distance of A to C =  \n* Green Fib 1.618, but due to Gap1 likely higher = In confluence with white Fib 0.618 = in confluence with Green Fib 2.618 \n \n- Due to the high short interest, a wick back up into the 55DEMA to fill Gap2 to White Fib 0.786 possibly. \n- StochRSI bullish divergence \n \nstocktwits.com/MLinv/messag...",
        "sentiment": {
            "TextBlob": 0.015320197044334979,
            "NLTK": 0.4678,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9989294409751892
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-04-13T20:27:39Z",
        "content": "@Hookedontonics Great you made big gains on $TUP. Congrats! I’m just following it as I’m in too many other trades still. But From Monday’s 1.21 low to 1.87 high ≈54% already, the 4H chart looks also still very solid and consolidation pattern atm. With the the gap fill as first overall target. The weekly also so far a nice Doji with highest volume since 2020! Classic shake out✅",
        "sentiment": {
            "TextBlob": 0.20012820512820512,
            "NLTK": 0.8312,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9980785846710205
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-04-13T20:15:16Z",
        "content": "$CYTO Very deep shake out today to Fib 0.941 (1.25) pointed out in my chart👇🏽. Filled the gap at 1.32 and closed there as well. \nUnfortunately I have seen a lot of random “pump” accounts lasts two days here that were not here before. Just click 🔍 and you can see their history: most never posted at CYTO before, or they started spamming all kinds of random targets. What a sad life you have if you act like this on StockTwits. I have blocked most: so if you can read this, consider yourself not one them! Tomorrow’s weekly candle close will be more telling. Speculating: could be ending in possibly a hammer (pin bar) and then today was just a wick down. To be continued! 🧠",
        "sentiment": {
            "TextBlob": -0.0224537037037037,
            "NLTK": -0.8254,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9992597699165344
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-04-13T19:34:29Z",
        "content": "$CYTO scaled back in my gains of yesterday: at 1.29 and averaged down from 1.73 to 1.48 avg.",
        "sentiment": {
            "TextBlob": -0.07777777777777779,
            "NLTK": 0.34,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9915082454681396
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-04-13T18:47:44Z",
        "content": "$CYTO  Add on to 4H chart a repost if you missed this: \n \nOrder Flow Distribution: \nOpen the screenshot: just controlled price action by Smart Money (large) considering the overall high volume again today (7X avg). They just  load up the bid, while taking out stop losses from traders (small) to possibly fill the 1.32 gap. For every seller is always a buyer and vice versa🧠, but it it depends on whether they execute the active (market) orders and passive (limit orders). Check my timeline today: I posted a video for if you don't understand the process of how \"they\" manipulate the consensus at the wrong side of the trade consistently by imbalancing the order book.",
        "sentiment": {
            "TextBlob": 0.005021645021645028,
            "NLTK": -0.1531,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9983780384063721
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-04-13T18:43:00Z",
        "content": "$CYTO  4H Chart update to previous post (read back link below) \n- POC = Point of Control \n- Blue box = overall Trading Range \n- Rejected 3 times so far at the Supply Liquidity Range between Fib 1.414-1.618 (SOS = Sign of Strength) \n- So far retraced back down to Fib 0.786. \n- Gap at 1.32 (15 minute chart visible) at Fib 0.886 \n- Overall this could be the last \"Test\" in this Trading range to absorb Supply. LPS—last point of support, the low point of a reaction or pullback after a SOS. Backing up to an LPS means a pullback to support that was formerly resistance, on diminished spread and declining volume✅ \n- StochRSI = hidden bullish divergence (Made lower low, while price - so far- made a higher low). \n- 21WEMA (yellow line) is based on the Weekly chart in this 4H chart. And will be next resistance, \n- If it breaks above not much resistance until Fib 2.618 / Euler 2.718 \n \nstocktwits.com/MLinv/messag... \n \n.",
        "sentiment": {
            "TextBlob": -0.0018518518518518506,
            "NLTK": -0.4939,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.999297022819519
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-04-13T18:01:17Z",
        "content": "@billsmall $cyto Open the screenshot: just controlled price action by Smart Money (large) considering the overall high volume again today (7X avg). They just  load up the bid, while taking out stop losses from traders (small) to possibly fill the 1.32 gap. For every seller is always a buyer and vice versa🧠, but it it depends on whether they execute the active (market) orders and passive (limit orders). The latest post on my timeline today: I posted a video for if you don't understand the process of how \"they\" manipulate the consensus at the wrong side of the trade consistently by imbalancing the order book.",
        "sentiment": {
            "TextBlob": 0.04626984126984127,
            "NLTK": -0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9964419007301331
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-04-13T12:49:08Z",
        "content": "Direct link to the “Three Line Strike Pattern” I posted for $CYTO on Tuesday, if not familiar, remember it for whenever you stumble across this very rare (shake out pattern after accumulation)\n\nstocktwits.com/MLinv/messag...",
        "sentiment": {
            "TextBlob": 0.063125,
            "NLTK": -0.128,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9991905093193054
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-04-13T12:42:53Z",
        "content": "$CYTO Still holding 1.73 avg as posted when I locked in partly 111% already yesterday. Now this news just came out … 💰✅  \nThe very rare “Three line strike Pattern” playing out as posted 2 days ago. If you spot this very rare pattern, take notice for probably an excellent risk-reward setup. The  odd volume days prior was already an indication Smart Money was accumulating shares like I described in the link below or you c an read is back at my timeline on my profile, and so “they”  are positioned already. Then “suddenly” this news came out for the public🧠 💸",
        "sentiment": {
            "TextBlob": 0.22845238095238093,
            "NLTK": 0.8442,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.857851505279541
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-04-12T13:58:19Z",
        "content": "$CYTO Scaled out 50% at 2.56 of my buy yesterday at 1.21 yesterday for 111% gains. Holding 1.73 avg still. Link to post yesterday when I posted my buy when CYTO’s thread was quiet,  before all these annoying pump accounts popped up here. Just use the magnifier 🔍to search through accounts and see that most act like they where in it, while they never posted here at CYTO ever before. \n\nstocktwits.com/MLinv/messag...",
        "sentiment": {
            "TextBlob": -0.10000000000000002,
            "NLTK": 0.3566,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9993370175361633
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-04-11T21:25:31Z",
        "content": "$CYTO  Well well, glad I averaged down today at 1.21 holding 1.73 avg: what a sniper entry 💰🥷 As argued in the link below the very rare but potentially highly profitable “Three Line Strike” pattern (shake out), seems to be playing out💪🏽\nAll day CYTO’s thread was quiet, watch all those annoying pump accounts popping up here tomorrow. Hence be in it before such moves for low risk max reward probability. Rather than chasing like the consensus usually does.\n\nstocktwits.com/MLinv/messag...\n\n💸",
        "sentiment": {
            "TextBlob": -0.017283950617283952,
            "NLTK": 0.8515,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9963807463645935
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-04-11T17:57:36Z",
        "content": "$CYTO add on to my post of 15 minutes ago. Open this screenshot. Yesterday shares were bought up on high volume in \"large\" blocks. Today the large buyers are not active so far, hence the relatively low volume sell off  / possibly stoploss hunt.  \nAvg volume is 642K on the daily. Today so far only 638K, while 2.3M shares were traded yesterday. Low float is causing an extremely imbalance of the order book in confluence with the \"Three Line Strike Pattern\" I just posted looking at the overall volume development.",
        "sentiment": {
            "TextBlob": 0.05215986394557822,
            "NLTK": -0.5358,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9994639754295349
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-04-11T17:44:46Z",
        "content": "@niftybritches @Hookedontonics No, I think you are overthinking it too much (mean this in a friendly way🙂). I just posted a potential very rare pattern I have experienced in some other tickers last years as wel and then after over the days it moved back up quicklyl. The float is extremely low, and so volume is key and prone to easy large price swings to both sides. This move down is only on 614K volume so far, it could be that “those in the know” are accumulating as many shares as possible. Also that offering is still not completed with a PR at which avg price they finalised it. Anyway, check my post for the potential pattern in play in the $Cyto thread. It has been in accumulation since that offering was announced early March. Since April it broke out of the accumulation range and now doing a backtest. \n\nObviously I cannot know if a potential buy out is in the works. But here an article covering signs \n\ngriproom.com/fun/12-signs-y...",
        "sentiment": {
            "TextBlob": 0.11045540438397582,
            "NLTK": 0.2854,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9990496039390564
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-04-11T17:35:01Z",
        "content": "$CYTO On the daily a possible very rare \"Bullish Three Line Strike\" pattern forming here. If not familiar this is a trend continuation pattern that occurs in an uptrend, after consolidation.  \n- It is made up of three bullish candlesticks each with a higher close than the previous one on rising volume outside the \"Trading Range\"✅ \n- followed by a fourth candlestick that pulls back to the start point on low volume ✅.  \nBasically a backtest to shake out traders back inside the Trading Range. Today's fourth candle is a tall \"engulfing bearish candle\" that retraces all the gains made by the preceding three candles. @Hookedontonics Overall price action is significantly unusual. The float is very low so easily prone to manipulation by Smart Money, by imbalancing the order book in this manner.  Should have lowered my 2.15 avg position to de-risk yesterday & should also locked in some gains. But oh well, I Just averaged down at 1.21 from 2.15 avg to 1.73 avg. \n \n To be continued..",
        "sentiment": {
            "TextBlob": 0.056731411862990806,
            "NLTK": 0.5534,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9880539774894714
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-04-11T10:25:04Z",
        "content": "@DTT10 Answer 1/2 : basically a rethorical question, why would I be concerned about “shareholders” may get nothing? I already locked in nearly 100% on 50% of my initial $si position within a week and holding still the other 50%. Market price ≠ Fair value. If someone scaled in a long position at Distribution phase in the +200 and just held on all the way down, then the person cannot read a chart. \nAs long as a stock is trading on the open market it’s all affected by just psychology thus under- or overvalued hence the forces of Demand VS Supply. Whatever any news they come up with to affect sentiment: I’m not affected by it. Just cut all the noise and just stick tot the chart or spend time understanding advanced TA.\nI don’t mind taking a loss if my forecast has any invalidation. All what matters is that I make more money than I lose: which I obviously do if you read many screenshots of locked in gains on my timeline. Never marry an asset: you are trading/investing to make money…",
        "sentiment": {
            "TextBlob": 0.15162037037037038,
            "NLTK": -0.454,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9986880421638489
            }
        },
        "image_url": ""
    },
    {
        "username": "MLinv",
        "timestamp": "2023-04-10T18:02:18Z",
        "content": "$TRKA De-risking: scaled out 30% of my 0.1913 avg at 0.28 for +46% gains to start my trading week💰holding 70% for higher targets. Chart in the link 👇🏽\n\nstocktwits.com/MLinv/messag...",
        "sentiment": {
            "TextBlob": 0.25,
            "NLTK": 0.34,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9975541234016418
            }
        },
        "image_url": ""
    }
]