[
    {
        "username": "SKTrader1",
        "timestamp": "2023-06-22T00:12:15Z",
        "content": "$NVDA lot of stocks went on a parabolic run in valuation the last few years. They all got a major major correction into retails euphoria......tread lightly",
        "sentiment": {
            "TextBlob": 0.065,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9954929351806641
            }
        },
        "image_url": ""
    },
    {
        "username": "SKTrader1",
        "timestamp": "2023-06-21T23:58:20Z",
        "content": "$TSLA @magictape_behindwendys @PierceC  test drove the new bronco. Its official I am converting....kind of lol. Decided going for fully loaded blue bronco with top offroad package for 66k. Will turn my current jeep into a true rock climbing offroad jeep. Also decided going to let my shorts here and in $NVDA pay for it lol. The games you play when retired for entertainment lol. Bronco basically took all the flaws of the jeep and smoked it. Still gets 17/17 too with bigger engine. \n\nIf tomorrow is a big drop, people could've made a lot of money using this play. 😉I still have it....hopefully lol. \n\nWhen will i own my first EV? When someone gets it over 700 miles per charge. I also wont have a car that i literally cant differentiate mine from. If Tesla cracks 700 ill be getting a custom paint job on mine lol. \n\nGLTA",
        "sentiment": {
            "TextBlob": 0.3557575757575757,
            "NLTK": 0.9578,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9903680086135864
            }
        },
        "image_url": ""
    },
    {
        "username": "SKTrader1",
        "timestamp": "2023-06-21T17:03:00Z",
        "content": "$TSLA though this is expected, and bet accordingly.......the fact this is 2x lower than $NVDA today is laughable. If Tesla down 5% on overheated rsi then nvda should be down 10% lol.",
        "sentiment": {
            "TextBlob": -0.02222222222222221,
            "NLTK": 0.2023,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9993628859519958
            }
        },
        "image_url": ""
    },
    {
        "username": "SKTrader1",
        "timestamp": "2023-06-21T14:31:08Z",
        "content": "$NVDA can lose another 50 pts and still be overvalued. But please think this is some great dip to buy",
        "sentiment": {
            "TextBlob": 0.8,
            "NLTK": 0.8294,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.6574456691741943
            }
        },
        "image_url": ""
    },
    {
        "username": "SKTrader1",
        "timestamp": "2023-06-21T14:20:01Z",
        "content": "$NVDA show me the $$ Bearish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9957061409950256
            }
        },
        "image_url": ""
    },
    {
        "username": "SKTrader1",
        "timestamp": "2023-06-21T03:43:39Z",
        "content": "$TSLA could easily run to 303. To me its hard to call this move nonsense when I watch NVDA go up every day. Still will stretch out my avg up accordingly. GLTA and congrats bulls. Ill get paid on the backside.",
        "sentiment": {
            "TextBlob": -0.11944444444444445,
            "NLTK": -0.0258,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9921007752418518
            }
        },
        "image_url": ""
    },
    {
        "username": "SKTrader1",
        "timestamp": "2023-06-21T03:41:02Z",
        "content": "$NVDA well already upside 6 pts. Just looking for that spot to avg up. Clearly has more absurd momentum totally detached to valuations.",
        "sentiment": {
            "TextBlob": 0.024999999999999994,
            "NLTK": 0.4601,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.999283492565155
            }
        },
        "image_url": ""
    },
    {
        "username": "SKTrader1",
        "timestamp": "2023-06-20T16:15:51Z",
        "content": "$TSLA if this is because of Rivian using their 12k charge station.......Rivian? Lol. Next lot added.",
        "sentiment": {
            "TextBlob": 0.4,
            "NLTK": 0.4215,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9986149072647095
            }
        },
        "image_url": ""
    },
    {
        "username": "SKTrader1",
        "timestamp": "2023-06-16T13:39:58Z",
        "content": "$NVDA even if you love the stock and believe in its future of meeting these types of earnings, there is no value buying here after running 300% in 6 months. With a Fed that working against market and housing about to correct, and recession inching closer means you will be able at some pt to buy much lower. Greed annhilated many during covid market...",
        "sentiment": {
            "TextBlob": 0.33999999999999997,
            "NLTK": -0.3182,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9977874755859375
            }
        },
        "image_url": ""
    },
    {
        "username": "SKTrader1",
        "timestamp": "2023-06-16T13:19:07Z",
        "content": "$NVDA bears keep in mind this setting up for a blow off the top day possibly option friday and still allow pump this much in PM on .0004% shares outstanding. Trade accordingly. There is nothing to justify this endless tacking on of valuation but this synthetic pump raising flags we may not seen blow off top moment yet. Good thing is correction coming soon IMO.....why blow off tops happen? So MMs can get as many off their short positions before harshly correcting it. GLTA",
        "sentiment": {
            "TextBlob": 0.25749999999999995,
            "NLTK": 0.9377,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9977768063545227
            }
        },
        "image_url": ""
    },
    {
        "username": "SKTrader1",
        "timestamp": "2023-06-16T13:01:37Z",
        "content": "$NVDA 2.5B shares outsanding....yet recovers all on 1 million shares in PM. Mmmk",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.5267,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9941669702529907
            }
        },
        "image_url": ""
    },
    {
        "username": "SKTrader1",
        "timestamp": "2023-06-14T21:13:44Z",
        "content": "$NVDA start of short position 432. 1/4 weight. To add more if they want to run more. Dont even have to explain reasoning behind this scalp.",
        "sentiment": {
            "TextBlob": 0.15,
            "NLTK": 0.144,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9991563558578491
            }
        },
        "image_url": ""
    },
    {
        "username": "SKTrader1",
        "timestamp": "2023-06-13T19:38:23Z",
        "content": "$TSLA 100 pts in 1 month. Increase in valuation of 300B+. Yet somehow FOMO chaser still trying for more. It should never dictate your entries and exits. The reaper MM will come with a cooler soon. Wait for that",
        "sentiment": {
            "TextBlob": 0.5,
            "NLTK": 0.3182,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9866281151771545
            }
        },
        "image_url": ""
    },
    {
        "username": "SKTrader1",
        "timestamp": "2023-06-13T18:08:13Z",
        "content": "$TSLA I am back in short. Posted on chain and now here. Taking staggered approach .25/.25/.50 weight....259.50/265/275 stop 280. Sorry out wrong price pt for the last lot. Looking for 220 retrace. But respect this stock and its history of irrational behavior both ways.",
        "sentiment": {
            "TextBlob": -0.2,
            "NLTK": -0.1901,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9974856376647949
            }
        },
        "image_url": ""
    },
    {
        "username": "SKTrader1",
        "timestamp": "2023-06-02T19:34:41Z",
        "content": "$TSLA Bears just remember.....if they are trying to get ppl back into the markets and lets say theory holds recession comes. They still have to break the popular sentiment that its coming and generate lots of fomo retail buying first if that is the game. Id give these markets a little more time to run if thinking shorting long. Powell will have to continue the rate hikes but those effects are always delayed on the economy. There should be continued market momentum into next round of ERs",
        "sentiment": {
            "TextBlob": 0.056944444444444436,
            "NLTK": -0.3291,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9985263347625732
            }
        },
        "image_url": ""
    },
    {
        "username": "SKTrader1",
        "timestamp": "2023-06-01T05:07:41Z",
        "content": "@GetUpGoDown one final thought lol. We also are screwed because we got a lot of sleezy state officials trying to grease their election wheels issuing out money still. New Mexico issuing again in June 500 and 1k. \n\nThe blatant stupidity in this is astonishing because the poor who suffer most from inflation are not going to be miraculously saved or have their situation change much with 500$ or 1k$. Those with iobs and already higher wages and discretionary income just go spend it which doesnt lower inflation lol. Further shrinking the state revenue for much needed things like job growth and safer cities. \n\nIve seen so much reckless governance and financially spending and government debt piling that honestly its amazing it hasnt already cracked the entire system.",
        "sentiment": {
            "TextBlob": 0.18257575757575759,
            "NLTK": 0.7013,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9988085031509399
            }
        },
        "image_url": ""
    },
    {
        "username": "SKTrader1",
        "timestamp": "2023-05-31T17:49:46Z",
        "content": "$TSLA a little profit taking day does a market good. I take a lot of Vegas trips because it gives indicators and affirmations. \n\nHere are some assessments made:\n\n1) Middle-class families that got huge wage jumps are still fine. Inflation sucks for them, and they probably cut back some things, but for most part , they are happy, spending, gambling, and fine dining. \n\n2) Tesla is a top car company period. Their brand is here to stay. Will they continue growth in rate hike hell thats another discussion. \n\n3) Inflation is still bad and killing lower income families, and rate hikes will continue. Powell strategy has been the same since day 1. Kill growth to kill inflation. Last time I checked, the same a-hole Feds in charge.\n\n4) Market dives rarely come when all expect....very very rare. So either markets will chop till it comes, or they will generate another euphoria bull run before crashing it when it does.\n\n5) Do not believe anyone saying recession won't come. Just dont expect it now.",
        "sentiment": {
            "TextBlob": 0.20223958333333333,
            "NLTK": -0.9527,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9363471865653992
            }
        },
        "image_url": ""
    },
    {
        "username": "SKTrader1",
        "timestamp": "2023-05-29T01:57:02Z",
        "content": "$TSLA according to Vegas, we still got a while before a real recession. You can't deny there is a lot of Teslas, but I also saw the line for the supercharger station and pretty much laughed at the idea of waiting at one of those. \n\nThe economy is still strong, and yes means more rate hikes, but also means more time. Maybe they can use AI to get momentum for one final run. \n\nGLTA 🍻",
        "sentiment": {
            "TextBlob": 0.369047619047619,
            "NLTK": 0.951,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9762812852859497
            }
        },
        "image_url": ""
    },
    {
        "username": "SKTrader1",
        "timestamp": "2023-05-24T17:04:11Z",
        "content": "$LULU and still 100% overvalued",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9835597276687622
            }
        },
        "image_url": ""
    },
    {
        "username": "SKTrader1",
        "timestamp": "2023-05-24T17:01:58Z",
        "content": "$TSLA Descending buy volume during this bounce. See if its real....I would be skeptical",
        "sentiment": {
            "TextBlob": -0.5,
            "NLTK": -0.3182,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9953495860099792
            }
        },
        "image_url": ""
    },
    {
        "username": "SKTrader1",
        "timestamp": "2023-05-24T14:59:03Z",
        "content": "$TSLA either bounces off 172 to confirm and retest 193 or loses it and confirms downtrend and slides hard. GLTA. Heading to Vegas on Thursday. Son loved a video on his youtube of that dance group Illuminate. So taking him in person at Vegas for it. \n\nI know this is a tough game to be in. Reality is nobody will always be right. Especially with all that is going on these days with rates and inflation. Just dont let your mistakes be emotional tilts that cost you tons.",
        "sentiment": {
            "TextBlob": -0.049355158730158735,
            "NLTK": 0.5283,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.996073842048645
            }
        },
        "image_url": ""
    },
    {
        "username": "SKTrader1",
        "timestamp": "2023-05-24T14:33:32Z",
        "content": "$TSLA hey all. Sorry I have not been responding. Weather got nice which meant time to do some glamping lol. Going to Vegas this weekend. Nothing IMO has changed. Just look this last run taken back in basically a day and half. There always enough market momentum to get ppl chasing stocks but never enough to truly run and kicked back down. Best of luck to you all but I still dont see any reason to be long this market or economy.",
        "sentiment": {
            "TextBlob": 0.12731481481481483,
            "NLTK": 0.8845,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9961493015289307
            }
        },
        "image_url": ""
    },
    {
        "username": "SKTrader1",
        "timestamp": "2023-05-15T18:36:41Z",
        "content": "$TSLA zzzzzz........zzzzzzzzzzz.........they sure are content dragging this out.",
        "sentiment": {
            "TextBlob": 0.5,
            "NLTK": 0.3182,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9994909763336182
            }
        },
        "image_url": ""
    },
    {
        "username": "SKTrader1",
        "timestamp": "2023-05-10T16:21:58Z",
        "content": "$TSLA the chopped bleed out rolls on......zzzzz....",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9996250867843628
            }
        },
        "image_url": ""
    },
    {
        "username": "SKTrader1",
        "timestamp": "2023-04-26T15:40:33Z",
        "content": "$ENPH say hello to the valuation police. They are here to collect your money. Even gave you a fake brakeout to chase. Valuation always matters at some pt",
        "sentiment": {
            "TextBlob": -0.5,
            "NLTK": -0.4588,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9714899659156799
            }
        },
        "image_url": ""
    },
    {
        "username": "SKTrader1",
        "timestamp": "2023-04-21T19:59:54Z",
        "content": "$TSLA Typical option friday manipulation",
        "sentiment": {
            "TextBlob": -0.16666666666666666,
            "NLTK": -0.296,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9974679946899414
            }
        },
        "image_url": ""
    },
    {
        "username": "SKTrader1",
        "timestamp": "2023-04-20T15:53:41Z",
        "content": "$TSLA no point posting today. Too many useless comments with no logic or DD. Lot of desperation posts with illusion will help their positions.",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": -0.7579,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9991291165351868
            }
        },
        "image_url": ""
    },
    {
        "username": "SKTrader1",
        "timestamp": "2023-04-17T19:48:24Z",
        "content": "$TSLA zzzzz",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9940868616104126
            }
        },
        "image_url": ""
    },
    {
        "username": "SKTrader1",
        "timestamp": "2023-04-10T18:05:31Z",
        "content": "$TSLA This probably wont choose a real direction until after ER. Wouldnt be shocked to just chop until then",
        "sentiment": {
            "TextBlob": -0.24999999999999997,
            "NLTK": 0.2411,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9941408038139343
            }
        },
        "image_url": ""
    },
    {
        "username": "SKTrader1",
        "timestamp": "2023-04-10T15:58:25Z",
        "content": "$TSLA Discounting is a ST bandaid for demand. Sustained rate hikes and current rates will catch up with Tesla. Elon knows this and why has been calling for a 50 basis pt rate cut from FEDs. It is going to be hard to keep their growth cadence with rates going as they are. Just dont lose sight of that with hopium. Its just reality. All cars companies will struggle with these rates.",
        "sentiment": {
            "TextBlob": -0.14583333333333334,
            "NLTK": -0.1134,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.992061972618103
            }
        },
        "image_url": ""
    },
    {
        "username": "SKTrader1",
        "timestamp": "2023-04-05T02:06:33Z",
        "content": "$TSLA hey all. Im just watching these days. Honestly, I am more interested in what is going on with Trump than the markets right now. I still believe if they wanted to raid tsla it would have been a more extreme attack on the stock. Still think MM believes enough time for one more market rally. Guess we shall see.",
        "sentiment": {
            "TextBlob": 0.2729591836734694,
            "NLTK": 0.3848,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.819058358669281
            }
        },
        "image_url": ""
    },
    {
        "username": "SKTrader1",
        "timestamp": "2023-03-31T23:02:16Z",
        "content": "$TSLA sniffed this rally out here it comes. Deliveries of course are gonna beat the discounts were massive. Markets in a big rally as MMs sniff a window with discounts and tight labor market masking macroeconomic pressure being caused by inflation and rates. Green skies for a bit but I would consider scaling back positions and locking some profits on this market rally as the rates will inevitably push us towards recession later. Have a great weekend all",
        "sentiment": {
            "TextBlob": 0.052678571428571436,
            "NLTK": 0.7351,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9910507202148438
            }
        },
        "image_url": ""
    },
    {
        "username": "SKTrader1",
        "timestamp": "2023-03-29T16:58:22Z",
        "content": "$TSLA $ENPH $LULU closed all puts today. Took loss on lulu. Have a feeling we going to market rally through earnings.",
        "sentiment": {
            "TextBlob": -0.1,
            "NLTK": -0.2023,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9981154203414917
            }
        },
        "image_url": ""
    },
    {
        "username": "SKTrader1",
        "timestamp": "2023-03-28T22:59:57Z",
        "content": "$TSLA Lots of discounts at a lot of companies really helping with ERs. Revenues going up at the cost of margins but it seems may placate the markets this Q and allow for some more rally. Which be good for Tesla. GLTA but I may close my puts on enph and tesla this week for gains. Probably will balance out my losses on my lulu puts lol. Will keep monitoring ERs see if seems to be trending that way for overall markets.",
        "sentiment": {
            "TextBlob": 0.44000000000000006,
            "NLTK": 0.8806,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9940343499183655
            }
        },
        "image_url": ""
    },
    {
        "username": "SKTrader1",
        "timestamp": "2023-03-28T20:29:53Z",
        "content": "$LULU 😆 have at it. Cant win them all. Nuts lol im out at 349. Have at it fomo, this stock is something else.",
        "sentiment": {
            "TextBlob": 0.8,
            "NLTK": -0.3761,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9826503396034241
            }
        },
        "image_url": ""
    },
    {
        "username": "SKTrader1",
        "timestamp": "2023-03-28T20:23:28Z",
        "content": "$LULU wow congrats bulls. Everyone revenues going up due to discounts but they are holding up better than expected. I did just short 1k shares at 343 will cover if keep rushing to 350 as have hard time thinking they let it gap up this big without a retrace. Maybe get money lost on puts expiring late this year. Will reset puts at a later time. Again congrats bulls",
        "sentiment": {
            "TextBlob": -0.024074074074074074,
            "NLTK": 0.9062,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9569551944732666
            }
        },
        "image_url": ""
    },
    {
        "username": "SKTrader1",
        "timestamp": "2023-03-28T04:28:54Z",
        "content": "$LULU real moment of truth this ER. They managed to chop it back up. Priced a lot of upside already into this ER. Very easily could continue into a steep dive. That being said, if we break the technical pivot, I'll be taken my long range puts off the table for now at what would be a loss. To me, everyone doing sales can make revenues look good, but margins get crushed. I'm very curious to see how this plays out. Either way, no matter venom I get, it's no big if I am wrong. Means, I was too early and look for a better spot.",
        "sentiment": {
            "TextBlob": 0.10694444444444444,
            "NLTK": -0.0999,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9989120960235596
            }
        },
        "image_url": ""
    },
    {
        "username": "SKTrader1",
        "timestamp": "2023-03-28T04:22:10Z",
        "content": "$LUMN back on my watch if anything for a little squeeze and allow funds to unload more at higher prices. Could be a nice scalp. I am going to be trying to price the value if their fiber network and going concern with complete degredation of consumer business. Time to decide if this a buyout candidate or a liquidation bk story.",
        "sentiment": {
            "TextBlob": 0.2104166666666667,
            "NLTK": 0.7037,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.99843829870224
            }
        },
        "image_url": ""
    },
    {
        "username": "SKTrader1",
        "timestamp": "2023-03-27T20:00:42Z",
        "content": "$TSLA zzzz guess markets waiting for the ERs to continue to roll out. What a snooze fest today",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.989926815032959
            }
        },
        "image_url": ""
    },
    {
        "username": "SKTrader1",
        "timestamp": "2023-03-24T23:49:32Z",
        "content": "$TSLA where we are is really critical. Look at charts since November 1st. If this craters out and continues the pattern, then you are looking at 80s for the next true bounce. If it can catch another rush, it will snap this pattern as well. Right now, it is behaving like it wants to resume the downard slide IMO.",
        "sentiment": {
            "TextBlob": 0.16714285714285712,
            "NLTK": 0.5868,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.979925274848938
            }
        },
        "image_url": ""
    },
    {
        "username": "SKTrader1",
        "timestamp": "2023-03-23T18:58:05Z",
        "content": "$TSLA $LULU $ENPH back from a wonderful trip. My far out puts didnt do so well the last few days lol. Interesting market rally but really no stock has truly broken out of their downtrend. Just continued chop and bleed. No real positive progression. We will see if they all can actually continue a rally or this all just another market fakeout. \n\nHope you been doing well the last couple of weeks.",
        "sentiment": {
            "TextBlob": 0.13535353535353536,
            "NLTK": 0.9184,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9982513785362244
            }
        },
        "image_url": ""
    },
    {
        "username": "SKTrader1",
        "timestamp": "2023-03-20T23:18:45Z",
        "content": "$ENPH will resume its slide soon. Typical day needed to cool off current slide and weekly put options. Upgrade made by same guy on other stocks that ended the day red.",
        "sentiment": {
            "TextBlob": 0.00972222222222222,
            "NLTK": 0.3182,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9964088797569275
            }
        },
        "image_url": ""
    },
    {
        "username": "SKTrader1",
        "timestamp": "2023-03-17T19:15:54Z",
        "content": "$ENPH Those wondering I will likely take gains around 154$. Thanks for the big bump today. Watching a sunrise then seeing your Puts explode is a good way to start the day lol. GLTA. More pain for this, lulu, and tsla short term to come no matter if they chop bleed to get there.",
        "sentiment": {
            "TextBlob": 0.31428571428571433,
            "NLTK": 0.6494,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9930341243743896
            }
        },
        "image_url": ""
    },
    {
        "username": "SKTrader1",
        "timestamp": "2023-03-17T00:20:11Z",
        "content": "$ENPH no more bounces. Just pull the rug.",
        "sentiment": {
            "TextBlob": -0.25,
            "NLTK": -0.296,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9933128952980042
            }
        },
        "image_url": ""
    },
    {
        "username": "SKTrader1",
        "timestamp": "2023-03-17T00:18:02Z",
        "content": "$LULU just pull the damn rug already. You turned this over enough times already.",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": -0.4019,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9980779886245728
            }
        },
        "image_url": ""
    },
    {
        "username": "SKTrader1",
        "timestamp": "2023-03-17T00:15:06Z",
        "content": "$TSLA clearly an option scalp week. 😆 not missing much, but my puts here, on lulu, and enph are still tracking well. I think we go back to the 160s next week. I am having a fantastic time, and my son is obsessed with the ocean, and his face was priceless seeing the size of fish we caught yesterday. Hope you are all well. GLTA.",
        "sentiment": {
            "TextBlob": 0.1625,
            "NLTK": 0.9359,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9995266199111938
            }
        },
        "image_url": ""
    },
    {
        "username": "SKTrader1",
        "timestamp": "2023-03-13T21:27:10Z",
        "content": "$TSLA so interesting waking up to the market closed lol. I expected bounce from 166. Close enough. Maybe a bit of continuation pop tomorrow but fully expect it to get shut down and bleed back towards lows today if not lower.",
        "sentiment": {
            "TextBlob": 0.13492063492063494,
            "NLTK": 0.464,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9994413256645203
            }
        },
        "image_url": ""
    },
    {
        "username": "SKTrader1",
        "timestamp": "2023-03-10T23:32:04Z",
        "content": "$ENPH every pop finds its way back down. Wait till they bring the valuation rug pull",
        "sentiment": {
            "TextBlob": -0.07777777777777779,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9986899495124817
            }
        },
        "image_url": ""
    },
    {
        "username": "SKTrader1",
        "timestamp": "2023-03-10T23:31:19Z",
        "content": "$LULU just let it go.....",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9881244897842407
            }
        },
        "image_url": ""
    },
    {
        "username": "SKTrader1",
        "timestamp": "2023-03-10T23:28:17Z",
        "content": "$TSLA Aloha my friends. Well pretty much what I expected. Was thinking more like 166 for big bounce to shake and cool puts. Retrace to 173 area for today made sense. still think we going lower than 166 just a question if the bounce in the morning was it or if they maybe dip tomorrow then do another bounce to kill options for this week. Chopped bleed and my puts had a great week. GLTA and have a great weekend",
        "sentiment": {
            "TextBlob": 0.35,
            "NLTK": 0.92,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9949033260345459
            }
        },
        "image_url": ""
    },
    {
        "username": "SKTrader1",
        "timestamp": "2023-03-07T15:50:49Z",
        "content": "$TSLA $ENPH $LULU Sorry, not around much. Taking my son to Hawaii for the first time. We leave Thursday, so we have just been preparing for our 10-day trip. Wont be on much if at all next week. As for the stocks, we are in an extended market chop. Regardless, stocks never seem to really get momentum towards ATHs. Big pops followed by bleeds to same pivots. I am still expecting recession in 2Q/3Q. GLTA with your trading.",
        "sentiment": {
            "TextBlob": 0.043750000000000004,
            "NLTK": -0.5106,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9996346235275269
            }
        },
        "image_url": ""
    },
    {
        "username": "SKTrader1",
        "timestamp": "2023-03-03T15:34:26Z",
        "content": "$TSLA this kind of price action the last month is exactly why Tesla was my go to day trading stock. As a day trader, you have to love the volatility. As an investor, it can be stomach turning, lol.",
        "sentiment": {
            "TextBlob": 0.375,
            "NLTK": 0.7906,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9875355362892151
            }
        },
        "image_url": ""
    },
    {
        "username": "SKTrader1",
        "timestamp": "2023-03-03T00:41:36Z",
        "content": "$TSLA MMs collected from the option ATM last month.",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9937906861305237
            }
        },
        "image_url": ""
    },
    {
        "username": "SKTrader1",
        "timestamp": "2023-02-27T18:06:14Z",
        "content": "$TSLA 30m shares traded for original move. 60m shares to stay stuck. 🙄",
        "sentiment": {
            "TextBlob": 0.375,
            "NLTK": 0.5719,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9982524514198303
            }
        },
        "image_url": ""
    },
    {
        "username": "SKTrader1",
        "timestamp": "2023-02-27T05:53:44Z",
        "content": "$INTC when the price drops enough for this to have a 5% dividend yield I will begin my re-entry. GLTA. This will be bullish long but 2023 is going to suck IMO.",
        "sentiment": {
            "TextBlob": -0.025,
            "NLTK": -0.5927,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.998471200466156
            }
        },
        "image_url": ""
    },
    {
        "username": "SKTrader1",
        "timestamp": "2023-02-27T05:51:31Z",
        "content": "$VZ reality is the cell phone is considered a necessity now. Which secures its cash flow for deteriotating badly during a recession. This is the true safe dividend play.",
        "sentiment": {
            "TextBlob": 0.050000000000000044,
            "NLTK": 0.5423,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.8225155472755432
            }
        },
        "image_url": ""
    },
    {
        "username": "SKTrader1",
        "timestamp": "2023-02-27T05:47:46Z",
        "content": "$WISH talk about taking advantage of the IPO FOMO covid market to dump it all down the drain with 1 bounce.....insane",
        "sentiment": {
            "TextBlob": -0.15555555555555559,
            "NLTK": -0.1531,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.999028205871582
            }
        },
        "image_url": ""
    },
    {
        "username": "SKTrader1",
        "timestamp": "2023-02-24T21:05:12Z",
        "content": "$ENPH this will find 150s IMO. GLTA",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9944143295288086
            }
        },
        "image_url": ""
    },
    {
        "username": "SKTrader1",
        "timestamp": "2023-02-24T18:26:49Z",
        "content": "$ENPH Bring 150s for my puts. No more 200 saves left.",
        "sentiment": {
            "TextBlob": -0.125,
            "NLTK": -0.296,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9981233477592468
            }
        },
        "image_url": ""
    },
    {
        "username": "SKTrader1",
        "timestamp": "2023-02-24T18:24:12Z",
        "content": "$LULU My puts shall pay. They wont be able to keep this manipulated above 300 much longer.",
        "sentiment": {
            "TextBlob": 0.2333333333333333,
            "NLTK": -0.5267,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9992614388465881
            }
        },
        "image_url": ""
    },
    {
        "username": "SKTrader1",
        "timestamp": "2023-02-22T19:34:42Z",
        "content": "$TSLA bipolar board lol....\"rockets, its a squeeze, bears about to die\".......Just kidding. Lol",
        "sentiment": {
            "TextBlob": 0.8,
            "NLTK": 0.4939,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.989379346370697
            }
        },
        "image_url": ""
    },
    {
        "username": "SKTrader1",
        "timestamp": "2023-02-22T17:23:05Z",
        "content": "$INTC well I sold expecting dividend cut....didnt have to wait long lol 😆. It is sensible but damn this will be a tough year for Intel.",
        "sentiment": {
            "TextBlob": 0.12037037037037036,
            "NLTK": -0.431,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9970787763595581
            }
        },
        "image_url": ""
    },
    {
        "username": "SKTrader1",
        "timestamp": "2023-02-22T04:51:13Z",
        "content": "$DOCU just looking at this chart is a reminder how criminally insane the Covid market truly was.",
        "sentiment": {
            "TextBlob": -1.0,
            "NLTK": 0.0516,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.8206425309181213
            }
        },
        "image_url": ""
    },
    {
        "username": "SKTrader1",
        "timestamp": "2023-02-22T03:38:35Z",
        "content": "$LULU $ENPH they can't find any momentum up yet act like the hand of god in defense of 200 and 300. Low float stocks, smh. When they let go, look out. If Walmart is guiding down, then I am sure their will be many lining up to be new LuLu customers. ENPH is in an industry that is also in a crazy valuation bubble. Still way too far ahead of itself. 🍻",
        "sentiment": {
            "TextBlob": 0.06868686868686869,
            "NLTK": 0.5859,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9952604174613953
            }
        },
        "image_url": ""
    },
    {
        "username": "SKTrader1",
        "timestamp": "2023-02-22T03:27:55Z",
        "content": "$INTC What got me to early retirement was not marrying a narrative. \n\nWhen I entered Intel, I felt that they were grossly undervalued with a secure dividend. The close friends of mine who are managers at their various sites advised me of the positive enertia to change was being felt. \n\nI cleared my original buys at 28 when hit 30. Now I also sold all my buys at 25 and 26. My same manager friends now speak of how much truly needs to change and how difficult it is to attract real talent. That they did a 5% salary cut across all of Intel. \n\nThe cash erosion is bigger than I expected. Intel will turn around in the end. This is not a LUMN or such. The change is going to take a while. Their cash flows shrinking too fast, and we are not even in the recession yet, which when making 8B in cost saving cuts...to me puts the dividend more at risk than I like at 25/26. Instead, I am going to wait to reposition.\n\nThis be a tough yr for Intel. Ill add if goes lower or after if they cut the dividend.",
        "sentiment": {
            "TextBlob": 0.041963755199049324,
            "NLTK": 0.8085,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9989272952079773
            }
        },
        "image_url": ""
    },
    {
        "username": "SKTrader1",
        "timestamp": "2023-02-22T03:13:45Z",
        "content": "$ENPH Puts making money at least to 154. Simply put, it got way too far ahead of itself. Good luck all.",
        "sentiment": {
            "TextBlob": 0.125,
            "NLTK": 0.7096,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9952006340026855
            }
        },
        "image_url": ""
    },
    {
        "username": "SKTrader1",
        "timestamp": "2023-02-21T16:29:00Z",
        "content": "$TSLA everyone keep guiding lower.....yet the market tries to pretend like we are not headed for a rough year thanks to these rate hikes.....hmmm. some pt this will all come to head. If you dont expect it or plan with idea could happen.....well then you are trading on pure hopium. Hope everyone had a great weekend",
        "sentiment": {
            "TextBlob": 0.20285714285714285,
            "NLTK": 0.9001,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9042444825172424
            }
        },
        "image_url": ""
    },
    {
        "username": "SKTrader1",
        "timestamp": "2023-02-17T18:22:41Z",
        "content": "$TSLA Tesla on option Fridays=zzzzz",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9888958930969238
            }
        },
        "image_url": ""
    },
    {
        "username": "SKTrader1",
        "timestamp": "2023-02-17T01:47:39Z",
        "content": "$ENPH $$ Bearish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9877136945724487
            }
        },
        "image_url": ""
    },
    {
        "username": "SKTrader1",
        "timestamp": "2023-02-17T01:44:29Z",
        "content": "$TSLA The problem is not Tesla....the problem is the Feds. Very few ppl, even upper middle class, just buy their cars outright. The higher these rates go the less people will buy big ticket items. The discounts are great short term. It opens another layer of customers who can instantly jump in. Its not a sustainable model though as rates continue to rise as well as cost of materials. those same ppl will not be able to justify the rate they are offered. Its not being a hater of Tesla that I post more frequently bearish. Its the hater of Powell that does. \n\nThey printed a bunch of money. A lot more ppl are better off with better salaries. Now they want to bleed and take it back. Because in the end its about the people on top. Just never lose sight of that when trying to navigate investing.",
        "sentiment": {
            "TextBlob": 0.20685185185185187,
            "NLTK": 0.9343,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9876137971878052
            }
        },
        "image_url": ""
    }
]