[
    {
        "username": "Troutter",
        "timestamp": "2023-05-28T23:04:58Z",
        "content": "$ES_F $SPX $SPY Well, I guess a holiday weekend is as good a time as any to test those recent highs.  catch you guys later.",
        "sentiment": {
            "TextBlob": 0.2333333333333333,
            "NLTK": 0.7717,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.997832715511322
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-05-28T16:15:14Z",
        "content": "$ORGN Well, I don't think I posted any ORGN charts last week, and words can't fully explain it, so I'll just leave it at that.  Here's the chart.",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.1621,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9996780157089233
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-05-28T13:13:35Z",
        "content": "$NASDAQ $QQQ I'm going to pick on all you bears for a moment. However, this lesson is for all you bulls also.  Someday, you too will be on the wrong side of the trade, and when that day comes, at least you'll understand just how dumb you're acting.  We cats love to chase things, so just for fun let's pretend you and I are tailing a car.  The road is straight as an arrow and there's a river on the right for the next 100 miles. At every mile marker there's a road to the left.  If we turn left before the car we're tailing turns left we'll lose him.  He could keep going straight for another 100 miles, so trying to predict when he's going to turn left is pretty much pointless. Wouldn't you agree? I wonder why so many bears keep wasting money and looking silly by making left turns at random while the car they're tailing keeps going straight?  I'm gonna now take a short cat nap.  Wake me when the car we're tailing turns it's left blinker on.   $STUDY",
        "sentiment": {
            "TextBlob": 0.00046583850931677094,
            "NLTK": 0.4241,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9994767308235168
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-05-27T23:49:13Z",
        "content": "$SPX $SPY $ES_F  My final chart of the day with the lines I find the most interesting at this moment in time.",
        "sentiment": {
            "TextBlob": 0.3333333333333333,
            "NLTK": 0.4576,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9975415468215942
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-05-25T10:31:20Z",
        "content": "$SPX $ES_F $SPY  One more chart and it could change the way you look at price action.  The game is about MO (Momentum).  Notice the first two green ovals.  They're long and the distance between highs is substantial.  Now check out the last three green ovals?  Do you pick up the subtle changes in price action?",
        "sentiment": {
            "TextBlob": -0.023333333333333338,
            "NLTK": 0.2869,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9215252995491028
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-05-25T09:53:55Z",
        "content": "$SPY  I have a question for all you cool and not so cool cats.  Do you know the difference between \"chasing the laser pointer and napping under the bird feeder?",
        "sentiment": {
            "TextBlob": 0.35,
            "NLTK": 0.5574,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9968500733375549
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-05-25T09:15:27Z",
        "content": "$ES_F $SPY $SPX  5M  two bull legs up to resistance.  It might be time for a short rest.",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.999056875705719
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-05-25T00:04:53Z",
        "content": "$NVDA A while back an individual here on ST who happened to be short asked me, \"when do you think this bloated pig will come back down\".  I just said, \"momentum in either direction can be hard to stop and price usually goes further than most people think it will\".  Well, I was thinking NVDA might go to about $350 (top of the  range).  It's exceeded my expectations and now I'm calling it a day.",
        "sentiment": {
            "TextBlob": 0.03027777777777777,
            "NLTK": -0.128,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.986746609210968
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-05-24T09:28:56Z",
        "content": "$SPY $SPX $ES_F  It's early, but this might be my favorite time of day to look for a trade or two.  Volume picks up a little, but the price action typically isn't real wild.  I'm still getting acquainted with Quantower, so I'm not playing real big.  Truth be told, I never play real big, one ES contract is about as big as I go, because then the $$$ doesn't cloud my judgement.  A clear and stress free mind plays a key part in being successful at this game.  When emotions get involved all hell can break loose, so I never put myself in that kind of situation.  This morning I caught a trade with 5 MES contracts for 5 points while sipping coffee.  Not a bad start to the day, $125.  What did you do while sipping your morning cup of joe?  Anyway, Here's a glimpse into my life.   Heikin Ashi 5m,2m,1m and 15s across the top and traditional Japanese candlesticks of the same time frames on the bottom.  It's almost as if a person can see these moves coming before they happen.  Have a good day folks",
        "sentiment": {
            "TextBlob": 0.18570804195804194,
            "NLTK": 0.9375,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.943790078163147
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-05-24T00:16:26Z",
        "content": "$ORGN Well, my last post only received a couple \"likes\", so I'm gonna have to assume you humans aren't interested in learning how to catch birds.  But don't worry, I haven't given up on you nearly hairless creatures.  Here's pretty much the same ORGN chart I posted on Sunday, but it's got a couple more candles now and if you're feeling a bit lost check the notes from Sunday's ORGN chart. This is a little off topic, but I saw a human naked the other day and now I know why y'all wear cloths.  lol  Have a good night!",
        "sentiment": {
            "TextBlob": 0.19017857142857145,
            "NLTK": 0.9322,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9889209270477295
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-05-23T09:52:14Z",
        "content": "$SPX $SPY $ES_F Price is having trouble getting through the short-term (yellow line) trendline area.",
        "sentiment": {
            "TextBlob": -0.1,
            "NLTK": -0.4019,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9995794892311096
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-05-22T22:56:19Z",
        "content": "$ORGN Popeye who once said, \"I yam, what I yam, and that's what I yam\".  Well, this is maybe a little different than that, but it is what it is.",
        "sentiment": {
            "TextBlob": -0.09375,
            "NLTK": 0.1406,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9914494156837463
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-05-21T20:35:03Z",
        "content": "$SPX $SPY Since the futures open in less than two hours I have 4 quick charts of the $ES_F that you may find interesting.  Chart 4 of 4 are weekly candles and they show price holding and trying to stabilize above the 50% area of the recent range.  If you don't understand why ranges and the 50% area are important then it wouldn't hurt checking out the post I made earlier today on the subject.  Best of luck to all this week, bull or bear.",
        "sentiment": {
            "TextBlob": 0.19,
            "NLTK": 0.9257,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9921084046363831
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-05-21T20:31:32Z",
        "content": "$SPX $SPY Since the futures open in less than two hours I have 4 quick charts of the $ES_F that you may find interesting.  Chart 3 of 4 shows a breakout of weekly pennant.",
        "sentiment": {
            "TextBlob": 0.16666666666666666,
            "NLTK": 0.4019,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9870434403419495
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-05-21T20:30:31Z",
        "content": "$SPX $SPY Since the futures open in less than two hours I have 4 quick charts of the $ES_F that you may find interesting.  Chart 2 of 4 shows current daily support and resistance.",
        "sentiment": {
            "TextBlob": 0.1111111111111111,
            "NLTK": 0.6597,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.985305905342102
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-05-21T20:28:49Z",
        "content": "$SPX $SPY  Since the futures open in less than two hours I have 4 quick charts of the $ES_F that you may find interesting.  Chat 1 of 4 shows daily trendline support and resistance.",
        "sentiment": {
            "TextBlob": 0.13333333333333333,
            "NLTK": 0.6597,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9670984148979187
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-05-21T13:01:50Z",
        "content": "$ORGN This morning I was feeling less than inspired to chart, but I decided to push on anyway.  It appears I did more writing than actual charting. The concepts displayed on the chart are not new, but they are over looked by many people.  My hope is that this chart reaches those who will find value in it.  #STUDY",
        "sentiment": {
            "TextBlob": 0.15303030303030302,
            "NLTK": 0.8577,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9985431432723999
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-05-19T12:05:40Z",
        "content": "$ES_F $SPX $SPY  2D chart of the E-Mini and some thoughts, but always remember thoughts live only in our heads.  What's real is displayed on the chart.  Price is currently breaking out over the Sept 2022 high.  That high was 4175.  I expect the bears will attempt to make a stand up here.  After all, they've been winning this area for the better part of a year now.  However, if the buying continues I feel there's a pretty decent shot that price could go to about 4250 (aqua line) in the not to distant future.  Again, these are only thoughts, so don't try to hold me to what I said above.  The truth is on the chart.  I'm now going to close ST until at least after the close.  Have a good day.",
        "sentiment": {
            "TextBlob": 0.1483143939393939,
            "NLTK": 0.9664,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.5159022212028503
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-05-19T01:46:17Z",
        "content": "$SPY $SPX $ES_F I usually don't stay up this late, but since I'm still awake, here's one last chart.  Think about it, sleep on it, debate it, or whatever.  I'll be in bed, g'night!",
        "sentiment": {
            "TextBlob": -0.18333333333333335,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9954582452774048
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-05-18T19:45:41Z",
        "content": "$NDX Where done did awl da bears go?",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9988873600959778
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-05-17T19:24:09Z",
        "content": "$NDX  2D candles.  Hmm, Well, a few days ago I said I'd take chart requests and nobody requested a chart.  Which I think is the first time that's ever happened.  Today, I posted a couple charts and they received zero replies, so I guess if nobody cares then I'll get on with my day.  See you guys around the next bend.",
        "sentiment": {
            "TextBlob": 0.016666666666666663,
            "NLTK": 0.6249,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9984928369522095
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-05-17T17:39:25Z",
        "content": "$ES_F $SPY $SPX  It's fun trying to pick tops and bottoms, but the game is about money.  The money is in the momentum.",
        "sentiment": {
            "TextBlob": -0.05000000000000002,
            "NLTK": 0.5106,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9832200407981873
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-05-17T16:45:09Z",
        "content": "$ES_F $SPY $SPX It's been a fun day to trade and price just broke out over the trendline with conviction. 1h candles",
        "sentiment": {
            "TextBlob": 0.3,
            "NLTK": 0.128,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9552989602088928
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-05-13T12:48:17Z",
        "content": "$ORGN  (4 hour candles) Alright, well @Fuhk_it_Im_in asked for a chart and @tillage and I have been working on our mental game, so this chart is a bit psychology and a bit price action analysis, which is psychology!  See how everything is connected? Anyway, this got a bit long, but I think it's the kind of information that can help transform how a person looks at the market.   If you like technical analysis and if you want to get better at it, then this chart is for you.",
        "sentiment": {
            "TextBlob": 0.09642857142857143,
            "NLTK": 0.9252,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9660592079162598
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-05-10T15:51:25Z",
        "content": "$ORGN The chart I posted earlier today received 28 likes thus far, which indicates to me that you guys are interested in technical analysis!  A receptive audience encourages me to post more often.   So thanks for the \"likes\".  I appreciate that you guys enjoy my charting.  The day clearly isn't over yet, but am I the only one who finds the 4.43 touch and then pullback interesting? Here's a zoomed in look at the chart I posted earlier today.  The new annotation is in yellow.  Best of luck to all, bull or bear.",
        "sentiment": {
            "TextBlob": 0.2275974025974026,
            "NLTK": 0.976,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9949671626091003
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-05-10T13:10:14Z",
        "content": "$ORGN You guys didn't ask for it, but I've really enjoyed posting ORGN charts over the last year or so, so here's another one.  Many of the same notes as last time.  However, I've changed from traditional candlesticks to a Heikin-Ashi chart.  Heikin-Ashi sticks tend to filter out the noise a bit better than regular candles.  Which can at times help a trader stay in a good trade longer.  A super quick tutorial on Heikin-Ashi sticks is included on the chart, but it is brief, so do your own DD if you want to know more about this type of charting.  As always, best of luck to all, bull or bear.",
        "sentiment": {
            "TextBlob": 0.33111111111111113,
            "NLTK": 0.988,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9801316857337952
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-05-10T12:20:00Z",
        "content": "@Sphere No, the cat does not have my tongue.  I am the cat.  I've posted a few $PLUG charts recently showing some buying that was happening at the bottom of the trendline.  I was one of those buyers and I was wrong.   Attempting to trade counter trend (bottom picking) into a broader bear trend doesn't give the bull trader a high probability of success, but my eyes got big when I saw a trendline touch, so I gave it a shot.  Price was unable to gain any upward momentum and yesterday the bears overwhelmed the bulls and took price lower.  The bears are currently in charge of the price action and unless the bulls suddenly return I'll be looking for another entry somewhere around the bottom of the channel higher.  Which is currently in the $5.00 area.  You win some, you lose some.  That's all I've got.",
        "sentiment": {
            "TextBlob": 0.03153846153846154,
            "NLTK": 0.6652,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9955669045448303
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-05-06T12:57:34Z",
        "content": "$HUT and here's the chart that I had forgot to include.  lol",
        "sentiment": {
            "TextBlob": 0.8,
            "NLTK": 0.4215,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9973171353340149
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-05-06T12:56:53Z",
        "content": "$HUT I had planned to share this chart a few days ago, but then I forgot.  I took a few share around the bottom trendline and sold them yesterday for a quick swing.  However, I wouldn't be surprised if this one retests 2.00.  Middle of he range is 2.45.",
        "sentiment": {
            "TextBlob": 0.006666666666666659,
            "NLTK": 0.3402,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9966752529144287
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-05-05T20:02:29Z",
        "content": "$ORGN Well look at that.  4.18 seems like an appropriate close to me.  What do you think?",
        "sentiment": {
            "TextBlob": 0.5,
            "NLTK": 0.5574,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9932803511619568
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-05-05T18:49:03Z",
        "content": "$F Well, earnings didn't seem to move the needle enough to break the current pattern, so I guess I'll continue to sit back, wait, and collect dividends.  If only everything was this easy.",
        "sentiment": {
            "TextBlob": 0.08666666666666667,
            "NLTK": 0.6678,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9995206594467163
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-05-05T18:46:09Z",
        "content": "$ORGN I posted this chart earlier today for those who like this kind of thing.  However, I neglected to post any support and resistance prices.  The current red line resistance you see on the chart is at 4.18.  I have no idea if it will pose a threat, price at times has traded through it rather easily.  Just thought I'd share that extra tidbit of information.",
        "sentiment": {
            "TextBlob": 0.1722222222222222,
            "NLTK": -0.0516,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9985625147819519
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-05-05T18:36:50Z",
        "content": "$NDX $QQQ  There are people who believe what they think and people who believe what they see.  The thinkers will gather only the information that supports what they think, despite what they can easily see.  You will here them saying things like \"this will happen\" and \"that won't happen\".  Be very cautious of these people, because thoughts are not real, and thoughts do not live outside of our minds.  Here's what I see. Think about it, or maybe just see it without judgement.  You make the call.",
        "sentiment": {
            "TextBlob": 0.07752525252525252,
            "NLTK": 0.6915,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9903841018676758
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-05-05T17:54:29Z",
        "content": "$SQQQ It's been a while since I've posted an SQQQ chart, so chances are this chart will be viewed by a brand new batch of wide-eyed SQQQ long traders expecting this to be their golden ticket.  The road you folks are traveling is paved with the carcasses of those who came before you.  Consider yourself warned.",
        "sentiment": {
            "TextBlob": 0.12878787878787878,
            "NLTK": 0.0686,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.7798083424568176
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-05-05T16:33:59Z",
        "content": "$PLUG Well, I did some accumulating down here.  Did you?",
        "sentiment": {
            "TextBlob": -0.15555555555555559,
            "NLTK": 0.2732,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9897450804710388
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-05-05T16:27:49Z",
        "content": "$FIBK I still think this regional bank chaos thinger is over blown and I like this ticker.  1. The FIBK chief  (head honcho) of the financial officers (CFO) Marcy Mutch just purchased almost 128K worth of stock.  2.  Dividend is just over 8%.  3.  Price recently wicked the bottom of a 3 year long trading range and buying happened.  I'm cautiously optimistic.",
        "sentiment": {
            "TextBlob": 0.0625,
            "NLTK": -0.3976,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.5496866703033447
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-05-05T16:11:08Z",
        "content": "$SOFI it looks like a \"tale of two zones\" to me.  The trick is to do it right.",
        "sentiment": {
            "TextBlob": 0.2857142857142857,
            "NLTK": 0.3182,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.991923987865448
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-05-05T12:45:52Z",
        "content": "$BTC.X Holding the bottom portion of the upper part of the range, but price keeps wicking the downtrend line.",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9965971112251282
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-05-05T11:40:12Z",
        "content": "$SPX $SPY Here's a daily chart of the $ES_F with everything that currently matters, but without the clutter that doesn't matter.",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": -0.0157,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.993547260761261
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-05-05T11:24:14Z",
        "content": "$ORGN Into the mind of a technician.",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.7374475598335266
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-05-02T09:03:41Z",
        "content": "$F Well, from what I understand, today's the day.",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.2732,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9688946008682251
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-04-30T21:02:31Z",
        "content": "$AMD Pullback, break higher, pullback, break higher, pullback, break higher, pullback, break higher?",
        "sentiment": {
            "TextBlob": 0.25,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9896790981292725
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-04-30T20:50:23Z",
        "content": "$CCEP New ATH and there's still room to run.",
        "sentiment": {
            "TextBlob": 0.13636363636363635,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9985515475273132
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-04-30T20:46:59Z",
        "content": "$ZM To the moon and back.  I currently don't see any buying.",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9978196620941162
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-04-30T19:44:43Z",
        "content": "$LJIM $SJIM Here's the Hail Cramer ETF on the left and the Cramer Sucks ETF on the right.  So far, it appears Jimmy Chill is doing ok.  I still think these two ETF's are the dumbest things I've ever seen and the lack of volume seems to confirm my thoughts.  LJIM traded only 492 shares on Friday and SJIM traded only 1454 shares.",
        "sentiment": {
            "TextBlob": 0.0836734693877551,
            "NLTK": -0.296,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9828809499740601
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-04-30T19:30:20Z",
        "content": "$MJ When nobody cares, cheap tends to get cheaper.",
        "sentiment": {
            "TextBlob": 0.4,
            "NLTK": 0.4588,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9992653727531433
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-04-30T18:50:10Z",
        "content": "$MNST It's got wings!  Sorry, I mean mo.",
        "sentiment": {
            "TextBlob": -0.40625,
            "NLTK": -0.1511,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.996364951133728
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-04-30T16:09:46Z",
        "content": "$STNE There's a lot of really interesting charts right now and it never hurts if the ticker happens to be a Buffett pick, either.  This one can move from $12.00 to $8.00 and then back to 12 again within a few days.  It could rip your face off if you aren't familiar with how it tends to move.   So here's the deal.  There was a very steep selloff.  Price went from +$90 all the way down to $6 and change.  Since then it's developed a range.  Basically, although the price movement can be very violent at times, it's it's more or less going sideways.  These types of sideways ranges are typically accumulation and distribution areas.  I'll let you decide which one of the two you think this range might be.",
        "sentiment": {
            "TextBlob": 0.022652116402116396,
            "NLTK": 0.091,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9679544568061829
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-04-30T15:11:40Z",
        "content": "$FIBK Oh no, stay away from the regional banks!  I love listening to the media, because they are trying to move price.   The trick is to see through it all and that's where the charts come in.  I'll be watching for the buyers to come back.  I think this one is getting pretty close.",
        "sentiment": {
            "TextBlob": 0.25,
            "NLTK": 0.7424,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9627580642700195
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-04-30T14:52:07Z",
        "content": "My longtime friend @Headhunter80904 requested a $CGXEF chart.    I decided to filter out the noise and use monthly candlesticks.  There's some interesting stuff happening on this chart.  Best of luck to all, bull or bear.  Here's the chart.",
        "sentiment": {
            "TextBlob": 0.75,
            "NLTK": 0.9201,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9940536618232727
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-04-30T13:32:12Z",
        "content": "$MP  Those who have followed my charting for a while are maybe thinking \"Troutter has change, do breakout trades not work?\" For years I'd been posting breakout setups and suddenly now I'm posting more bounce plays.  For many years the markets were mostly bullish, so breakout plays worked just fine.  Then the bear market struck and many stocks are still trying to find their footing. Which has made making money from the bull side more challenging.  Traders who are ok with trying to fight the trend and are looking for low risk/high reward setups may want to take a closer look at MP.  Granted, when the risk is low and the reward is high the probability of success is also low.  You'll never get high probability and high reward to risk together.  It just doesn't work that way, but many times that's ok when the reward/risk is also high, like in this example it's about 4:1. There's always a bull case and there's always a bear case.  Who wins next is yet to be determined. Happy trading  $STUDY",
        "sentiment": {
            "TextBlob": 0.3162121212121212,
            "NLTK": 0.9798,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9020843505859375
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-04-30T02:10:08Z",
        "content": "$TRIP Every time I see a range I think about @_RangeTrader_ who has been MIA for over a month now.  Anyway, range trading when done right can give a trader a very high reward to risk ratio.  TRIP earnings is right around the corner, so keep that in mind, but I think the chart is worth keeping an eye on.  Risk $1 to possibly win almost 4 on a retest back to the middle of the range.  A trader doesn't have to be right very often when working with a 4:1 ratio.",
        "sentiment": {
            "TextBlob": 0.2627936507936508,
            "NLTK": 0.7071,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9948293566703796
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-04-30T01:35:27Z",
        "content": "Stocktwits hasn't added a board for $SUZ.  Maybe it's because paper products aren't all that exciting, but the chart is interesting enough for me to wonder if there might be a trade here.  Strong bullish engulfing candle off of a near perfect double bottom on Friday.",
        "sentiment": {
            "TextBlob": 0.33333333333333337,
            "NLTK": 0.9222,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9786312580108643
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-04-29T15:33:19Z",
        "content": "$AMZN  Ok, the boss lady is calling, so this will be my last chart for a while and it's a @Doozio!  Support, resistance, distribution, bear legs, bull legs, a double top, and even a double bottom.  It's got everything a good bear vs bull battle should have, and on top of all that, it's currently leaving us in suspense.  Enjoy.",
        "sentiment": {
            "TextBlob": 0.2888888888888889,
            "NLTK": 0.8832,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9987672567367554
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-04-29T08:56:04Z",
        "content": "$BORR Borr Drilling",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9759436845779419
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-04-29T08:49:21Z",
        "content": "$PERI Perion",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.8020836114883423
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-04-29T08:43:07Z",
        "content": "$COIN Coinbase",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.6805669069290161
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-04-29T08:37:33Z",
        "content": "$TLRY Tilray",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9775975346565247
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-04-29T08:33:08Z",
        "content": "$DIS DIS",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9980385899543762
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-04-29T08:20:48Z",
        "content": "$POWW POWW",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9898748397827148
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-04-29T08:16:15Z",
        "content": "$WISH Wish",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.4019,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9361000657081604
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-04-29T08:11:58Z",
        "content": "$HUT Daily",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9163206815719604
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-04-29T08:02:48Z",
        "content": "$ORGN",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9818381071090698
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-04-29T07:51:49Z",
        "content": "$PLUG 2W Candles",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9478639960289001
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-04-29T07:40:53Z",
        "content": "$PLTR Weekly Candles",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9047212600708008
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-04-29T07:23:58Z",
        "content": "$SOFI SOFI",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.723222017288208
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-04-29T07:03:34Z",
        "content": "$F Ford",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.7425916194915771
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-04-29T06:53:33Z",
        "content": "$AAPL",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9836944937705994
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-04-27T23:00:44Z",
        "content": "$ES_F $SPX $SPY  Maybe the most interesting chart in the world.",
        "sentiment": {
            "TextBlob": 0.5,
            "NLTK": 0.4576,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.8357353210449219
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-04-27T22:52:17Z",
        "content": "$ORGN Same chart, but different day.  Oh yeah, and it's inverted (upside down).",
        "sentiment": {
            "TextBlob": -0.051851851851851864,
            "NLTK": 0.4215,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9895344376564026
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-04-26T21:27:47Z",
        "content": "$ORGN Earlier today I posted a chart and I said some things that maybe I shouldn't have said.  If I offended anyone, I apologize.  Here's today's closing chart and I'll let it do the talking.  Best of luck to all, bull or bear.",
        "sentiment": {
            "TextBlob": 0.5,
            "NLTK": 0.765,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9220216274261475
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-04-26T15:07:12Z",
        "content": "$ORGN I probably shouldn't say it, but scrolling through the ORGN stream today kind of makes me giggle.  There are many bulls here and you guys have strong bullish convictions for this stock, yet I keep hearing people saying things like, \"I'm sorry\" and \"I got it wrong\", ect.  Everyone is second guessing themselves, yet technically speaking price is in a very interesting area for the bulls.  I see so much negative emotion today, yet price isn't tanking.  You guys are actually up a penny on the day.  Put on some calming music and relax.",
        "sentiment": {
            "TextBlob": 0.08833333333333335,
            "NLTK": 0.9507,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9938212037086487
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-04-26T09:15:06Z",
        "content": "@Rookie_of_The_Year That's a good question.  Let's see, I went from being up 12% on my initial entry to down 5% in a matter of a week.  Long-term price is clearly bearish.  However, there has been enough buying in the past to play this down trend from both the bull and bear side.  Price is currently closer to the bottom of the channel than it is to the top.  I still feel price is currently in a \"buy zone\" for a bounce play, so I'll look to add if I see a compelling reason to think price has bottomed sometime in the future.  I should also point out,  $ORGN is only a small portion of my portfolio, so I don't live or die with every candlestick like the people who are over exposed to this ticker.  If it eventually works the way I think I might, I'll make a little money.  If not, I'll lose a little money.  Either way, I don't lose sleep over this ticker, or any other ticker.",
        "sentiment": {
            "TextBlob": 0.02362514029180695,
            "NLTK": 0.9641,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9965260624885559
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-04-23T15:08:26Z",
        "content": "$PLUG @sctppr @S2b  I do think it's maybe time to revisit the PLUG chart.  Price is in a bit of a downtrend and the sellers have control, but over the last couple weeks it appears to me that some buying is happening.  I've placed a bet with the bulls.  I think we're going to see a bounce higher.  However, if it does bounce, it could still just be a dead cat bounce.  I'm nowhere close to considering the recent price action as a trend reversal,  just yet.",
        "sentiment": {
            "TextBlob": 0.03,
            "NLTK": -0.7876,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9949470162391663
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-04-19T22:03:28Z",
        "content": "$SPY $ES_F $SPX  Here's an ES chart, and tonight, instead of breaking down the chart I'm going to share my equity curve from today.  I know there's a lot of people out there who aren't quite over the hump yet, so hopefully this helps.  Always, keep losses small.  A traders inability to keep losses small is many times the difference between being a winner and a loser.  This is probably the hardest thing any trader needs to overcome, because everyone wants to be right and nobody ever wants to be wrong.  Today I had 14 trades, 3 went for about break even to a tick or two loss.  Yeah, I started slow. 2 losers for about -2 pts each and 9 winners.  I'm not going to share the $$$ amounts because that isn't important.  Consistency is the name of the game.  I may take the rest of the week off from this Stocktwits thing, so I'll catch up with you guys either this weekend or next week.  It's time to go entertain the boss lady.  Have a good night!",
        "sentiment": {
            "TextBlob": 0.02893990929705215,
            "NLTK": 0.6021,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.8869100213050842
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-04-19T20:50:07Z",
        "content": "$ORGN If I've learned only one thing on Stocktwits over the years, it's that humans are emotional creatures.  I sure am glad to not be one of them.  lol  Here's the chart.",
        "sentiment": {
            "TextBlob": 0.36,
            "NLTK": 0.8271,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9750899076461792
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-04-18T23:14:21Z",
        "content": "$ORGN Us technical watchers have been keeping an eye on the month long consolidation that formed around the all time lows.  Today was a strong day and price touched a short-term trendline resistance.  If the momentum higher doesn't continue higher tomorrow the trendline resistance and the red line support area are the two things I'll be watching most closely until one or the other breaks.  As always, best of luck to all, bull or bear.  Here's the chart.",
        "sentiment": {
            "TextBlob": 0.25092592592592594,
            "NLTK": 0.9081,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.984742283821106
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-04-18T22:58:29Z",
        "content": "$PLUG Yesterday I was like, \"hey, a strong candle off the bottom of the wedge, this looks pretty good\".  Today, the market took it all back.  price is still holding the trendline.  Let's see what happens tomorrow.",
        "sentiment": {
            "TextBlob": 0.3458333333333333,
            "NLTK": 0.8402,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.8341858386993408
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-04-17T23:12:42Z",
        "content": "$PLUG I have a little skin in the game here, so here's what's currently got me going, hmmm.",
        "sentiment": {
            "TextBlob": -0.19583333333333333,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9838363528251648
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-04-17T22:54:40Z",
        "content": "$ORGN I see there was some news.  Here's how things sat at the close.",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9981822967529297
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-04-15T20:56:19Z",
        "content": "@HarryToe1 requested that $SOFI be put on a chart.  Daily candlesticks.",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9986159801483154
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-04-15T20:50:14Z",
        "content": "@WingChun3 requested a $SPY chart.  Currently, these are the 4 most relevant lines I see.",
        "sentiment": {
            "TextBlob": 0.3,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.7625662088394165
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-04-15T20:43:02Z",
        "content": "@lau_jj9 requested $BBBYQ to be put on a chart.  2 day candles.",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9961389899253845
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-04-15T20:39:23Z",
        "content": "@TradingTherapy requested $ASTS to be put on a chart.  Weekly candles",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9948272109031677
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-04-15T20:34:57Z",
        "content": "@Notcharleshuggins and a few other people requested $TGTX to be put on a chart.",
        "sentiment": {
            "TextBlob": -0.1625,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9981706142425537
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-04-15T20:31:09Z",
        "content": "@beadnix requested $ARDX to be put on a chart.",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9983957409858704
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-04-15T20:24:57Z",
        "content": "@TCF16 requested $VLD to be put on a chart.  Daily sticks.",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.988204836845398
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-04-15T20:19:48Z",
        "content": "@Tron75 requested $GLD to be put on a chart.  2 week candles to help filter out the noise.",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.4019,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9978394508361816
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-04-15T20:12:33Z",
        "content": "@Twinturbos requested $XBI to be put on a chart.  Weekly candlesticks",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9976041913032532
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-04-14T11:59:02Z",
        "content": "$SPX $SPY $ES_F  A quick peak at the 5 minute S&P 500 E-mini and then I'm outta here!  Have a good day folks.",
        "sentiment": {
            "TextBlob": 0.5583333333333333,
            "NLTK": 0.4926,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9993588328361511
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-04-14T00:26:32Z",
        "content": "$ORGN  and @Fuhk_it_Im_in  I'd hung it up for the day, but I got so excited to receive a chart request I waddled back down to the dungeon and into the cellophane trading hut.   That was the hard part.  Now onto the chart!  I find the current ORGN price action a bit interesting.  We're looking at a consolidation phase before the next more.  Maybe the next move will be higher or maybe it will be lower.  I pushed a few chips into the middle of the table at 3.92, so I currently must think the odds of price going a bit higher are decent.  However, I'm ok with folding the hand if I'm wrong.   It's still a bit of a coin flip.",
        "sentiment": {
            "TextBlob": 0.07897376543209877,
            "NLTK": 0.8209,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.8474011421203613
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-04-12T13:09:26Z",
        "content": "$PLUG Price has been in a bit of a down channel/ wedge for over two years now.  It appears to be a buy the bottom/sell the top situation (basic trading) to me.  Bottom of the wedge was about $9.00.  Top of the wedge is currently at about 22.50.",
        "sentiment": {
            "TextBlob": 0.1688888888888889,
            "NLTK": 0.3818,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9985910058021545
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-04-12T12:41:19Z",
        "content": "$SPX $SPY $ES_F Oh boy!  It looks like another up day.  However, If the bulls (yep, I'm a bull) have an argument for price going higher, then the bears also have an argument for why price should go lower.  Here's the technical argument for the bears.",
        "sentiment": {
            "TextBlob": 0.125,
            "NLTK": -0.7574,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9975582361221313
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-04-05T12:31:57Z",
        "content": "$SPX $SPY $ES_F Here's a super quick chart covering the last 12 months of price action.  Price is currently in an area where the bears have had success.",
        "sentiment": {
            "TextBlob": 0.17777777777777778,
            "NLTK": 0.8225,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.5128178596496582
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-04-02T12:56:05Z",
        "content": "$BOIL I've been on a mission to help save people from themselves for a while now.  A couple weeks ago someone said to me, \"Troutter, keep an eye on BOIL.  It will be up 300% in a month or two\".  I thought \"wow, that sounds amazing\".  However, when I hear people say things like \"this will happen\" or \"that won't happen\" it's as if sirens and alarms start going off in my head.  Nobody knows what will happen next, but most people do believe what they think. Price is truth and BOIL is a 2X leveraged ETF.  Which means if holding overnight is like trying to swim upstream.  Let's look at the chart.  1.  Long-term downtrend.  2  Reverse splits because of the daily rebalancing which leads to decay.  3.  Sure, maybe you'll guess right once in a while, but it's unlikely you can beat it long-term.  4. Gamblers love the thrill of trying to beat the odds.  Real traders play only when the odds of success are favorable.  You just have to decide what kind of person you want to be.  Best of luck to all",
        "sentiment": {
            "TextBlob": 0.29183673469387755,
            "NLTK": 0.992,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.7061671614646912
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-04-01T21:31:49Z",
        "content": "$BTC.X  I've been involved with the markets in one form or another for well over 20 years and I've even been on Stocktwits for over 9 years now.  Oh, how time flies.  One of my favorite memories here on Stocktwits happened 5 or 6 years ago when an emotionally charged trader who didn't like my analysis said, \"Troutter, why do you only draw Doritos on your charts when there are so many great indicators that tell you what's going to happen next?\"  The Doritos he was referring to were triangles.  My goal has always been to understand the buying and selling.  No indicator or overlay will do that for us, but a simple candlestick chart with lines can help point a trader in the right direction.  This game is all about the price action, which is the buying/selling, and it's all right in front of us on the charts.  It shows us who's (bulls or bears) currently in charge of the price action.   Here's a few of the things I watch and it's nothing more than TA 101.  Time for me to go relax. $STUDY",
        "sentiment": {
            "TextBlob": 0.16476190476190478,
            "NLTK": 0.8774,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9476045966148376
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-04-01T20:02:33Z",
        "content": "$SPX $SPY $ES_F  This chart of the SPX sometimes stirs negative emotions in a small number of viewers who happen to be on the wrong side of the trade.  Viewer discretion is advised.",
        "sentiment": {
            "TextBlob": -0.35000000000000003,
            "NLTK": -0.7579,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9947835803031921
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-04-01T19:36:28Z",
        "content": "$QQQ Those who are a student of price might enjoy this chart.",
        "sentiment": {
            "TextBlob": 0.4,
            "NLTK": 0.4939,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9725603461265564
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-04-01T16:37:15Z",
        "content": "$SQQQ I've been doing my best to reveal the kind of trading vehicle SQQQ is to those who don't fully understand it.  Rebalancing which leads to daily price decay means the longs are not just fighting the QQQ bulls, but also the daily decay.  I talk about 2022 being an anomaly and SQQQ is now back to it's normal scheduled programing.  Which is lower highs and lower lows.   Gamblers like to try beating the odds.  Real traders play when the odds are with them, because doing anything else will eventually lead them to the poorhouse.  Believe what you see, or believe what you think.  That's up to you. Best of luck.",
        "sentiment": {
            "TextBlob": 0.36875,
            "NLTK": 0.6255,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9274123311042786
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-04-01T15:55:30Z",
        "content": "$F  No real momentum either way in this one for now.  A short-term double top, a short-term double bottom.  Price will continue to fluctuate between these areas until it doesn't.  I have a long bet on Ford and I'll continue to sit back and collect dividends until price tells me more.",
        "sentiment": {
            "TextBlob": 0.12142857142857144,
            "NLTK": -0.1027,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9986529350280762
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-04-01T15:45:38Z",
        "content": "$ORGN I gave a midweek ORGN chart and price was in the short-term yellow range.  Since then, the bulls gained a little momentum.  I keep leaving the old notes (in white) on the chart because I think it's a good reminder of how us humans tend to think.  The new notes for this week are in yellow.  As always, best of luck to all, bull or bear.",
        "sentiment": {
            "TextBlob": 0.21860795454545454,
            "NLTK": 0.9136,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9810842871665955
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-04-01T15:06:29Z",
        "content": "$SPX $SPY $ES_F  Last night reminded me just how fun life really is.  The 30-6 Lady Hawkeyes vs the 36-0 Lady Gamecocks.  I'm an Iowa resident, so it's pretty easy to guess who I was cheering for.  Dawn Staley said somethings in the post game conference that stood out, touched me, and is a testament to her and her teams character.  As competitors, I think we sometimes forget that the other team is more than just an opponent, they're also people just like us.  I wish I had more than 1000 characters because I'd like to add some direct quotes, but I'll just say, she showed the grace that real winners show after defeat and she's moved on.  How often do we complain about the markets not going in our direction and instead of moving on, we let our ego get in the way of making the right decision.  My intent is not to lead anyone to a conclusion, so I've deleted the notes.  Best of luck to all, bull or bear.",
        "sentiment": {
            "TextBlob": 0.24954212454212454,
            "NLTK": 0.9679,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9827010035514832
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-03-29T20:26:03Z",
        "content": "$TLRY It's been a while since I've looked at or even for that matter smelled weed.  The $MJ ETF has been in a \"Red Channel Of Death\" for over 2 years now.  I currently see no reason to be bullish and \"cheap tends to get cheaper.",
        "sentiment": {
            "TextBlob": 0.13333333333333333,
            "NLTK": -0.7184,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9997738003730774
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-03-29T19:32:49Z",
        "content": "$SPY $SPX $ES_F  Believe what you think or believe what you see.  One is illusion, the other is truth.",
        "sentiment": {
            "TextBlob": -0.125,
            "NLTK": 0.3182,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9684213399887085
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-03-29T18:34:10Z",
        "content": "$SQQQ Well, If you like to fight both the bulls and decay, then you've come to the right place.  Just like frequenting your favorite casino on a Friday night, you'll likely come home with a lighter wallet.  Notes on chart.  Enjoy.",
        "sentiment": {
            "TextBlob": 0.29642857142857143,
            "NLTK": 0.7906,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9995381832122803
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-03-29T18:26:02Z",
        "content": "$ORGN Just for fun, let's do a midweek chart.  It's been pretty slow going for this ticker over the last couple weeks.  I thought my workstation had froze so I shook my monitor just to make sure it was updating, and it was.  Not a whole lot has changed, so I'm leaving everything pretty much as is, but I did highlight the last 10 days of price action and I added one new note in yellow.",
        "sentiment": {
            "TextBlob": 0.11136363636363637,
            "NLTK": 0.8256,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9987545013427734
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-03-29T13:28:48Z",
        "content": "$ES_F $SPY $SPX  A super quick 30m  ES chart before the open with current support and resistance as I see it.  Short-term uptrend for the bulls.",
        "sentiment": {
            "TextBlob": 0.16666666666666666,
            "NLTK": 0.765,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9498298764228821
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-03-29T13:28:38Z",
        "content": "$ES_F $SPY $SPX  A super quick 30m  ES chart before the open with current support and resistance as I see it.  Short-term uptrend for the bulls.",
        "sentiment": {
            "TextBlob": 0.16666666666666666,
            "NLTK": 0.765,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9498298764228821
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-03-25T13:48:00Z",
        "content": "$ORGN  Well, another week in the books.  Not a whole lot happened this week.  Price bounced around between the 3.80's and about 4.00.  I don't currently see anything new or earth shattering to add to the chart, so I'm just going to post last week's chart again.  Same notes, same lines, but 5 more candlesticks.  Have a good weekend guys.",
        "sentiment": {
            "TextBlob": 0.15454545454545454,
            "NLTK": 0.6999,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9986152648925781
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-03-24T21:56:24Z",
        "content": "$SQQQ Do you believe the guy who say's, \"this will rocket next week\"?  Sure, a handful of people got lucky and made some money swing trading SQQQ long in 2022, but 2022 was an anomaly. It was not the norm.  The wind is always in the face of the SQQQ long trader and in time the price will once again get so low there will be a reverse split.  If you're currently holding shares of SQQQ then this chart is for you!",
        "sentiment": {
            "TextBlob": 0.10476190476190474,
            "NLTK": 0.257,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9945440292358398
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-03-24T20:59:23Z",
        "content": "$ES_F $SPY $SPX A quick peak at futures before the close.  Price currently sits at 4010.  The 4000 - 4040 area.  There hasn't been a lot of resistance in this area for either the bulls or the bears in the recent past.  The bulls currently have the wind at their backs, so I'll be interested to see if they come out charging Sunday night into Monday.",
        "sentiment": {
            "TextBlob": 0.05555555555555555,
            "NLTK": 0.4144,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.7107124328613281
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-03-24T18:49:03Z",
        "content": "$SPY $SPX $ES_F The end of the week chart is coming a little early this week, but I think it's safe to say we can put another tally mark up for the bulls.  I've been talking about the 50% of the range line on the chart (0.5 line)  for a while now.  I think it's a pretty important area.  The red downtrend line is also currently in that area.  Today the bulls once again defended the middle of the range and pushed price higher.  Call me crazy, but I think the bulls are getting stronger.   Have a good weekend.",
        "sentiment": {
            "TextBlob": 0.12840909090909092,
            "NLTK": 0.9382,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9926865100860596
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-03-23T15:03:34Z",
        "content": "$SQQQ Maybe the best post you'll see on this stream today.  You guys see a lot of junk posts here every single day.  These posts come from both the bulls and the bears.  I don't care if you're a bull or a bear.  I'm just gonna give it to you str8.  1.  SQQQ has been in a long-term downtrend since it's inception back in 2010.  2.Those who hold long overnight are fighting both the market bulls and the daily rebalancing that causes decay in the share price.  It's like trying to swim upstream every single day for those who hold over night.  3.  2022 was the exception to the rule.  Some traders were able to successfully swing trade it, but that isn't the rule.  4.  If you're a gambler you don't care about odds, because it's the thrill of winning that drives you.  If you're a trader you only trade when the odds are on your side.  Those of you who are holding this trading vehicle over night have to ask yourselves if you want to be a gambler or a serious trader.  It's really that simple.",
        "sentiment": {
            "TextBlob": 0.18644688644688642,
            "NLTK": 0.7932,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9900192022323608
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-03-21T22:54:16Z",
        "content": "$ES_F $SPY I'm lazy tonight, but I still wanted to share a chart, so just for fun I'm sharing my $SPX chart from last Thursday.   Same notes and lines as before.  I haven't updated a thing, but it does have 3 more candles.  I think this is a @Doozio of a chart, but I'm probably a bit bias.",
        "sentiment": {
            "TextBlob": 0.11000000000000001,
            "NLTK": 0.8749,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9963086247444153
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-03-19T14:35:10Z",
        "content": "I first thought this was a joke, but I see it's real.  People either love Jim Cramer or they hate Cramer.  Well, now we have an easy way to pick sides.  $SJIM is the Inverse (short) ETF of Cramer's bullishness and $LJIM is the \"Hail Cramer\" long ETF.  I think I've now seen it all.",
        "sentiment": {
            "TextBlob": 0.07619047619047617,
            "NLTK": 0.8519,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9628269076347351
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-03-19T14:13:49Z",
        "content": "My $SQQQ charts have sparked conversation in the past, so I'm going to post another one.  This is a closeup daily chart of the 2022 price action.  I'm firm in my belief that NOBODY should buy and hold SQQQ overnight because of the rebalancing which produces daily decay.  However, a few of you did successfully swing trade SQQQ in 2022 from the long side. I won't argue with you guys, you beat the odds, but eventually gravity always win.  Just take a look at the small weekly chart in the upper left corner of this post.  Gravity always wins and I believe you guys are once again on the wrong side of history. Best of luck to all. Notes on chart",
        "sentiment": {
            "TextBlob": 0.1,
            "NLTK": 0.9621,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9604520201683044
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-03-19T13:13:55Z",
        "content": "$ORGN I have a quick chart and a couple thoughts today.  Notice, this is a very simple chart and price is in a down channel.  The long-term bias is down, we really can't argue with that.  However, notice how wide the swings can be.  Both the bulls and bears can make money here.  Either party can capture 30%-50% swings.  We just need to identify which part of the trading cycle price is currently in.  Price is currently bearish.  The bears are in charge and we can't deny that.  However, price is now down nearly 40% from it's most recent high and it's entered the bottom part of the channel.  This area has been a buy in the past.  Just remember, the bears are currently running the show.  Best of luck to all, bull or bear. $STUDY",
        "sentiment": {
            "TextBlob": 0.09229166666666666,
            "NLTK": 0.9161,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9963274598121643
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-03-19T12:09:56Z",
        "content": "$SPY $SPX $ES_F Today I'm going to post 11 charts of the S&P 500 Sectors.  Each chart has a box which marks the center point between a high and low and a trendline or two.  Here's chart 11 of 11 Energy",
        "sentiment": {
            "TextBlob": 0.02,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9297780394554138
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-03-19T12:08:58Z",
        "content": "$SPY $SPX $ES_F Today I'm going to post 11 charts of the S&P 500 Sectors.  Each chart has a box which marks the center point between a high and low and a trendline or two.  Here's chart 10 of 11 Financials",
        "sentiment": {
            "TextBlob": 0.02,
            "NLTK": -0.2732,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9837756752967834
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-03-19T12:07:50Z",
        "content": "$SPY $SPX $ES_F Today I'm going to post 11 charts of the S&P 500 Sectors.  Each chart has a box which marks the center point between a high and low and a trendline or two.  Here's chart 9 of 11 Utilities",
        "sentiment": {
            "TextBlob": 0.02,
            "NLTK": -0.2732,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.991087019443512
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-03-19T12:06:34Z",
        "content": "$SPY $SPX $ES_F Today I'm going to post 11 charts of the S&P 500 Sectors.  Each chart has a box which marks the center point between a high and low and a trendline or two.  Here's chart 8 of 11 Communication Services",
        "sentiment": {
            "TextBlob": 0.02,
            "NLTK": -0.2732,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9876655340194702
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-03-19T12:05:11Z",
        "content": "$SPY $SPX $ES_F Today I'm going to post 11 charts of the S&P 500 Sectors.  Each chart has a box which marks the center point between a high and low and a trendline or two.  Here's chart 7 of 11 Real Estate",
        "sentiment": {
            "TextBlob": 0.065,
            "NLTK": -0.2732,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9809573888778687
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-03-19T12:03:19Z",
        "content": "$SPY $SPX $ES_F Today I'm going to post 11 charts of the S&P 500 Sectors.  Each chart has a box which marks the center point between a high and low and a trendline or two.  Here's chart 6 of 11 Materials",
        "sentiment": {
            "TextBlob": 0.02,
            "NLTK": -0.2732,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9877826571464539
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-03-19T12:02:17Z",
        "content": "$SPY $SPX $ES_F Today I'm going to post 11 charts of the S&P 500 Sectors.  Each chart has a box which marks the center point between a high and low and a trendline or two.  Here's chart 5 of 11 Information Technology",
        "sentiment": {
            "TextBlob": 0.02,
            "NLTK": -0.2732,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9823222756385803
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-03-19T12:01:18Z",
        "content": "$SPY $SPX $ES_F Today I'm going to post 11 charts of the S&P 500 Sectors.  Each chart has a box which marks the center point between a high and low and a trendline or two.  Here's chart 4 of 11 Industrials",
        "sentiment": {
            "TextBlob": 0.02,
            "NLTK": -0.2732,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9868049621582031
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-03-19T12:00:23Z",
        "content": "$SPY $SPX $ES_F Today I'm going to post 11 charts of the S&P 500 Sectors.  Each chart has a box which marks the center point between a high and low and a trendline or two.  Here's chart 3 of 11 Health Care",
        "sentiment": {
            "TextBlob": 0.02,
            "NLTK": 0.2732,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9791496396064758
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-03-19T11:58:54Z",
        "content": "$SPY $SPX $ES_F Today I'm going to post 11 charts of the S&P 500 Sectors.  Each chart has a box which marks the center point between a high and low and a trendline or two.  Here's chart 2 of 11 Consumer Staples",
        "sentiment": {
            "TextBlob": 0.02,
            "NLTK": -0.2732,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9871376752853394
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-03-19T11:57:49Z",
        "content": "$SPY $SPX $ES_F Today I'm going to post 11 charts of the S&P 500 Sectors.  Each chart has a box which marks the center point between a high and low and a trendline or two.  Here's chart 1 of 11 Consumer Discretionary.",
        "sentiment": {
            "TextBlob": 0.02,
            "NLTK": -0.2732,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.993003785610199
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-03-16T23:14:47Z",
        "content": "$SPY $SPX $ES_F Just another SPX chart, but it's a @Doozio.  Yeah, I thought that was funny.  enjoy",
        "sentiment": {
            "TextBlob": 0.325,
            "NLTK": 0.899,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9959564805030823
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-03-15T21:05:52Z",
        "content": "$SQQQ Ok, one more chart today.  A while back I was asked what I think of SQQQ.  I said I wouldn't touch it for anything more than a day trade and this is why.   Gravity always wins.  It's that's simple.",
        "sentiment": {
            "TextBlob": 0.3,
            "NLTK": 0.7096,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.999240517616272
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-03-15T19:28:58Z",
        "content": "$MES_F This morning I mentioned today was going to be a \"chill day\".  I'd also planned to chat here a little, but I guess most everyone found other things to do today.   lol. For fun, I decided to trade 1 MES contract between my other duties, which amounts to $5 a point.  Yes, most of you are probably thinking, \"why bother\", right?  Well, I think if people are going to be traders it needs to be in their blood.  Kinda like a sport you might enjoy playing.  Most of us can't play basketball for a living, but that doesn't stop us from playing.  We play because we enjoy it, it's fun.  Which is why  I played today.  Stress free and fun.   I was planning to share my trades in detail with notes, but since I trade on a 1 minute chart things got it a little messy.  Today worked out to 8 trades for 19 points X $5 = $95.  I know, far from getting rich, but, and I'm not too proud to admit sometimes I play small and just for fun.   Sort through it if you want.  Have a good day.  I'm outta here!",
        "sentiment": {
            "TextBlob": 0.27548701298701295,
            "NLTK": 0.9947,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.6058216094970703
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-03-15T15:54:46Z",
        "content": "Today is Micro day for me and here's the most relevant lines as I see them right at this moment.  $MES_F",
        "sentiment": {
            "TextBlob": 0.3952380952380952,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9940648674964905
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-03-15T13:52:52Z",
        "content": "Today is gonna be a chill day for me.  Probably gonna chat a little here on ST, play the $MES_F if I see opportunity and clean the basement.  I won't be charting all day, but if anyone has a ticker or two they'd like to see on a chart send it my way.",
        "sentiment": {
            "TextBlob": 0.08958333333333335,
            "NLTK": 0.7717,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9505556225776672
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-03-15T12:30:18Z",
        "content": "@TheBlackWolf $SPX $ES_F $SPY Lot's of talk, more numbers shortly, but here's where the money sits.",
        "sentiment": {
            "TextBlob": 0.25,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.998172402381897
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-03-12T20:00:41Z",
        "content": "$SPY $SPX $ES_F Futures open in 2 hours!  Hold onto your hats!",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9027975797653198
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-03-11T15:21:13Z",
        "content": "$SPY $SPX $ES_F Are these just red lines or are they the red pill?",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9989657402038574
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-03-11T15:12:18Z",
        "content": "A slight update to the $ORGN chart I've posted here in the past.  This one has a couple more notes that I hope the viewer will find helpful.  What I'm going to say next will probably seem too simple and maybe too obvious, yet, it's also very difficult to get right.  \"Price goes up and down, not just up or down.\"  If you look at the chart you can clearly see many price peaks and many price troughs.   It's important to understand which part of the trading cycle price is currently in.  This is what helps us make more educated entries and exits.  Which hopefully results in more money in our pockets.  As always, I hope you find the chart informative and best of luck to all, bull or bear.",
        "sentiment": {
            "TextBlob": 0.16155202821869488,
            "NLTK": 0.9696,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.5142898559570312
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-03-10T00:58:28Z",
        "content": "$SPY $SPX $ES_F Things that make me go hmmm.",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9912101030349731
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-03-10T00:27:00Z",
        "content": "$SPY $SPX $ES_F Short-term price action is a little iffy.  Is it time we address the elephant in the room or should we just ignore it until it goes away?",
        "sentiment": {
            "TextBlob": -0.04375,
            "NLTK": -0.3612,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9965492486953735
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-03-10T00:06:08Z",
        "content": "$ORGN",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9818381071090698
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-03-07T22:10:57Z",
        "content": "$SPX $SPY $ES_F  Last post of the day for me.  If you have the attention span of a fruit fly then chances are the whole world came down around you today.   However, on the daily chart not much has changed.  Price is still holding above the downtrend line and it's still holding inside the top 50% of the range.  Yep, today was ugly  and this might be the start of something larger for the bears, but it hasn't happened yet.  Have a good night folks.",
        "sentiment": {
            "TextBlob": 0.11313131313131314,
            "NLTK": 0.6249,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9809503555297852
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-03-07T19:20:28Z",
        "content": "$ORGN I shared this chart about 2 weeks ago.  Before anyone decides they want to beat me up, remember, this is NOT a call.  It's just something to keep in your back pocket in case the selling continues.  It's rare everything lines up perfectly, but it can help us make better educated buys and sells.   As always, best of luck to all.  Bull or Bear.",
        "sentiment": {
            "TextBlob": 0.5599999999999999,
            "NLTK": 0.9707,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9759750366210938
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-03-07T18:55:19Z",
        "content": "$ES_F $SPX $SPY  Not what I was hoping to see today, but it wasn't unexpected either,  oh well.",
        "sentiment": {
            "TextBlob": 0.1,
            "NLTK": 0.2462,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9990676045417786
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-03-05T23:16:20Z",
        "content": "It's about time for me to call it a weekend, but let's end it with a $POWW.  The average trader is consumed by the price bar on the right.  It's all they can think about.  I'm up a penny, I'm down 10 pennies, this stock is the greatest thing ever, this is the worst trade I've ever made.  When it comes to emotions, these people are all over the place and it never ends!  I think there's a better way.  Let's for a moment track trader sentiment.  Red ovals represent bearish sentiment.  Green ovals represent bullish sentiment.  Yellow box represents nobody really cares.  I think I see a shift in sentiment happening.  What do you think?  Have a good night folks.",
        "sentiment": {
            "TextBlob": 0.10728715728715726,
            "NLTK": 0.9271,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9992745518684387
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-03-05T22:38:28Z",
        "content": "$BB Let's see.  Long-term trendline (white line) resistance still intact.  61.8% fib retracement of the past bull leg and then two strong days for the bulls.  Is this what is meant by \"between a rock and a hard place\"?",
        "sentiment": {
            "TextBlob": -0.027083333333333348,
            "NLTK": 0.5719,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.5576708316802979
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-03-05T22:27:40Z",
        "content": "$RAD has been a never ending disappointment for many years now, but what's that I see???  It is a wedge pattern with a short-term double bottom and the buyers defending the all time low on Friday?  I guess it doesn't cost anything to dream.",
        "sentiment": {
            "TextBlob": -0.024999999999999994,
            "NLTK": 0.3941,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9975206255912781
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-03-05T21:58:32Z",
        "content": "$BFLY This one is a bit interesting.  1.  From May through early August of 2022 price had an epic 275% run higher, so we know the bulls had some strength in the not so distant past.  2.  The bears then sold price off from the August high and never really stopped selling, until recently.  3.  Notice the green circles.  The past all time low was in May.  The bears have tried 4 times to gain traction below this 2.30 level, but they're failing.  If support suddenly gives way, look out below, but is it possible that the bulls are gaining some traction down here and the bears are soon to give up?   5.  If you like trying to buy the bottom with tight stops and high reward/risk ratios, then this might be something worth looking into.  Also, if you believe in the butterfly effect then just maybe the purple circle will be of interest to you.  Is it the first flap of a butterflies wings?   Let's see what happens with this one.",
        "sentiment": {
            "TextBlob": 0.030835421888053466,
            "NLTK": 0.9423,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.8171582221984863
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-03-05T20:59:13Z",
        "content": "$VLD Alright, I've got another chart for those who are interested.  Notice the annotations have disappeared, but the lines and a few strategically placed circles still remain.  A little earlier @TCF16 commented on a chart and at the end he said, \"I enjoy your TA, keep it coming!\"  I thanked him, but what he might not realize is that I thanked him because he's the only person who bothered to comment on either of the charts I posted today.  I thanked him for that, because it's awfully hard to have any kind of technical discussion without interaction.  I don't know about you guys, but a chart technician lives a boring life.  Charting on the weekend is how we unwind and get ready for the coming week.  Long story short, this is how we party.  Feel free to party with me.  VLD is a wild one.",
        "sentiment": {
            "TextBlob": 0.021388888888888888,
            "NLTK": 0.9796,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9944572448730469
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-03-05T17:56:33Z",
        "content": "$SOFI I see there's enough interest to do another chart.  However, suddenly I feel lazy, so I'm not gonna annotate it, but I did outline 2 things a bull trader might be looking at from a reward/risk standpoint before entry.  Plus, all the lines I'd typically put on a chart.  If you have  some technical thoughts you'd like to add, post them below.",
        "sentiment": {
            "TextBlob": -0.08333333333333333,
            "NLTK": 0.5423,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9940575361251831
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-03-05T16:35:22Z",
        "content": "$COMP I haven't done much scanning for swing trades over the past year because I don't short individual stocks.  So, when I don't feel the markets are suitable for holding long trades over night, I typically go into \"Futures Day Trade Mode\" until the conditions for stock long entries improve.  2023 has been good for many stocks, so this morning I did a little scanning for potential swing trades.  I have a whole list of stocks between $1-$10 that are showing patterns that I feel could turn into swing trades from the long side with a proper entry.  I've numbered how I follow price around the chart so you can better understand my thought process.  If you want to see more of my thoughts on a chart, either like or comment on this post and I'll annotate 1 or 2 more charts from my watch list later today.  If nobody cares, then I'll do something else this afternoon.  It is pretty nice outside.",
        "sentiment": {
            "TextBlob": 0.1702651515151515,
            "NLTK": 0.9626,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9101063013076782
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-03-04T18:09:58Z",
        "content": "$F last week I posted \"sideways she goes\"!   This week price began a bullish campaign toward the top of the range.",
        "sentiment": {
            "TextBlob": 0.25,
            "NLTK": 0.2714,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9957721829414368
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-03-04T02:51:45Z",
        "content": "$SPX $SPY $ES_F Yesterday I made an SPX post with a chart that read, \"Trendline resistance becomes support.  50% of the range retest successful.  Bullish engulfing candle.  Check, Check, Check.\"  Today we witnessed a nice continuation candle.",
        "sentiment": {
            "TextBlob": 0.675,
            "NLTK": 0.8519,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.8073211908340454
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-03-02T23:36:00Z",
        "content": "$SPX $SPY $ES_F Trendline resistance becomes support.  50% of the range retest successful.  Bullish engulfing candle.  Check, Check, Check.",
        "sentiment": {
            "TextBlob": 0.75,
            "NLTK": 0.7579,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9818920493125916
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-03-02T02:07:12Z",
        "content": "$SPY $SPX $ES_F Playing short-term price movement sure is fun, but now it's time for bed.  g'night",
        "sentiment": {
            "TextBlob": 0.4,
            "NLTK": 0.4939,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9744625091552734
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-03-02T01:45:04Z",
        "content": "$SPY $SPX $ES_F  A rather interesting evening and one of the quicker 2nd bear leg I've seen in a while.",
        "sentiment": {
            "TextBlob": 0.25,
            "NLTK": 0.4019,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9939782619476318
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-03-01T23:26:30Z",
        "content": "$ARKK Help me out with something.  I keep seeing bashing and bearish comments on nearly all tickers.  Isn't the point to buy low and sell high? I totally understand that I'm in the minority here and I just might be proven completely wrong.  However,  shouldn't people be bullish of all the fantastic deals, or does cheap tend to get cheaper?  lol  Anyway, I posted this ARKK chart over the weekend, same chart, same notes.  I saw what I think is buying around the aqua colored support line.  Will there be enough sustained buying to fight off the bears?  I don't know, I could be wrong, but the math is fine.  Bulls buying + Support =  me going a long for the ride also.  Upside potential (reward) high.  Stop below the recent low (risk), reasonable.",
        "sentiment": {
            "TextBlob": 0.08350877192982456,
            "NLTK": 0.2493,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.6834694147109985
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-03-01T21:53:18Z",
        "content": "$PLUG I see a range of emotions this evening.  Everyone wants price to either go up or down.  Yet, nobody watches price.  Where are the charts guys?  The past 10 years have been fantastic.  I see no reason not to think the next 10 will be just fine also.  Always remember, where you buy and where you sell is your decision.  If you buy high, well, that's not Andy's fault.  That's on you.  Weekly candles.",
        "sentiment": {
            "TextBlob": 0.11015873015873016,
            "NLTK": 0.762,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9980510473251343
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-03-01T17:52:20Z",
        "content": "$SPY $SPX $ES_F  The bulls might be down, but they aren't out.  Each push higher gets a little stronger than the one before it.  You let me know how the rest of the day goes.  I'm gonna go take a nap.",
        "sentiment": {
            "TextBlob": -0.03101851851851853,
            "NLTK": 0.4516,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.7267847657203674
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-02-28T00:50:44Z",
        "content": "$ARKK I was listening to CNBC this afternoon and something they said stuck in my head.  \"The only people who are bullish right now are the Technical Traders\".  There's a reason for that.  Technical Traders understand talk is cheap and price is king!  By the time \"everyone\" is bullish most of the time the big moves have already happened.  Which is why retail traders always tends to buy the top and sell the bottom.  It's the biggest joke on the Street!   So, just for fun, I decided to put a weekly ARK Innovation ETF chart together for you guys.  The annotations are numbered 1-7.  Let's see what happens.  $STUDY",
        "sentiment": {
            "TextBlob": 0.2456349206349206,
            "NLTK": 0.8293,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9985713958740234
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-02-27T00:29:56Z",
        "content": "@WingChun3 Maybe you can educate me a little.   Can  you trade the SPX dirctly?  I know there's SPY traders and there's an inverse ETF (SH) which is probably ok, so you can get exposer through ETF's or if you like to day trade futures you can use the $ES_F or the micro $MES_F to get exposed to the S&P 500.  I consider both of these as day trade vehicles, but of course some brave souls will try to swing them.  @tillage @Wigglyick @TradingTherapy",
        "sentiment": {
            "TextBlob": 0.37083333333333335,
            "NLTK": 0.7783,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9381607174873352
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-02-26T21:04:04Z",
        "content": "$SLDP This one crossed my radar today.  It's in a downtrend, but it's starting to show some signs of life.  The increased volume was the first thing that caught my eye.  It'll be an uphill slog, but anything can happen, so I watch, for now.",
        "sentiment": {
            "TextBlob": 0.125,
            "NLTK": 0.3919,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9530152678489685
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-02-26T18:22:48Z",
        "content": "$DNMR I see a bit of a head and shoulders pattern, but since I don't consider myself a head & shoulders pattern trading expert I'm going to ask @Pumpjack what his thoughts are on this chart.  I don't think a lot of people understand what a powerful tool stocktwits can be.  We have people at our fingertips who actually know what they're doing.  We just need to separate the wheat from the chaff.",
        "sentiment": {
            "TextBlob": 0.15,
            "NLTK": 0.5719,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9968461394309998
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-02-26T16:46:34Z",
        "content": "$F I've been holding Ford for a while now.  It isn't real exciting, but the divi is currently at about 5%, which isn't bad.  Sideways we go for now.",
        "sentiment": {
            "TextBlob": -0.0833333333333333,
            "NLTK": 0.4517,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9785918593406677
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-02-26T15:57:10Z",
        "content": "$STUDY $SPY $SPX $ES_F   I posted this chart about 40 minutes ago in response to a message to me.  However, I see it didn't reach any of the above tags so I'm going to try again.  Many people put a whole bunch of fib lines on their charts,  but the most significant pullback line I watch is not a fib level.  It's the 50% retracement line.  Some of you will say, \"but 50% is a fib retracement level.  It's even on the tradingview fib tool.\"  The reality is, many times 50% is used in fib tools, but it's not a true Fib ratio.  Lots off good price action stuff on this chart.  I hope you all enjoy it.",
        "sentiment": {
            "TextBlob": 0.31,
            "NLTK": 0.9119,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9915424585342407
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-02-26T15:15:30Z",
        "content": "@BobDole_Yahoo I see you have it all figured out and someday maybe your thoughts will play out in real life like they're currently playing out in your mind.  I hope so, because I too am long-term bullish.  As for my line being \"right or wrong\"?  It could be right today and wrong tomorrow.  Does that make it not just right or wrong, but maybe both?  lol  Anyway, we can argue about who's drawing the most relevant lines all day long, but in the end none it matters.  The situation is fluid, it's constantly changing.  The lines are just areas to keep an eye on to see if there's a bullish or bearish reaction when price approaches them.  I'll give you another view of the $SPX that you may find interesting.  These are weekly candles and they might be right today and wrong tomorrow.  That's the game.   $ES_F $SPY $STUDY",
        "sentiment": {
            "TextBlob": 0.06071428571428572,
            "NLTK": 0.238,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.5216014385223389
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-02-26T15:12:54Z",
        "content": "$SPX $ES_F $SPY Holy cows!  Well, I guess it is Sunday.  I really slept in, which doesn't happen all that often, but apparently I crashed last night!  What's a little interesting is that I woke up with a song in my head that instantly made me burst into laughter.  \n \n\"And we danced like a wave on the ocean, romanced \n(up and down bullish and bearish price movement) \n \nWe were liars in love  and we danced \n(seeing only what we want to see) \n \nSwept away for a moment by chance \n(oblivious to what is real) \n \nAnd we danced and danced danced\" \n(the game is never over, so we dance on) \n \nThe bears gained a little momentum last week.  My hope is that they don't \"shake the paint off the walls\"  lol \nyoutube.com/watch?v=zB1Q-Pf...",
        "sentiment": {
            "TextBlob": 0.09424603174603176,
            "NLTK": 0.9872,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9927567839622498
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-02-25T20:20:00Z",
        "content": "$ORGN I noticed I was tagged on a few ORGN posts this week, so I put a quick chart together.  However, this week's chart is a little different than many of the charts I've posted here in the past.  This isn't a call or some kind of predication, it's a \"what if\".  I have a question and it's a serious one!  Are you ready for the unexpected?",
        "sentiment": {
            "TextBlob": 0.06791666666666665,
            "NLTK": 0.3595,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.965989351272583
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-02-25T13:15:28Z",
        "content": "$SPX $SPY $ES_F This morning I spent an hour putting a chart together than combines technical analysis, Taoism, and even a question for @Pumpjack, who happens to be the resident Head & Shoulders chart pattern expert.  The annotations are numbered 1-9.  I hope this post starts a conversation that we all can enjoy and learn something from.  Here's a quick quote I've come to love.  \"If you are not confused, you don't know what's going on.\" ~ Jack Welch.    \n \nI will not be entertaining rude or snarky comments that lack substance from the ignorant today, so unless you want to be blocked hold onto those comments for another day ;)  If you have something constructive to add to the conversation, be it a though, comment, question, chart, etc.  You are invited to post below.",
        "sentiment": {
            "TextBlob": 0.19814814814814813,
            "NLTK": 0.8519,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9633073806762695
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-02-22T22:06:43Z",
        "content": "$ES_F $SPY $SPX  I've never been very good with big words, so this may take me a moment to work through.  Let's see, divergence is when things go off in different directions.  Convergence is when stuff comes together.  Now I hear there's \"confluence traders\" also.  Which really has my head spinning.  These are 3 day candles.   I'll just call it triple jockstrap support.  Let's see what happens tomorrow.",
        "sentiment": {
            "TextBlob": 0.27749999999999997,
            "NLTK": 0.0199,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9037513136863708
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-02-22T14:28:04Z",
        "content": "$ES_F $SPX $SPY  Some people don't like trading the futures electronic trading session, so they wait until 8:30 am to get their faces ripped off during the first 15 minutes of trading.  Hopefully, I'm not talking about you.  j/k  However, volume picks up around 2:00 am CST and unless there's a news event that throws the market into a hissy there can be many great trading opportunities after 2:00 am and without a lot of the wild rip your face off price action.  I'm just throwing this out there for you early risers.  At $50 a pt it adds up fast.  I got my 10 pts, so I'm done for the day, but here's a chart showing the volume increase at 2:00 am and what's currently (in my eyes) the most interesting line in the world.  Have a good day folks.   I'm out of here!",
        "sentiment": {
            "TextBlob": 0.35681818181818187,
            "NLTK": 0.9479,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9884896874427795
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-02-13T18:51:10Z",
        "content": "$SPX $SPY $ES_F  Well, I've been feeling like shit a lot lately and today is one of those days, so I'm going to go take a nap, but first I'll share a chart, a quote, and some thoughts. \"The journey of a thousand miles begins with a single step\" ~ Lao Tzu.   I think that step happened back in October of 2022.  I'll let Huang Po take it from here. Have a good day.",
        "sentiment": {
            "TextBlob": 0.0630952380952381,
            "NLTK": 0.25,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9929088354110718
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-02-13T16:48:28Z",
        "content": "$ES_F It appears I was wrong on that \"be careful\" stuff a little while back.  lol",
        "sentiment": {
            "TextBlob": 0.0025000000000000135,
            "NLTK": 0.0094,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9995772242546082
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-02-13T16:07:44Z",
        "content": "$ES_F  Maybe time to be a little careful.",
        "sentiment": {
            "TextBlob": -0.14375,
            "NLTK": 0.079,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9985018968582153
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-02-13T15:51:28Z",
        "content": "$ES_F  Surpassing my expectations.  1,2,3, Fabulous.",
        "sentiment": {
            "TextBlob": 0.4,
            "NLTK": 0.5267,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9991924166679382
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-02-13T13:03:58Z",
        "content": "$SPY $SPX a quick peak at the $ES_F 5m.  So far, so good",
        "sentiment": {
            "TextBlob": 0.37777777777777777,
            "NLTK": 0.6213,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9996662139892578
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-02-12T13:07:05Z",
        "content": "I received a chart request for $ENPH about 2 months ago.  Then maybe 3 weeks ago we revisited the chart and I'm not exactly sure why, but I started talking about the cost of eggs.  Anyway, there's lots of good stuff on this chart that a technical trader might find interesting.  These are weekly candles.",
        "sentiment": {
            "TextBlob": 0.2375,
            "NLTK": 0.7857,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.7710455656051636
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-02-11T10:19:31Z",
        "content": "$SPX $SPY $ES_F  If all we did was listened to the chatter on Stocktwits it would be easy to lose track of what's really going on.  Thank goodness we have charts available to us.",
        "sentiment": {
            "TextBlob": 0.3444444444444444,
            "NLTK": 0.7152,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9713780283927917
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-02-11T09:56:21Z",
        "content": "@jufl621 $QQQ Here's some past thoughts, but words will never fully explain it, so I'll use boxes.",
        "sentiment": {
            "TextBlob": -0.25,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9993583559989929
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-02-09T00:06:19Z",
        "content": "A quick $ORGN chart for those who like this kind of stuff.  The bulls gave it a hard push, but the bears expect to win this downtrend line.  It will be interesting to see if the bulls can hold this little breakout and keep price above the yellow area.  I'm calling it a day.  Have a good night.",
        "sentiment": {
            "TextBlob": 0.2726851851851852,
            "NLTK": 0.9343,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9408453106880188
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-02-08T23:08:35Z",
        "content": "$TLRY  Let's for fun take a look at Tilray tonight.  If you're one of those people who gets excited to buy \nwhen price is \"too cheap\", but then later you get your face ripped off, because \"cheap tends to get cheaper\".  Well, this chart just might be your ticket to figuring out how to play this game.  Best of luck to everyone, long or short.",
        "sentiment": {
            "TextBlob": 0.22500000000000003,
            "NLTK": 0.9607,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9965781569480896
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-02-08T00:31:24Z",
        "content": "$SPY $SPX $ES_F  Like most days, today I listened to the talking heads on CNBC for a little comedy while I went about my business.  A quote by Jack Welch came up in conversation and everyone laughed. \"If you're not confused, you don't know what's going on.\" ~Jack Welch  I like that, because I've been confused as to why stocks are going up for months, but my confusion has not stopped me from buying.  If price wants to go up, I want to go up with it, period, no questions asked.  Too often people watch opportunity pass them by because they don't believe what they see.  Which reminds me of another quote I'd like to share.  \"The foolish reject what they see and not what they think.  The wise reject what they think and not what they see\" ~ Huang Po.  I first published this chart on Feb 3.  A goofball from JPMorgan I think stole my chart (you can decide that one) and said \"the latest rally is a bear-market trap\". finance.yahoo.com/news/jpmo... 1. Are we even still in a bear market?  Notes on chart",
        "sentiment": {
            "TextBlob": 0.2736111111111111,
            "NLTK": 0.2879,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9975100755691528
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-02-05T22:56:20Z",
        "content": "$SPX $SPY $ES_F Since the Futures open in about 5 minutes I'll be going silent soon, but I wanted to share one more chart.  This time it's the $IWM  The Algo Overlord who runs our lives is a mathematician.  To understand him, we must think like him.  Best of luck this week.  I'm cheering for you!",
        "sentiment": {
            "TextBlob": 0.375,
            "NLTK": 0.9705,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9981327652931213
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-02-05T20:04:25Z",
        "content": "@KeepOnJeepinOn $XLF I wasn't planning on doing chart requests today, but since you're wearing a picture of me on the front of your shirt, I'm going to make an exception, this once.  lol  Very similar to the industrials chart.",
        "sentiment": {
            "TextBlob": 0.4,
            "NLTK": 0.5719,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9535306692123413
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-02-05T18:37:47Z",
        "content": "$SPX $SPY $ES_F Here we have a chart of the S&P 500 Industrials.  Some might think this move is getting \"long in the tooth\"  other's may think it's just beginning.  Are the bulls running straight into the fire or are the bears losing traction and they're about ready to give up?  What do you think?",
        "sentiment": {
            "TextBlob": 0.05625000000000001,
            "NLTK": -0.2406,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9992074370384216
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-02-05T14:00:55Z",
        "content": "$ORGN  Update on \"The Legs\".",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9932454228401184
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-02-05T12:32:50Z",
        "content": "$SPX $SPY $ES_F Yesterday, my buddy @Pumpjack called me \"a great interpreter for the masses\"  I think that was a complement.  Because of my limited vocabulary, sorry I mean because of my ability to use small words.  I'm able to get my point across on a chart.  Ya know, make it so people can understand it. lol I think that's what he meant, right pumpjack?  lol (j/k).  Anyway, today we're going to take a quick peak at the $QQQ.  Instead of drawing in patterns and making the chart look pretty, we're going to keep it real simple and just follow price around the chart.  We're going to focus on bottoms, trend, and why being a lone bull (or bear) is not typically a good idea.  Enjoy  $STUDY",
        "sentiment": {
            "TextBlob": 0.19179421768707486,
            "NLTK": 0.9135,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9466028809547424
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-02-04T00:33:15Z",
        "content": "$SPX $ES_F $SPY  I've heard a lot of people say, \"they've missed this market move\".  I can only assume they missed it because they were busy listening to what other people think.  At the end of the day only one thing matters and that's \"price\".  Think about it.  If you attend an auction and there's excited/aggressive buyers then items get bid up and sold for high prices, sometimes way above what they should go for.  The next week you attend another auction, but the buyers are more hesitant and items sell for far less than they would have the week before at the earlier auction.  The stock market is no different.  When there's excitement and price is rising we want to be buying and that's the story of 2023, thus far.  Here's some simple thoughts on a simple chart.  Let's see what happens next week.",
        "sentiment": {
            "TextBlob": 0.04177083333333333,
            "NLTK": -0.2823,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9995113611221313
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-01-30T19:30:17Z",
        "content": "$ORGN I have a thing for beautiful long legs!  Do you?",
        "sentiment": {
            "TextBlob": 0.39375,
            "NLTK": 0.636,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.98639315366745
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-01-30T17:35:33Z",
        "content": "@FarmerLundie 10 days you waited patiently for you're chart request to be filled.  $BA is touch call right now.  I'd be cautious if I was thinking about putting new money to work.  Sorry I overlooked your request.",
        "sentiment": {
            "TextBlob": 0.08051948051948052,
            "NLTK": -0.2023,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9983626008033752
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-01-30T16:55:02Z",
        "content": "@Bdevil4life I'm such a sucker for taking chart requests.  Tomorrow, I'm not even gonna open stocktwits, not even once.  lol  Ok, well, the bulls look strong and/or/but price is currently at a past resistance area.  We'll just have to see if there's enough gas left in the tank to push price through.  Have a good day $ORGN",
        "sentiment": {
            "TextBlob": 0.18833333333333332,
            "NLTK": 0.5815,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9936255216598511
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-01-29T23:44:12Z",
        "content": "$SPY $SPX $ES_F This chart is actually some past price movement on the $ETSY chart, but you guys consider yourself traders, right?  Earlier this weekend I asked what \"the people\" want from my charting.  I was told \"the notes\" are the best part.  So, my last chart for the weekend, and maybe the last chart until next weekend is an example of how I follow price around the chart.  If you're an inexperienced trader, or the guy who thinks he can \"pick bottoms\"  (these are the same people).  Then this chart just might save you a lot of $$$.  The annotations are numbered 1-12.  enjoy.  $STUDY",
        "sentiment": {
            "TextBlob": 0.12142857142857143,
            "NLTK": 0.9505,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.6957802176475525
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-01-28T13:30:21Z",
        "content": "$SPX $SPY $ES_F  I'm probably not gonna be doing very much charting this weekend, so I won't be taking chart requests, but I wanted to share an updated SPX chart.  First off, my comment's are numbered 1-8.  I did this to help better tell the price story.  Second, lately, I've noticed my charts have gotten cluttered.  I try to explain the price movement in a manner that every trader (beginner to experienced) can understand and possibly benefit from.  Is it too much, too little, or just right?  This is where you come in.  Do you like or dislike the charts I share?  Do you like the explanations I give, or should I just draw lines?  My goal is to constantly improve my charting I share with the ST community, so let me know what you think.  I won't even bite the heads off of the critics, this week.  Let me have it.  lol",
        "sentiment": {
            "TextBlob": 0.21735119047619045,
            "NLTK": 0.9821,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9981039762496948
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-01-26T17:12:23Z",
        "content": "$SPX $SPY $ES_F If you've been watching CNBC this week you've likely heard the talking heads say things like, \"depending on who you talk to (technically speaking) the market is either breakout, or very close to breaking out.\"  If you don't know what they're talking about, to put simply, they're watching this top red line.  See, technical analysis isn't all that complicated.   Enjoy your day.",
        "sentiment": {
            "TextBlob": 0.06666666666666667,
            "NLTK": 0.7717,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9070913791656494
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-01-22T20:43:15Z",
        "content": "$BWEN @Hammerandnail I hadn't planned to chart anymore today, but since I'm sitting here, I figure why not.  When you said, \"is this just a pump and dump\", it made me think about retail traders in general.  We're called \"retail\" because generally speaking we don't get the discount price.  The smart money is buying low and selling shares to retail players at high prices.  Retail buys high usually because they get excited about some news event and pay retail price.  Then price once again retreats trapping the retail players and when the pain gets too great retail once again sells their shares back to the smart money.  Usually near the bottom.  Fascinated isn't it?  I don't think this is a \"pump and dump\" because price has been going pretty much sideways in a range for 10 years.  However, there's a time to plant crops and there's a time to harvest crops.  I'll let you figure it out what time of year it is.  Notes on chart.",
        "sentiment": {
            "TextBlob": 0.16596938775510206,
            "NLTK": 0.9628,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9955055713653564
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-01-22T14:19:51Z",
        "content": "$SPY $SPX $ES_F This will be my one and only chart for the day.  It's the SPX with all fresh annotations.  I hope you find it helpful.",
        "sentiment": {
            "TextBlob": 0.15,
            "NLTK": 0.7906,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9981718063354492
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-01-21T23:42:34Z",
        "content": "My main man @Bettinardi has been picking my brain a little tonight, which made me think.  Just how much information do we really need?  We can look back a 100 years on the $SPX, but do we really need that much information?  Could too much information cloud our judgement and lead to information overload, leaving us paralyzed in the moment?  Do we even need indicators and overlays?  Do we need volume sticks?  How much is too much?  How little is too little?  What's just right?",
        "sentiment": {
            "TextBlob": 0.09922161172161169,
            "NLTK": -0.6381,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9981461763381958
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-01-21T21:42:43Z",
        "content": "Well, after tossing out the \"fly by chart requestor's requests\" I was left with 32 tickers.  I narrowed it down to 10. The 10 tickers I charted are the ones that caught my eye.  Nothing more, nothing less.  Alright #10.  The final chart of the weekend.  It's another one that's currently up around resistance, but the bulls are trying to push it higher and I tend to think eventually they'll get it higher. However, let's think about something for a moment.  How many times have the bears won this battle up around 150?  Maybe 6 or 7 times before.  I like the current chart setup, but a trader also should be considering the odds.  Most of the time breakouts don't happen when we think they will and many times after they do breakout the breakout fizzles quickly.   In a nut shell, we're betting against the odds.  Just something to think about.  Ok folks.  Thanks for the chart requests, sorry to everyone who's ticker I didn't get to this week.  Unfortunately, I just can't do it all.  Here's $WIRE",
        "sentiment": {
            "TextBlob": 0.16728395061728396,
            "NLTK": 0.8204,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9945900440216064
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-01-21T21:34:48Z",
        "content": "Well, after tossing out the \"fly by chart requestor's requests\" I was left with 32 tickers.  I narrowed it down to 10.  The 10 tickers I charted are the ones that caught my eye.  Nothing more, nothing less.  Holy cow, we're all ready to #9.  Chart #9 is $SAIA  Long-term uptrend, I like that.  A pullback, now some sideways, and it looks to me like the bulls are taking a shot at pushing this one through resistance.  We'll just have to see how much gas they have left in the tank.",
        "sentiment": {
            "TextBlob": 0.13827160493827162,
            "NLTK": 0.8225,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9891641736030579
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-01-21T21:32:39Z",
        "content": "Well, after tossing out the \"fly by chart requestor's requests\" I was left with 32 tickers.  I narrowed it down to 10.  The 10 tickers I charted are the ones that caught my eye.  Nothing more, nothing less.  Chart #8 is $SOFI  Maybe I'm seeing something that isn't there.  The downtrend is strong, but I think 6.40 could happen.",
        "sentiment": {
            "TextBlob": 0.23518518518518516,
            "NLTK": 0.4019,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.7291925549507141
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-01-21T21:31:01Z",
        "content": "Well, after tossing out the \"fly by chart requestor's requests\" I was left with 32 tickers.  I narrowed it down to 10.  The 10 tickers I charted are the ones that caught my eye.  Nothing more, nothing less. Chart #7 is $PDFS  Another great bull vs bear war.  Does it look like the bulls are gonna win this?  Usually when I'm real confident I'm wrong.  lol  Let's see what happens.",
        "sentiment": {
            "TextBlob": 0.30707070707070705,
            "NLTK": 0.8885,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.878050684928894
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-01-21T21:27:22Z",
        "content": "Well, after tossing out the \"fly by chart requestor's requests\" I was left with 32 tickers.  I narrowed it down to 10.  The 10 tickers I charted are the ones that caught my eye.  Nothing more, nothing less.  Chart #6 is $AKBA  I don't typically play stocks that are under $1 and this one probably won't make me start either.  lol  However, it's a good example of a bull leg, a pull back (bull flag) and into another measured move bull leg.  I'd be thinking about taking some profits right about now, but I'm not a penny pusher either.  These guys usually want, \"moon or bust\".  I wish all of luck, because sooner or later, it will likely run out.",
        "sentiment": {
            "TextBlob": 0.1805250305250305,
            "NLTK": 0.9158,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9977467656135559
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-01-21T21:23:42Z",
        "content": "Well, after tossing out the \"fly by chart requestor's requests\" I was left with 32 tickers.  I narrowed it down to 10.  The 10 tickers I charted are the ones that caught my eye.  Nothing more, nothing less.  Chart #5, is $DTC.  When I first saw, \"solo Brands\" I instantly thought solo cup.  Well, to my surprise these are the guys who make the solo stove.  I personally own one and they're pretty cool.  I see they also now have kayaks, swim wear, and paddle boards.  The chart may never reflect just how fun all these items are, but I tend to think this ticker might have a little bit left to the upside.",
        "sentiment": {
            "TextBlob": 0.1954059829059829,
            "NLTK": 0.7615,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9846408367156982
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-01-21T21:16:42Z",
        "content": "Well, after tossing out the \"fly by chart requestor's requests\" I was left with 32 tickers.  I narrowed it down to 10.  The 10 tickers I charted are the ones that caught my eye.  Nothing more, nothing less.  Chart #4 is $XBI  What we have here is a lot of sideways.  Most of the notes on this chart are from a few weeks ago, but I think they're worth looking over so I left them.  The yellow note is the new one.",
        "sentiment": {
            "TextBlob": 0.15583103764921946,
            "NLTK": 0.4404,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9969797730445862
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-01-21T21:14:33Z",
        "content": "Well, after tossing out the \"fly by chart requestor's requests\" I was left with 32 tickers.  I narrowed it down to 10.  The 10 tickers I charted are the ones that caught my eye.  Nothing more, nothing less.  Chart #3 is $TSLA  I tend to look at a chart and try to figure out \"who's in charge\".  That's what many people call momentum.  Momentum can and will change between the bulls and bears often, but understanding who's really in charge is the key.  I tend to think the bears are gonna take another shot at selling this one off again sometime in the no too distant future.  I've been wrong before.  Let's see what happens.",
        "sentiment": {
            "TextBlob": 0.09797979797979797,
            "NLTK": -0.7506,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9918606877326965
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-01-21T21:10:54Z",
        "content": "Well, after tossing out the \"fly by chart requestor's requests\" I was left with 32 tickers.  I narrowed it down to 10.  The 10 tickers I charted are the ones that caught my eye.  Nothing more, nothing less.  Chart #2 is $AXP  Long-term uptrend, but it does dip big from time to time.  I'll be interested to see if this last dip holds.",
        "sentiment": {
            "TextBlob": 0.15347222222222223,
            "NLTK": 0.6249,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9623046517372131
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-01-21T21:09:07Z",
        "content": "Well, after tossing out the \"fly by chart requestor's requests\" I was left with 32 tickers.  I narrowed it down to 10.  The 10 tickers I charted are the ones that caught my eye.  Nothing more, nothing less.  Chart #1 is $COIN  I'll be interested to see if the bulls can push this ticker out of it's long-term down channel.  It appears they're gonna give it a try.",
        "sentiment": {
            "TextBlob": 0.15317460317460316,
            "NLTK": 0.5859,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9758806824684143
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-01-18T17:22:17Z",
        "content": "$SNOW Some patterns have emerged and I think it's worth keeping an eye on.  Notes on chart.",
        "sentiment": {
            "TextBlob": 0.3,
            "NLTK": 0.2263,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9990198612213135
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-01-18T15:59:51Z",
        "content": "$ES_F 5 minute sticks.  Did you see the selloff coming???",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.997212827205658
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-01-18T15:26:21Z",
        "content": "$SPX $SPY $ES_F Apparently I just threw out my New Years Resolution and I allowed myself to be sucked back into  the Stocktwitsverse during market hours.  Oh well, I'll try to get back out later today.  Until then, here's an SPX chart that I think is important to understand.",
        "sentiment": {
            "TextBlob": 0.09772727272727273,
            "NLTK": -0.0258,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9994608759880066
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-01-18T14:31:42Z",
        "content": "$AFCG I survived and made money 2022 and I never shorted a single stock.  Here's one of the things I did in 2022.  Around June of 2022 I started accumulating a bunch of REITs because I've played this game long enough to know that in times of crisis people move their money into dividend payers.  I saw many dividends reach up around 20% yearly returns and this was an opportunity.   AFCG has not been one of the best performers I purchased, but it hasn't been bad either.  Add in a couple quarterly dividends and I'm up 7% on this ticker in about 6 months.   Understanding opportunity when it presents itself is important.",
        "sentiment": {
            "TextBlob": 0.08482142857142859,
            "NLTK": 0.9263,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9977415800094604
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-01-18T13:34:24Z",
        "content": "$AAPL  interesting enough to keep an eye on.",
        "sentiment": {
            "TextBlob": 0.25,
            "NLTK": 0.4019,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9988403916358948
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-01-17T23:01:02Z",
        "content": "$CAT @SirSloth it looks like @Pumpjack is taking care of you.  Great chart.",
        "sentiment": {
            "TextBlob": 0.8,
            "NLTK": 0.8689,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9987315535545349
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-01-17T23:00:02Z",
        "content": "$CAT",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.7939890027046204
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-01-15T11:13:12Z",
        "content": "@tillage Breaking out doesn't necessarily mean up.  It could just be sideways.  I know I've said what I'm going to say next on stocktwits before, but I don't think I say it real often.  I look for price to \"do something different\"  For example a stock that's in a downtrend keeps putting in lower lowers.  Then suddenly the last all time low holds and instead of price going down another 10% from the prior all time low, this time it goes up 10% and the bulls suddenly look strong.  This would be a double bottom and it's something different.  A breakout over 6.30 would be something different, but it would also be breaking into that green range area on the chart  which is not different.  Currently the bulls look pretty strong, but I don't see anything that would lead me to believe this is the beginning of a new uptrend just yet.  Price just put in another new all time low, which isn't different.  Let's see if the bulls buy up the next pullback.  $ORGN",
        "sentiment": {
            "TextBlob": 0.03685353535353535,
            "NLTK": 0.5719,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.7596727609634399
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-01-13T00:10:59Z",
        "content": "$ORGN Joe Friday was always about the \"facts\" and so am I.  Have a good night.",
        "sentiment": {
            "TextBlob": 0.7,
            "NLTK": 0.4404,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9987279772758484
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-01-12T00:27:49Z",
        "content": "@lechleidner I hadn't planned to chart tonight, but I guess one won't hurt.  $FOXF   Price is currently in a range and it will be in this range until it isn't.   Hopefully the chart makes sense.  I'm calling it a night.  Take care buddy.",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.725,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9944995641708374
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-01-11T23:47:51Z",
        "content": "@Wigglyick I've been watching you and $BEN this week.   It was a great chart for a pop.  Unfortunately, things didn't go so $GOOD for me, divi cut.  I'm still up, but I may need to reevaluate that position in the coming weeks.  Anyway, just wanted to pop in quick and congratulate you and BEN!  Have a good night buddy!",
        "sentiment": {
            "TextBlob": 0.4583333333333333,
            "NLTK": 0.876,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.997305154800415
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-01-09T19:50:38Z",
        "content": "$COIN Today's little bounce seems to be getting some media coverage.  I'm not sure what all the hubbub is about.  It still looks like it's going the wrong way to me.",
        "sentiment": {
            "TextBlob": -0.3125,
            "NLTK": -0.374,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9981755018234253
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-01-08T22:22:02Z",
        "content": "$SPY $ES_F Well, I'm calling it a weekend, and I can't think of a better way to end the weekend than with a $SPX chart.  I posted this chart with notes about a week or two ago.  These are 3 day candles, so not a whole lot has changed, but it's still probably worth taking a peak at.  New notes in yellow.  I hope everyone has a great week of trading.  I'm outta here!",
        "sentiment": {
            "TextBlob": 0.3060606060606061,
            "NLTK": 0.9184,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9856430888175964
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-01-08T15:04:37Z",
        "content": "@greasegun Alright, this is number 15 of 15 chart requests for the week.  Those who's chart requests came a little late, I'm sorry, but you'll have to be quicker next time.  That's all I've got on that.   lol  Next, I won't be taking chart requests for next weekend because my schedule is chalked full of family stuff, but maybe we can get back to it the week after.  As always, I enjoyed charting for you guys and I hope in some small way it has benefiting all who viewed the charts.   The last chart is $ETSY and it's a pretty interesting chart.  However, I don't have any real conviction as to which way it might go next and I'm not sure either the bulls or bears who are currently playing do either.  Best of luck guys.  Here's the chart.",
        "sentiment": {
            "TextBlob": 0.11118421052631577,
            "NLTK": 0.9862,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9874243140220642
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-01-08T14:40:13Z",
        "content": "@jhpop918 The bulls are strong.  A few weeks back @SirSloth was contemplating the idea of getting short $CAT  I said, \"I wouldn't get short just yet\".  The maybe another week or so past and I saw something on the daily chart that made me believe just maybe it was time to get short.  Well, it appears I was wrong and I hope Sloth didn't get hurt in the trade either.  Cat is very strong and breaking out to new highs.  The question now is how high can it go before the bulls start to take profits and the bears maybe begin to see opportunity.  Great chart.  It's a winner, at least so far.  lol  Cat is number 14 of 15.",
        "sentiment": {
            "TextBlob": 0.10893939393939395,
            "NLTK": 0.9804,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9982390403747559
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-01-08T14:24:41Z",
        "content": "@BhumtheGoddess This is an interesting chart and certainly worth keeping an eye on.  $TTD had a great bull run until it's recent top in 2021.  Then price started to selloff and trade more or less sideways within a range and in my eyes with a slight downward bias.  We'll just have to see what happens.  TTD is chart number 13 of 15.",
        "sentiment": {
            "TextBlob": 0.2833333333333334,
            "NLTK": 0.8957,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9484848976135254
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-01-08T14:01:08Z",
        "content": "@S2b $AMZN is an awesome chart request with a classic breakdown setup.  It's playing out just as the textbooks say it should.  Let's keep an eye on this one.  Drumroll please...  \"Here's chart number 12 of 15.\"  Ok, maybe that didn't deserve a drumroll.  lol",
        "sentiment": {
            "TextBlob": 0.6166666666666667,
            "NLTK": 0.7243,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9968287348747253
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-01-08T13:18:32Z",
        "content": "@Havoc66 Finally someone with an eye for stocks that like to go up.  Coca-Cola even has a small dividend.   A classic buy the dip stock.  $KO is chart #11 of 15.   These are 3week candlesticks that date back to 2003.",
        "sentiment": {
            "TextBlob": -0.020833333333333336,
            "NLTK": 0.3612,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.974511981010437
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-01-08T13:01:39Z",
        "content": "@Fashtrades I yearn for the day when you give up on trying to hit miracles because you bought into some story.  But, until then, I guess I'll continue to chart the shit stocks that you request.  At least this one is in a range and currently doesn't appear to be in the express lane to $0.00.  lol  Here's $NB and it's chart request #10",
        "sentiment": {
            "TextBlob": 0.07500000000000001,
            "NLTK": 0.8807,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9784731864929199
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-01-08T03:54:26Z",
        "content": "Well, @Wigglyick requested $BEN and it's chart request #8 of 15.  I've said this before but if you aren't following Wiggly you're missing out.  This guy adds value (money) to my life so I follow him!  I sometimes talk about \"who's in charge\" and \"bull strength\" and \"bear strength\"  If the bears are in charge, but you go long thinking \"price is too cheap\" you will likely get your ass kicked.  Cheap tends to get cheaper.  It would be a bit like going up to the warden at the prison and saying, \"I'm in charge, what are you going to do about it\"?  Everyone knows you aren't in charge and the warden doesn't care what you think, neither does the market.  So, you'll likely get your ass kicked.  Anyway, it looks to me like the bulls have the wind at their back on this one and I wouldn't be betting against them at least getting a little bit more.  Notes on chart.",
        "sentiment": {
            "TextBlob": 0.046590909090909086,
            "NLTK": -0.4086,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9993452429771423
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-01-08T03:02:59Z",
        "content": "@RonIsWrong  lol,  I appreciate the kind words, but you're likely exaggerating about the good teacher part.  The fact that @Wigglyick is interested in this ticker means there's likely something here worth examining. $TGLS is nearing the top of a range that began in 2021.  If we're buying the dip and selling the rip, which is Wiggly's MO (Modus Operandi)  He's likely trying to off load some shares on you.  lol  j/k.  Here's the chart, interesting stuff.",
        "sentiment": {
            "TextBlob": 0.4045454545454545,
            "NLTK": 0.9747,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.8369168043136597
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-01-08T02:37:32Z",
        "content": "@Twinturbos was quick enough to get a chart request in this week and it comes in at #6.  Here we have a 2 day chart of $SLV  The bulls have taken back short-term control of the price action, but they've now pushed price into an area where the bears have ruled the roost in the not so distant past.  Can bears or bulls rule the roost or does this saying just pertain to birds?  Any help to answer this question would be appreciated.  As always, notes on chart.",
        "sentiment": {
            "TextBlob": 0.040476190476190485,
            "NLTK": 0.8402,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9882296323776245
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-01-08T02:11:51Z",
        "content": "Hey @HOSTILE and as requested @SirSloth is included in this post.  lol  This chart ( $MHD )  certainly is in a long-term uptrend and I do like a good dividend.  Nothing like getting paid while we wait.  Anyway, long-term line chart, yep a line chart.  I guess it's true that there's a first time for everything.  lol  Then below that there's a daily candle stick chart.  I see a bull case on the daily chart and I see somethings on the long-term line chart that I find concerning.  Great chart request.  I like this one.  Happy New Year to you guys also!",
        "sentiment": {
            "TextBlob": 0.44406729634002357,
            "NLTK": 0.9826,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.8908276557922363
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-01-08T01:44:37Z",
        "content": "Alright, @HarryToe1 was quick enough last night to make chart request #4 out of 15.  Although I'm currently not a huge fan of $SHAK for an outright bull case the long-term support is still intact.  I'd just need more information before I went long for a swing.  I actually really enjoyed breaking down this chart.  I hope you all find the notes helpful.  Good chart request.",
        "sentiment": {
            "TextBlob": 0.1808641975308642,
            "NLTK": 0.9296,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9990110397338867
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-01-08T01:21:52Z",
        "content": "@Slbre2844 Thanks for the kind words, they're always appreciated.  Alright, #3 on the chart request list for the weekend is $PSTV.  Much like the AUPH chart I just posted for HUDHUD I'm not a fan of biotech.  These stocks are for the gamblers hoping for a miracle, much like the guy who goes to the casino and plays the slot machines all night hoping to win the progressive jackpot.  Sure he stands a chance to win, but the odds are against him and chances are he'll go broke many, many, many, times over attempting to win big.  It just doesn't make financial sense for those of us who are trying to survive and make money playing this game.  PSTV has been putting in lower highs since the beginning of time busting every wallet that thinks, \"this time will be different\" along the way.  If you're in it, I wish you luck.",
        "sentiment": {
            "TextBlob": 0.33749999999999997,
            "NLTK": 0.982,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9957661628723145
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-01-08T00:55:20Z",
        "content": "Alright, chart #2 for the weekend is $AUPH and was requested by @HudHud First of, I'm a bit biased when it comes to biotech companies, because I've seen countless people blow up their accounts over the years chasing miracles because they want to believe.  I'd just rather put my money to work in other places.  Now that we've got that out of the way, here's the chart.  I wish you luck if you're playing.",
        "sentiment": {
            "TextBlob": 0.041666666666666664,
            "NLTK": 0.7717,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9982284903526306
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-01-07T12:12:18Z",
        "content": "Alright, well, I did one quick chart, because the boss lady and I are gonna take off for part of the day, but I'll be back later.   It looks like we currently have 11 chart requests and I said I'll do 15, so if you haven't requested a chart yet now is the time, but like I said, I'm going to cap it this weekend at 15.  @louiskwinthorpe requested $ENPH  Louis and I have had this chart going for about a week and a half now.  These are 1 week candles. The old notes are in white.  This week's notes are in Yellow.  I don't know about you, but my egg consumption has drastically decreased since prices reached $4.99 a dozen.",
        "sentiment": {
            "TextBlob": -0.014814814814814817,
            "NLTK": 0.8462,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9970190525054932
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-01-02T21:45:19Z",
        "content": "@louiskwinthorpe I had this $BCRX chart going for some time now.  These are also weekly candles.",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9935979843139648
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-01-02T21:28:51Z",
        "content": "@walkerwalker $CVM  looks like the bears are running this show, but just maybe some buying will return.  I personally wouldn't be going long right now, but that's just me.",
        "sentiment": {
            "TextBlob": 0.07857142857142857,
            "NLTK": 0.1901,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.7293896675109863
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-01-02T21:24:43Z",
        "content": "@MB76 $ZVRA  It comes down to, \"how lucky do you feel\"?",
        "sentiment": {
            "TextBlob": 0.08888888888888886,
            "NLTK": 0.4215,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.987801730632782
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-01-02T21:17:53Z",
        "content": "@Lewis_Vaughan $SGML  Pretty nice up channel.   Similar setup as we saw in the first half of 2022 possibly developing now.  Bears have short-term control.  We'll have to see if the buying comes back sometime soon.",
        "sentiment": {
            "TextBlob": 0.13333333333333336,
            "NLTK": 0.7184,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9565987586975098
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-01-02T21:06:20Z",
        "content": "@SirSloth $SMG  The last bull leg into the downtrend was pretty strong.  I think we're probably looking at a range for a while.  just my guess.",
        "sentiment": {
            "TextBlob": 0.22777777777777777,
            "NLTK": 0.7579,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9672812223434448
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-01-02T21:02:53Z",
        "content": "@SirSloth $XBI  Sideways she goes.",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9816110134124756
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-01-02T17:48:17Z",
        "content": "It looks like @Twinturbos gets the last chart for now.  This is #10.  Sorry I didn't get to everyone's chart requests, but I need to get going.  However, I will try to get to all of the chart requests, eventually.  If not today I'll get them on the list for next weekend.  Happy trading this week guys and gals!  $UNG",
        "sentiment": {
            "TextBlob": 0.125,
            "NLTK": 0.7871,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9851154685020447
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-01-02T17:32:53Z",
        "content": "@YipMen $WDC is an interesting one and it's in an area where the bulls have had success in the past, but I do have concerns.  As for soap opera recommendations.  Always Day's Of Our Lives.  As a little shaver my grandmother would come to the house to baby sit me.  At lunch time my mother would come home from work and each of us would take our positions on the 3 cushion sofa (I claimed the middle cushion lol) to watch Days of Our Lives!  Here's your chart buddy!",
        "sentiment": {
            "TextBlob": 0.22708333333333333,
            "NLTK": 0.5837,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9905946254730225
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-01-02T17:19:54Z",
        "content": "@MBRUNO825 Interesting chart, thanks for sharing this one.  $CBAY",
        "sentiment": {
            "TextBlob": 0.35,
            "NLTK": 0.8126,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9783610105514526
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-01-02T17:13:00Z",
        "content": "@Thelonius_Stonk $STNE Interesting enough to keep an eye on.",
        "sentiment": {
            "TextBlob": 0.25,
            "NLTK": 0.4019,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9928572177886963
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-01-02T17:08:37Z",
        "content": "@SenseiFalco $NVTA  These are weekly candles.  All I currently see are lower highs in a bear trend.  I wish you luck if you're long.",
        "sentiment": {
            "TextBlob": -0.025,
            "NLTK": 0.5423,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9958255290985107
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-01-02T17:00:06Z",
        "content": "@greasegun $CABA  You always bring me good tickers.  I really hope you caught this rally.",
        "sentiment": {
            "TextBlob": 0.44999999999999996,
            "NLTK": 0.7264,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9994605183601379
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-01-02T16:49:19Z",
        "content": "@Major_Av8r $ESTC  Too early for me to argue a bull case.  We're looking at a bear trend.",
        "sentiment": {
            "TextBlob": 0.1,
            "NLTK": -0.34,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9985319375991821
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-01-02T16:44:35Z",
        "content": "@Pwalia1 $CANO  Long-Term bear trend.  The trend can either be your best friend or your worst enemy.  The choice is always ours.   Hey @Fashtrades does that first bear flag without the follow though you see on this chart look like something we discussed earlier today?",
        "sentiment": {
            "TextBlob": 0.0625,
            "NLTK": 0.3182,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9875790476799011
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-01-02T16:38:26Z",
        "content": "@HolmesWatson $AKBA  Congrats to those who are winning, but we should also be aware of what the long-term trend is showing us.",
        "sentiment": {
            "TextBlob": 0.375,
            "NLTK": 0.5267,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9902511835098267
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-01-02T16:21:10Z",
        "content": "@TroyFars $IAC",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9869725108146667
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-01-02T16:13:53Z",
        "content": "@Fashtrades It's all good.  I just try to point out things you might be missing.  You've become a bit of a project for me.  LMAO  Like I said above, people are likely buying and hoping for a trend reversal, but there is no clear evidence of that happening at this time, it's too early, so I wait.  The game is all about sentiment.  Understanding trader sentiment is a very big part of understanding the game.  I used the tradingview ghost feed to generate something (aqua colored candles) I would need to see before I considered getting bullish.  These aqua candles are not real, or a projection, remember that.  $RIVN $STUDY",
        "sentiment": {
            "TextBlob": 0.022727272727272714,
            "NLTK": 0.5372,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9860158562660217
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2023-01-01T03:18:12Z",
        "content": "$SPY $SPX $ES_F I love posting charts to Stocktwits, but I sometimes wonder just how much value I'm actually adding for those who are still trying to figure this trading thing out.  There are so many moving parts to trading it takes most people many many years before they even have an elementary understanding of technical trading.  I certainly took my lumps along the way.  Anyway, everyone wants to \"figure it out\" fast.  You can study trading online and from the so called \"gurus\" or sit in front of the screens 6 hours a day watching every candlestick go up and down in an effort to understand price patterns.  Either way, learning to trade is going to take years.  Tonight, I want to introduce the \"Replay\" button on Tradingview to those who are not aware of it.  You can replay and paper trade months of price action in just hours.  I still replay every 5m candlestick of the past week at least once every weekend and it takes me 30-60 minutes.  This tool speeds the learning process, use it.",
        "sentiment": {
            "TextBlob": 0.16963118580765646,
            "NLTK": 0.85,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9554555416107178
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2022-12-30T12:25:30Z",
        "content": "$SPX $SPY $ES_F  Well, it's finally here.  The last trading day of the year.  S&P 500 E-MINI 30m candlestick chart along with the lines and boxes I'll be watching most closely today.  Happy Trading.",
        "sentiment": {
            "TextBlob": 0.325,
            "NLTK": 0.7239,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9997046589851379
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2022-12-29T14:18:00Z",
        "content": "$SPX $SPY $ES_F Yesterday, I posted a few charts on the $RTY_F. The charts outlined what I keep an eye on and even a couple of my travels.  Although I didn't over trade (got close), a part of me couldn't wait to post the next \"winning\" chart setup.  This is probably an ego issue (me wanting to show people what I see and what I can do) and that's something I'm working on.  In an effort to overcome this ego situation I'm no longer going to chat or post charts during the trading day.  Here's a video by Rande Howell called, \"Mastering The Urgency To Over Trade\" and I hope it reaches those people who may benefit from it.  Good luck today, I'm always cheering for you. youtube.com/watch?v=Y0JAiLa...",
        "sentiment": {
            "TextBlob": 0.25,
            "NLTK": 0.9201,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.6701224446296692
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2022-12-28T19:45:23Z",
        "content": "$SPX $SPY $ES_F  another update to the $RTY_F chart.  Maybe a little bull charge into the close.  I went long.  We'll see what happens.",
        "sentiment": {
            "TextBlob": -0.11875,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9935977458953857
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2022-12-28T18:26:58Z",
        "content": "$SPY $SPX $ES_F  An update to the $RTY_F chart I posted earlier today.  This is trading folks.",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9974428415298462
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2022-12-28T17:44:32Z",
        "content": "$SPX $SPY $ES_F Every once in a while it's fun to chart the little guys, so today let's give $RTY_F a try.  15 Minute candles.  What's going on here today, did the bulls decide to sleep in?",
        "sentiment": {
            "TextBlob": 0.056249999999999994,
            "NLTK": 0.5106,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9861459136009216
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2022-12-28T17:21:20Z",
        "content": "@louiskwinthorpe I'm more or less just dinking around until the new year, so sure I'll take some chart requests.  Since I forgot to get you a Christmas present this year here's my best analysis for $ENPH  I wish you much success going forward.",
        "sentiment": {
            "TextBlob": 0.3242424242424242,
            "NLTK": 0.9273,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9977292418479919
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2022-12-28T14:14:16Z",
        "content": "$SPY $SPX $ES_F A quick look at some of the most recent support and resistance areas.  Price is currently flirting with the middle of the most recent range. 15 minute sticks.   Best of luck to all who are playing.",
        "sentiment": {
            "TextBlob": 0.29166666666666663,
            "NLTK": 0.9149,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9930688142776489
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2022-12-28T12:20:01Z",
        "content": "$TSLA If you got caught long in this mess, or if you missed one of the best shorts of the year, then maybe it's time to learn some basic technical analysis.",
        "sentiment": {
            "TextBlob": 0.155,
            "NLTK": 0.0323,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9997009038925171
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2022-12-27T21:46:01Z",
        "content": "$ORGN Nobody asked for this chart, but I imagine with a new all time low today people might be wondering if there's any support at all left?  There is still support, but it is within a down channel.  Those who are hoping for a bounce may want to keep an eye on about 3.90.  Now I really am gonna call it a day.  lol  Have a good night folks.",
        "sentiment": {
            "TextBlob": 0.24011544011544012,
            "NLTK": 0.9528,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9954751133918762
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2022-12-27T19:33:59Z",
        "content": "$SPX $SPY $ES_F I've added two more lines to the chart I posted premarket today.  The new lines are in yellow.  Still 15 minute sticks.",
        "sentiment": {
            "TextBlob": 0.21212121212121213,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.997170627117157
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2022-12-27T16:54:56Z",
        "content": "@tillage actually, you messaging me this morning remind me about $BLUE It's had a nice run and of course it could still go higher, but I also think the bulls are probably looking at this like just another bear flag (the yellow ovals)  this one is just larger.  I personally wouldn't be buying right now, but that's just me.",
        "sentiment": {
            "TextBlob": 0.1419642857142857,
            "NLTK": 0.692,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.8938528895378113
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2022-12-27T16:43:49Z",
        "content": "@tillage I'm not sure exactly what you're referring to as \"If the straight line up to $10 is a pole\", but yes, the action since 2021 could be considered a descending triangle.  I charted it as a wide sideways consolidation range because it's had well established tops (red boxes) and well established bottoms (green boxes).  Traders have to understand that sooner or later there will be a breakout.  It's our job to be on the right side of the trade and to use reasonable stops, so we don't destroy ourselves.  It can take days, weeks, or years for a breakout to happen.  A week or two ago I did mention that the recent run off the bottom stopped way short of $7.00, which should be concerning for the bulls since buyer conviction seems to be subsiding.  It was a lower high, a clue.  The bears are currently in control.  I see zero sign of buyers.  Where will the buyers begin to see value again?  I have no idea, but I do watch. $ORGN",
        "sentiment": {
            "TextBlob": 0.029714285714285714,
            "NLTK": 0.9134,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9926387071609497
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2022-12-27T16:05:45Z",
        "content": "$TSLA",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9475893974304199
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2022-12-27T12:31:13Z",
        "content": "$SPX $SPY $ES_F  A few lines and box that might be worth keeping an eye on today.  15 Minute sticks",
        "sentiment": {
            "TextBlob": 0.04999999999999999,
            "NLTK": 0.2263,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9758344888687134
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2022-12-26T20:17:39Z",
        "content": "$SPX $SPY $ES_F Earlier today I posted an SPX chart showing what the bears might currently be looking at.  If you haven't seen that post I would encourage you to read that post first.  This chart contains the bullish argument.  Please, understand that neither of these charts are calls, projections, or advice of any kind.  I don't expect either the bull or bear charts to play out exactly how I've drawn them up.  I'm simply breaking down the charts and giving you a glimpse into how I watch price movement.  There's a lot of notes on this chart, but if you take your time, I think you'll understand it.  Not that the market cares what I think, but If anyone is interested in seeing how I think things may play out over the next 3 months or so, just say, \"let's see it\" and I'll post a chart later this evening with my thoughts. Now might be a good time to go get a cup of coffee and cookie. There's a lot to read on this chart.  lol Have a good afternoon.",
        "sentiment": {
            "TextBlob": 0.2611111111111111,
            "NLTK": 0.9812,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.981340229511261
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2022-12-26T13:23:24Z",
        "content": "$SPX $SPY $ES_F   I see that the suggested stream is a little more congested today, but not bad, so hopefully this post won't scroll off into nothingness too quickly.  This SPX chart is for everyone who enjoys a little technical analysis along with their coffee in the morning.  However, it's also intended for the people who disregard technical analysis all together and say things like, \"technical analysis doesn't work\".  I hope this post helps those who aren't well versed in technical analysis maybe see something they haven't seen in the past. If anyone wants to see a chart outlining \"what the bulls might be thinking\", yep there's always a bull and a bear case, simply write \"let's see it\" below.  If enough people request the bull case chart, I'll post it later today.  Have a good day folks!",
        "sentiment": {
            "TextBlob": 0.10888888888888887,
            "NLTK": 0.9665,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9913414120674133
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2022-12-26T02:26:31Z",
        "content": "$AGNC Let's think about this for a moment.  1.  The stock has a slight upward bias long-term, but it more or less goes sideways in a wide price range most of the time.  2.  AGNC has a 13% dividend that is paid monthly.  Santa only stuffs stockings once a year.  AGNC stuffs stockings 12 times a year.",
        "sentiment": {
            "TextBlob": 0.09444444444444444,
            "NLTK": -0.0516,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9910003542900085
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2022-12-26T00:10:05Z",
        "content": "$SPX $SPY $ES_F It took the largest holiday of the year to do it, but finally, I get the \"suggested stream\" nearly all to myself.  There's tons of confusion right now.  We've got bears calling for the end of the world and we've got bulls calling for the moon and starts.  Basically, nothing has changed.  Nothing ever really does change.  Price goes up, down, and sideways while the savvy traders profit from the price movement.  That's the game!  Now let's get down to brass tacks.  I've taken all the price labels off the chart.  Price labels are a large hindrance to most traders.  It's the price action that we're most interested in.  Even though the S&P 500 didn't exist until 1957 we have price data all the way back to 1871 to work with.  Thank you Tradingview for creating this kind of magic!  Is it even possible that a trendline that first began to emerge back in 1937 could still be valid today???  Like G.I. Joe would say, \"knowing is half the battle.\"",
        "sentiment": {
            "TextBlob": 0.13932748538011697,
            "NLTK": 0.9295,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9941609501838684
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2022-12-25T22:07:04Z",
        "content": "@Walk__it__down Here's the $GRWG chart you requested.  Follow the numbers and hopefully it will all make sense.  Best of luck.",
        "sentiment": {
            "TextBlob": 1.0,
            "NLTK": 0.872,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9974116683006287
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2022-12-25T20:33:53Z",
        "content": "$NLY Annaly Capital Management has been stuffing stocking four times a year (quarterly dividend) for well over 20 years.  Remember, Santa Claus only comes once a year.",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.2732,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9968975782394409
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2022-12-25T13:45:38Z",
        "content": "$GOOD $PFLT Here's a couple monthly dividend payers through a wide angle lens.",
        "sentiment": {
            "TextBlob": 0.3,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9900151491165161
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2022-12-24T02:11:45Z",
        "content": "@Tesla10K The bears have the wind at their backs. $TSLA",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": -0.0516,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.7477839589118958
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2022-12-23T23:02:44Z",
        "content": "$ARKK More proof that trying to pick bottoms in a bear trend is a fools game.",
        "sentiment": {
            "TextBlob": 0.04999999999999999,
            "NLTK": -0.4939,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9996562004089355
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2022-12-23T22:14:30Z",
        "content": "@SPAC_to_the_future Is this the chart you are referring to?  $ORGN",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9974193572998047
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2022-12-23T22:10:23Z",
        "content": "@AndyGo anything can happen, but I find it helpful to ride the coattails of those in charge.  $ADN",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.5719,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9858394265174866
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2022-12-23T19:24:23Z",
        "content": "$ORGN are the bears gaining some traction or are the bulls just taking a break for Christmas?",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.4215,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9989311099052429
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2022-12-23T18:49:00Z",
        "content": "$BTC.X Here's a break from the normal gifts that frequent this stream.  Merry Christmas",
        "sentiment": {
            "TextBlob": 0.125,
            "NLTK": 0.5423,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9969935417175293
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2022-12-23T16:33:29Z",
        "content": "$PLUG Up, Down, or Sideways.  That's pretty much it.  This chart was first posted in November.  The new notes are in yellow.",
        "sentiment": {
            "TextBlob": 0.11346801346801345,
            "NLTK": 0.4939,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9977869987487793
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2022-12-22T21:48:20Z",
        "content": "$SPX $SPY $SP_F  The interesting thing about humans is that they're emotional, which clouds their judgement, so they typically do the exact opposite of what they should be doing when it comes to trading and investing.  I remember watching a youtube video about a retired couple who managed to sell the 2009 bottom.  They sold to close their long positions.  Fear had finally gotten the best of them and they lost nearly all of their life savings/retirement.  This happened to many people and it's a sad story, but this is where a little education can go along ways.  In this chart I've included about 30 years of the S&P 500 price data, but there's over 100 years of price data available supporting a \"buy the dip\" strategy.  Granted nobody knows just how deep the dip will be, but the data supports getting a shopping list ready.  Happy trading.",
        "sentiment": {
            "TextBlob": 0.1821078431372549,
            "NLTK": 0.9575,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9640336036682129
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2022-12-13T17:28:43Z",
        "content": "$SPY $ES_F $SPX Buying low and selling higher just never goes out of style.",
        "sentiment": {
            "TextBlob": 0.125,
            "NLTK": -0.2732,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9987792372703552
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2022-12-13T09:24:50Z",
        "content": "$ES_F $SPX $SPY  Three lines and a box.  That's all for now.",
        "sentiment": {
            "TextBlob": 0.0,
            "NLTK": 0.0,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.995627760887146
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2022-12-11T11:18:14Z",
        "content": "@Fashtrades Yesterday on my travels I saw gas anywhere from 2.68- 3.19.  It's amazing how much the price can differ from town to town.  Not all gas stations carry E88, but a few do.  Our vehicles seem to run fine on it.  The E88 was down in the 2.50's if I remember right.  Fash, I can see our time off from each other has been good.   Sometimes it's best to clear our minds and come back fresh, so we can start to see what the price movement is showing us.  I can tell you're now watching.  Here's a close up view of the $SPX chart you looked at above, but instead of looking at all of 2022 I zoomed in so you can better follow the legs from July to now.  You're beginning to see things, which encourages me to show you more.  Congrats buddy,  Keep going.",
        "sentiment": {
            "TextBlob": 0.2747883597883598,
            "NLTK": 0.988,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9961228966712952
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2022-12-10T21:39:03Z",
        "content": "$CL_F I was never a history buff back in high school, but they didn't teach me technical analysis either.  Now days I love history and filling the gas tank for 2.68 a gallon today sure did feel like winning.  Like G.I. JOE would say, \"Knowing is half the battle\".  2 Month Candlessticks and notes on chart.  $USO",
        "sentiment": {
            "TextBlob": 0.21333333333333335,
            "NLTK": 0.9676,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9937973618507385
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2022-12-09T22:00:58Z",
        "content": "$SPX $SPY $ES_F  This chart is for those who enjoy a little technical analysis on a Friday after close.  Those who don't like technical analysis please disregard this post.  I try really hard not to post cluttered charts, but this time I failed.  If you take a few minutes to read the notes and follow the arrows you'll likely see what I see.  \n History is currently not on the bulls sized, but just maybe Santa Claus will have other ideas.  Best of luck to all, bear or bull.",
        "sentiment": {
            "TextBlob": 0.008712121212121221,
            "NLTK": 0.7683,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9989504814147949
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2022-12-08T21:29:25Z",
        "content": "$AMZN A few things to consider.  1.  The trend is either your best friend or your most despised foe.  The choice is always yours.  2.  Cheap tends to get cheaper.  Expensive tends to get more expensive.   This is a paradox and it causes much confusion among traders  3.  Never be mislead by the goofballs who say what you want to hear.  Their reassurances mean nothing.  See what is real.  Best of luck to all who are playing.  I'm calling it a day.",
        "sentiment": {
            "TextBlob": 0.20875000000000005,
            "NLTK": 0.8841,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9266304969787598
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2022-12-08T16:01:42Z",
        "content": "@Kilosloth Since I'm nearly 100% TA don't you find it odd that you can love me, yet hate TA?  ;) Thanks for the kind words, I do appreciate them.  @tillage To answer your question, yes, this sideways action does change the chart, but I currently don't feel it's changing the chart in either a positive or a negative way.  Price has been at this price level (yellow area) in the past, but this is the longest it's staying in this tight range.   It looks to me like the bulls and bears are currently at a stalemate.   It will require some kind of shift in sentiment (bullish or bearish) to move price out of this range, because there currently is no momentum in either direction.  When I say, \"sentiment change\" I don't necessary mean a big  news event.  A player with enough money to move price can shift sentiment/momentum, which encourages others to join.  I honestly haven't a clue what will happen next.  It looks like a 50/50 bet either way to me.  Sorry I couldn't be of more help. $ORGN",
        "sentiment": {
            "TextBlob": 0.04678138528138527,
            "NLTK": 0.9822,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.9966942071914673
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2022-12-07T10:37:26Z",
        "content": "$SOFI The chart and a few notes.  Have a good day.",
        "sentiment": {
            "TextBlob": 0.24999999999999997,
            "NLTK": 0.4404,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.9995118379592896
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2022-12-01T00:10:39Z",
        "content": "$SPX $SPY $ES_F  Did the train just get rolling, or is it nearing the end of the tracks?  That all depends on who you talk to.  Chalk one up for the Bulls today.  Have a good night guys",
        "sentiment": {
            "TextBlob": 0.7,
            "NLTK": 0.4404,
            "HuggingFace": {
                "label": "NEGATIVE",
                "score": 0.99156254529953
            }
        },
        "image_url": ""
    },
    {
        "username": "Troutter",
        "timestamp": "2022-12-01T00:05:23Z",
        "content": "There are a lot of, dare I say $GOOD looking charts, or is it better to say interesting?  After all, price is right at a known resistance.  GOOD luck to those who are playing.",
        "sentiment": {
            "TextBlob": 0.5371428571428571,
            "NLTK": 0.9191,
            "HuggingFace": {
                "label": "POSITIVE",
                "score": 0.999309778213501
            }
        },
        "image_url": ""
    }
]